{
  "# Construction of Long-Term Seismic Catalog with Deep Learning: A Workflow for Localized Self-Attention RNN (LoSAR)  _en_zh_google": "# 深度学习的长期地震目录的构建：局部自我发挥RNN(LOSAR)的工作流程(LOSAR)",
  "Yijian Zhou $^{\\mathrm{~1~}}{}$ , Hongyang Ding $^2$ , Abhijit Ghosh $^3$ , and Zengxi Ge $^4$   \n$^{1}$ Department of Earth and Planetary Sciences, University of California Riverside   \n$^2$ Institute of Theoretical and Applied Geophysics, Peking University   \n$^{3}$ University of California, Riverside   \n$^4$ Peking University  _en_zh_google": "Yijian Zhou $^{\\mathrm{~1~}}$，hongyang ding $^2$，abhijit ghosh $^3$和zengxi ge __ _____l_math_3__   \n$^{1}$地球与行星科学系，加利福尼亚大学河滨分校   \n$^2$北京大学理论和应用地球物理学院   \n$^{3}$加利福尼亚大学河滨分校   \n$^4$北京大学",
  "April 26, 2024  _en_zh_google": "2024年4月26日",
  "# Abstract  _en_zh_google": "# 抽象的",
  "Characterizing fault behaviors prior to large earthquakes through long-term seismicity is crucial for seismic hazard assessment, yet constructing high-resolution catalogs over extended periods poses significant challenges. This study introduces LoSAR, a novel deep learning-driven workflow that enhances phase picking by Localizing a Self-Attention Recurrent neural network with local data, addressing the generalization problem common in data-driven approaches. We apply LoSAR to two distinct regions that are both featured by recent large earthquakes: (1) preseismic period of the Ridgecrest-Coso region (2008-2019), and (2) pre-postseismic period of the East Anatolian Fault Zone (EAFZ, 2020-2023/04). Through detailed comparisons, we demonstrate that LoSAR offers slightly higher detection completeness than the QTM matched filter catalog, while boosts an over 100 times faster processing and a superior temporal stability, avoiding low-magnitude gaps during background periods. Against PhaseNet and GaMMA, two established phase picker and associator, LoSAR proves more scalable and generalizable, achieving roughly 2.5 times more event detections in the EAFZ case, along with a $^{-}7$ times higher phase association rate. By leveraging the two enhanced catalogs and b-value analysis, we gain insights into the preseismic fault behaviors: (1) The Ridgecrest faults are characterized by sparse and distributed seismicity across a band of $\\widetilde{\\mathbf{\\Gamma}}_{20}$ km, revealing multiple orthogonal preexisting faults; coupled with a low b-value that signifies this area as a persistent asperity; (2) The Erkenek-Pitirge segment of EAFZ exhibits complex fault geometry that forms a persistent rupture barrier, which consists of a hidden conjugate fault system that presents as a $\\mathit{\\tilde{\\Pi}}_{10}$ -km wide fault zone.  _en_zh_google": "通过长期地震性在大地震之前表征断层行为对于地震危害评估至关重要，但是在长时间内构建高分辨率目录会带来重大挑战。这项研究介绍了Losar，这是一种新型的深度学习驱动的工作流程，通过将自我发项的复发性神经网络与局部数据进行定位，从而增强了相位的选择，从而解决了数据驱动方法中常见的概括问题。我们将Losar应用于最近大地震的两个不同区域：(1)Ridgecrest-Coso地区的preseismic时期(2008-2019)，以及(2)东阿纳托利亚断层区的postseismic时期(EAFZ，2020-2023/04)。通过详细的比较，我们证明了Losar的检测完整性比QTM匹配的滤镜目录略高，而增强的处理速度超过100倍，并且具有出色的时间稳定性，从而避免了背景期间的低稳定性差距。针对两个已建立的相拾音器和联合人的Phasenet和Gamma，Losar证明了更可扩展和可推广的情况，在EAFZ情况下实现了大约2.5倍的事件检测，以及$^{-}7$乘以更高的相关率。通过利用这两个增强的目录和B值分析，我们可以洞悉preseismiscic的断层行为：(1)Ridgecrest断层的特征是___ All_math_1__ km的频段稀疏和分布式地震性，揭示了多个正脉的preexististististististististististististsistsistsistsistsists；加上低B值，这意味着该区域是持续的垂体。 (2)EAFZ的Erkenek -Pitirge片段表现出复杂的断层几何形状，形成了持续的破裂屏障，该断层屏障由隐藏的共轭断层系统组成，该系统以__ All_math_2__ -km宽的断层区域呈现。",
  "# 1 Construction of Long-Term Seismic Catalog with Deep 2 Learning: A Workflow for Localized Self-Attention RNN 3 (LoSAR)  _en_zh_google": "# 1构建长期地震目录的深度学习：局部自我发挥的工作流程RNN 3(LOSAR)",
  "4 Yijian Zhou1\\*, Hongyang $\\mathbf{D}\\mathbf{ing}^{2}$ , Abhijit Ghosh1, and Zengxi $\\mathbf{Ge}^{2}$ 1Department of Earth and Planetary Sciences, University of California, Riverside, USA 2Institute of Theoretical and Applied Geophysics, Peking University, Beijing, China Corresponding author: Yijian Zhou (yijian.zhou@email.ucr.edu)  _en_zh_google": "4 Yijian Zhou1\\*, Hongyang $\\mathbf{Ding}^{2}$ , Abhijit Ghosh1, and Zengxi $\\mathbf{Ge}^{2}$ 1Department of Earth and Planetary Sciences, University of California, Riverside, USA 2Institute of Theoretical and Applied Geophysics, Peking University, Beijing, China Corresponding author: Yijian Zhou (yijian.zhou@email.ucr.edu)",
  "# Highlights:  _en_zh_google": "# 亮点：",
  "• We developed a workflow to Localize a Self-Attention RNN (LoSAR) phase picking model, which realizes stable and efficient phase picking. The Ridgecrest region has weak but distributed seismicity before the mainshock, and the low b-value suggest a persistent asperity.   \nThe Erkenek-Pütürge segment of East Anatolian Fault Zone is associated with geometrical complexity, thus represents a persistent barrier.  _en_zh_google": "•我们开发了一个工作流程，以定位自我发项的RNN(Losar)相拾取模型，该模型实现了稳定且有效的相位拾取。 Ridgecrest区域在主震前的地震性较弱，但分布分布，低b值表明持续的垂体。   \n东安纳托利亚断层区的Erkenek-pütürge段与几何复杂性有关，因此代表了持续的屏障。",
  "Characterizing fault behaviors prior to large earthquakes through long-term seismicity is crucial for seismic hazard assessment, yet constructing high-resolution catalogs over extended periods poses significant challenges. This study introduces LoSAR, a novel deep learning-driven workflow that enhances phase picking by Localizing a Self-Attention Recurrent neural network with local data, addressing the generalization problem common in data-driven approaches. We apply LoSAR to two distinct regions that are both featured by recent large earthquakes: (1) preseismic period of the Ridgecrest-Coso region (2008-2019), and (2) pre-postseismic period of the East Anatolian Fault Zone (EAFZ, 2020-2023/04). Through detailed comparisons, we demonstrate that LoSAR offers slightly higher detection completeness than the QTM matched filter catalog, while boosts an over 100 times faster processing and a superior temporal stability, avoiding low-magnitude gaps during background periods. Against PhaseNet and GaMMA, two established phase picker and associator, LoSAR proves more scalable and generalizable, achieving roughly 2.5 times more event detections in the EAFZ case, along with a $^{\\sim7}$ times higher phase association rate. By leveraging the two enhanced catalogs and b-value analysis, we gain insights into the preseismic fault behaviors: (1) The Ridgecrest faults are characterized by sparse and distributed seismicity across a band of ${\\sim}20\\mathrm{km}$ , revealing multiple orthogonal preexisting faults; coupled with a low b-value that signifies this area as a persistent asperity; (2) The Erkenek-Pütürge segment of EAFZ exhibits complex fault geometry that forms a persistent rupture barrier, which consists of a hidden conjugate fault system that presents as a ${\\sim}10{\\mathrm{-km}}$ wide fault zone.  _en_zh_google": "通过长期地震性在大地震之前表征断层行为对于地震危害评估至关重要，但是在长时间内构建高分辨率目录会带来重大挑战。这项研究介绍了Losar，这是一种新型的深度学习驱动的工作流程，通过将自我发项的复发性神经网络与局部数据进行定位，从而增强了相位的选择，从而解决了数据驱动方法中常见的概括问题。我们将Losar应用于最近大地震的两个不同区域：(1)Ridgecrest-Coso地区的preseismic时期(2008-2019)，以及(2)东阿纳托利亚断层区的postseismic时期(EAFZ，2020-2023/04)。通过详细的比较，我们证明了Losar的检测完整性比QTM匹配的滤镜目录略高，而增强的处理速度超过100倍，并且具有出色的时间稳定性，从而避免了背景期间的低稳定性差距。针对两个已建立的相拾音器和联合人的Phasenet和Gamma，Losar证明了更可扩展和可推广的情况，在EAFZ情况下实现了大约2.5倍的事件检测，以及$^{\\sim7}$乘以更高的相关率。通过利用两个增强的目录和B值分析，我们可以深入了解preseissic的断层行为：(1)Ridgecrest断层的特征是跨$\\sim 20\\mathrm{km}$的稀疏和分布式地震性，揭示了多个正殖的proexpreexisting Pereexisting Persecisting Persecisting pressists;加上低B值，这意味着该区域是持续的垂体。 (2)EAFZ的Erkenek-pütürge段表现出复杂的断层几何形状，形成了持续的破裂屏障，由隐藏的共轭断层系统组成，该系统以$\\sim 10{\\mathrm{-km}}$宽断层区域形式出现。",
  "# Plain Language Summary  _en_zh_google": "# 普通语言摘要",
  "Understanding how faults behave before big earthquakes can help us better prepare for these events, but tracking these faults over a long time is tricky. In our research, we've developed a new method called LoSAR that uses advanced technology to improve how we detect earthquakes by tailoring it with specific local data. This method helps us avoid common issues found in other data-based techniques. We tested LoSAR in two areas known for their significant earthquakes: the Ridgecrest-Coso region in the USA and the East Anatolian Fault Zone (EAFZ) in Turkey, covering events before, during, and after these big earthquakes. Our findings show that LoSAR is not only faster but also more consistent in detecting earthquakes than other methods. Particularly in Turkey, LoSAR was able to identify many more seismic events accurately. From this work, we've learned manuscript submitted to Journal of Geophysical Research: Solid Earth  _en_zh_google": "了解错误在大地震之前的表现如何帮助我们更好地为这些事件做准备，但是在很长一段时间内跟踪这些缺陷是棘手的。在我们的研究中，我们开发了一种名为Losar的新方法，该方法使用先进的技术来改善我们如何通过使用特定的本地数据来调整地震的方式。此方法有助于我们避免在其他基于数据的技术中发现的常见问题。我们在以其巨大地震而闻名的两个地区测试了Losar：美国的Ridgecrest-Coso地区和土耳其的东安纳托利断层区(EAFZ)，涵盖了这些大地震之前，期间和之后的事件。我们的发现表明，Losar不仅比其他方法更快，而且在检测地震方面的一致性更高。特别是在土耳其，Losar能够准确识别更多的地震事件。从这项工作中，我们学到了提交给地球物理研究杂志的手稿：固体地球",
  "45 that the Ridgecrest area shows signs of long-standing stress across a broad network of faults,   \n46 indicating a high potential for earthquakes. Similarly, in the EAFZ, we discovered a complex   \n47 network of faults that acts as a barrier to earthquake spread. These insights are crucial for better   \n48 understanding earthquake risks and preparing for future seismic events.  _en_zh_google": "45 Ridgecrest区域显示了在广泛的故障网络中长期压力的迹象，   \n46表示地震的潜力很高。同样，在EAFZ中，我们发现了一个复杂   \n47故障网络，充当地震障碍的障碍。这些见解至关重要   \n48了解地震风险并为未来的地震事件做准备。",
  "# 1. Introduction  _en_zh_google": "# 1。简介",
  "Microseismicity provides a direct indication to the fault structure and slip behavior at depth. Such strategy is especially useful when the fault slips at a high rate, e.g. during early aftershock period (e.g. Zhou et al., 2022a; Ding et al., 2023; Shelly et al., 2024), or other intense seismic sequences (e.g. Ross et al., 2020; Tan et al., 2021; Gong and Fan, 2022). However, a huge portion of faults generate low seismicity rate during the interseismic period because of a high locking ratio or a low fault slip rate (e.g. Jiang and Lapusta, 2016; Bletery et al., 2020; Chamberlain et al., 2021; Uchida and Bürgmann, 2021; Zhou et al., 2022b), while, unfortunately, these faults are also prone to large earthquakes (Sykes, 2021; Lay and Nishenko, 2022). To study such lowseismicity faults, a long-term observation is always necessary. For example, Schurr et al. (2020) built a seismic catalog for 7 years before the 2014 Iquique earthquake, and found that the premainshock seismicity complements the coseismic slip; Sugan et al. (2023) observed a 8-year migration of seismicity towards the nucleation area of the 2016 central Italy seismic sequence. Technically, the construction of long-term catalogs requires a workflow that is both computationally efficient and of high detection completeness, which is still a challenging task.  _en_zh_google": "微震震可直接指示深度的断层结构和滑动行为。当断层以高速率滑倒时，这种策略特别有用，例如在余震早期(例如，Zhou等，2022a; ding等，2023; Shelly等，2024)或其他强烈的地震序列(例如Ross等，2020; Tan等，2021; 2021; Gong and Fan and Fan and Fan，2022222)。然而，由于锁定率很高或断层滑动速率高(例如，江和拉普斯塔，2016; bletery et al。，2020; Chamberlain等人，2021年; Uchida andBürgmann，2021年；地震(Sykes，2021； Lay and Nishenko，2022)。为了研究这种低估性断层，始终需要长期观察。例如，Schurr等。 (2020年)在2014年伊基(Iquique)地震之前建造了一个地震目录，已有7年的历史，并发现前震的地震是补充了coseismisic的滑移。 Sugan等。 (2023)观察到地震性向2016年意大利中央地震序列的成核区域进行了8年的迁移。从技术上讲，长期目录的构建需要一个既有计算上有效又具有高检测完整性的工作流程，这仍然是一项艰巨的任务。",
  "64 Currently, two types of cataloging workflow can realize a state-of-the-art performance: (1)   \n65 the PAL-style workflow that follows “phase Picking – phase Association – event Location”   \n66 procedure (e.g. Zhou et al., 2021b; Zhang et al., 2022; Zhu et al., 2022b), and (2) the matched filter   \n67 technique (MFT) that utilizes pre-detected events as templates to detect similar events (e.g. Ross   \n68 et al., 2019a; Shelly, 2020; Neves et al., 2022). The detection completeness of PAL-style   \n69 workflows is basically dependent on the phase picking algorithm. In recent years, algorithms based   \n70 on artificial intelligence (AI), specifically deep learning, realize outstanding phase picking   \n71 performance in terms of the detectability and picking precision (e.g. Zhu and Beroza, 2018; Zhou   \n72 et al., 2019; Mousavi et al., 2020; Yu and Wang, 2022; Sun et al., 2023). Most of these models,   \n73 e.g. PhaseNet (Zhu and Beroza, 2018), are trained on regional or global datasets, aiming at building   \n74 a general model that works for various data not included in the training set. However, systematic   \n75 tests show that the AI pickers can suffer from inconsistent performance among data in different   \n76 regions (e.g. Chai et al., 2020; Jiang et al., 2021; Münchmeyer et al., 2022; Zhu et al., 2022a; Park   \n77 et al., 2023; Bornstein et al., 2024), indicating a lower generalizability compared with traditional   \n78 rule-based algorithms, such as short-term-average over long-term average (STA/LTA). The MFT   \n79 methods can realize even higher detection ability than AI pickers (e.g. Mousavi et al., 2019; Zhou  _en_zh_google": "64当前，两种类型的编目工作流可以实现最先进的性能：(1)   \n65“阶段拾取 - 相关 - 事件位置”之后的PAL风格工作流程   \n66程序(例如Zhou等，2021b; Zhang等，2022; Zhu等，2022b)和(2)匹配的滤镜   \n67使用预测事件作为模板检测类似事件的技术(MFT)(例如Ross   \n68等，2019a;雪莉，2020年； Neves等，2022)。触及式的检测完整性   \n69个工作流程基本上取决于相位拾取算法。近年来，基于算法   \n70关于人工智能(AI)，特别是深度学习，实现了出色的阶段选择   \n71在可检测性和挑选精度方面的性能(例如Zhu and Beroza，2018; Zhou   \n72等人，2019年； Mousavi等，2020； Yu和Wang，2022年； Sun等，2023)。大多数这些模型，   \n73，例如Phasenet(Zhu and Beroza，2018年)接受了区域或全球数据集的培训，旨在建造   \n74一个通用模型，适用于未包含培训集中的各种数据。但是，系统   \n75个测试表明，AI采摘器可能会遭受不同数据的不一致性能   \n76个地区(例如Chai等，2020; Jiang等，2021;Münchmeyer等，2022; Zhu等，2022a; Park   \n77等，2023; Bornstein等，2024)，表明与传统相比较低   \n78个基于规则的算法，例如长期平均水平(STA/LTA)的短期平均水平。 MFT   \n79种方法比AI采摘器实现更高的检测能力(例如Mousavi等，2019; Zhou",
  "et al., 2021a; Yoon and Shelly, 2024), but its low computational efficiency makes it difficult to process big data (Ross et al., 2019b). Moreover, the detection results of MFT may be biased by incomplete templates (e.g. Herrmann and Marzocchi, 2020). In summary, the AI-based picker is the most promising method that combines both high efficiency and high detectability, whereas further improvements are needed to realize a consistent picking performance on a large spatiotemporal range of data.  _en_zh_google": "等，2021a; Yoon和Shelly，2024)，但其计算效率低使得很难处理大数据(Ross等，2019b)。此外，MFT的检测结果可能会被不完整的模板偏置(例如Herrmann和Marzocchi，2020年)。总而言之，基于AI的采摘器是结合高效率和高可检测性的最有前途的方法，而需要进一步的改进来实现在大量时空范围的数据范围内保持一致的选择性能。",
  "In this paper, we introduce a novel cataloging workflow powered by deep learning, featuring the Localization of Self-Attention RNN (LoSAR) for phase picking, tailored with local data. This approach effectively addresses the challenge of generalization faced by deep learning models. We apply the LoSAR workflow on two cases that covers a local-to-regional scale and years-to-decade time length, in order to demonstrate its advantage in building long-term catalogs.  _en_zh_google": "在本文中，我们介绍了一种新型的编目工作流，该工作流程由深度学习提供动力，其中包括自我发挥的RNN(Losar)的定位，用于相拾取，并根据本地数据量身定制。这种方法有效地解决了深度学习模型所面临的概括的挑战。我们将LOSAR工作流程应用于两个涵盖本地到区域规模和十年时间长度的案例，以证明其在构建长期目录方面的优势。",
  "# 2. Methods  _en_zh_google": "# 2。方法",
  "# 2.1 Overview of the LoSAR Workflow  _en_zh_google": "# 2.1 Losar工作流程的概述",
  "As reviewed in the Introduction section, the first-generation AI pickers attempt to provide a pre-trained model suitable for all datasets, which has not been very successful so far. Instead, we designed a new workflow that generates a local training set to obtain a locally optimized neural network (Figure 1). This workflow is composed of a detection module followed by a location module, and the detection module consists of two major steps: the model training step and the model application step.  _en_zh_google": "如介绍部分所述，第一代AI采摘器试图提供适合所有数据集的预训练模型，到目前为止，这还不是很成功。取而代之的是，我们设计了一种新的工作流程，该新工作流程生成本地培训集以获得本地优化的神经网络(图1)。该工作流程由检测模块组成，然后是位置模块，检测模块由两个主要步骤组成：模型训练步骤和模型应用程序步骤。",
  "In the model training step of the earthquake detection module, we utilize the PAL method (Zhou et al., 2021b) to construct a local training set (Figure 1). PAL utilizes rule-base algorithms for phase picking and association, thus does not have generalization problem as for deep learning. Tests on the 2019 Ridgecrest aftershock sequence show that PAL realizes around 2 times the number of detections by the Southern California Seismic Network (SCSN) (Zhou et al., 2021b), and PAL has been successfully applied in multiple regions and seismic sequences (e.g. Zhou et al., 2021a; Zhou et al., 2022b; Ding et al., 2023). Since the detection of PAL is basically made by the STA/LTA algorithm, which detects both earthquakes and pulse-like noises (e.g. anthropogenic noise or data glitches), we usually set a relatively high triggering threshold to avoid high false detection ratio and to reliably detect high signal-to-noise ratio (SNR) events. The PAL detections serve as the training set for our deep learning model, which can realize stable detections for weak signals. Note that deep learning models usually require a large number of training samples to tune the hyper-parameters, but the number of training samples is dependent on the model complexity. Thus, for light-weight models (e.g. Zhou et al., 2019; Yu and Wang, 2022), as that used in this study (see the next subsection for details), a relatively small training set is required to optimize the neural network (Mousavi et al., 2020; Zhou et al., 2021a).  _en_zh_google": "在地震检测模块的模型训练步骤中，我们利用PAL方法(Zhou等，2021b)来构建局部训练集(图1)。 PAL利用规则基本算法进行相位拾取和关联，因此没有对深度学习的概括问题。对2019年Ridgecrest余震序列的测试表明，PAL意识到南加州地震网络(SCSN)(Zhou等，2021b)的检测数量的2倍，并且PAL已成功地应用于多个地区和SEISTIC序列中(例如由于PAL的检测基本上是由STA/LTA算法进行的，该算法检测到地震和类似脉搏的噪声(例如人为噪声或数据故障)，我们通常设置了相对较高的触发阈值以避免较高的假检测率并可靠地检测高信号到噪声范围的事件(SNR)事件(SNR)事件。 PAL检测是我们深度学习模型的训练集，该训练可以实现弱信号的稳定检测。请注意，深度学习模型通常需要大量的培训样本来调整超参数，但是训练样本的数量取决于模型的复杂性。因此，对于本研究中使用的轻重量模型(例如，Zhou等，2019; Yu和Wang，2022)(有关详细信息，请参见下一个小节)，需要相对较小的训练集来优化神经网络(Mousavi等人，2020年，2020年； Zhou等，2021a)。",
  "After the model training step, we simply substitute the PAL picker with the locally-trained SAR picker (LoSAR), and associate the LoSAR picks with PAL associator (Figure 1). The PAL associator groups pairs of P&S picks into events based on their travel time-location relationship, and it also obtains a grid-searched location in the meantime. The magnitude calculation is also completed by the PAL associator in the local magnitude scale $\\mathrm{(M_{L})}$ , based on the S-wave amplitude and hypocentral distance (please refer to Zhou et al., 2021b for more details). We will show in this paper that this LoSAR workflow realizes $>2.5$ times more event detections compared with PAL, and is of a much higher detection stability and accuracy. It also generalizes well among very different tectonic settings, spatial scales, and network configurations.  _en_zh_google": "在模型训练步骤之后，我们只需将PAL选择器用当地训练的SAR选择器(Losar)代替，然后将Losar Picks与PAL Associator相关联(图1)。 PAL Associator将P＆S对基于其旅行时间的关系将其挑选到活动中，并且在此期间也获得了一个网格搜索的位置。 PAL协会的计算也由局部幅度尺度$\\mathrm{(M_{L})}$完成，基于S波幅度和中心距离(请参阅Zhou等人，2021b，有关更多详细信息)。我们将在本文中表明，与PAL相比，该LOSAR工作流程实现了_$>2.5$的事件检测的倍数，并且检测稳定性和准确性更高。它还在非常不同的构造设置，空间尺度和网络配置之间概括了。",
  "![](images/03d5269e7c5a9d1a20406a73ba4923c72e475cec89f00d63341f816631117c9b.jpg)  \nFigure 1. The Localized Self-Attention RNN (LoSAR) workflow. The blue and yellow modules denote the detection and location algorithms, respectively. PAL refers to an rule-based cataloging workflow developed by Zhou et al. (2021b); SAR refers to Self-Attention RNN phase picking model developed in  _en_zh_google": "![](images/03d5269e7c5a9d1a20406a73ba4923c72e475cec89f00d63341f816631117c9b.jpg)  \n图1。局部自我发场RNN(LOSAR)工作流程。蓝色和黄色模块分别表示检测和位置算法。 PAL是指Zhou等人开发的基于规则的编目工作流。 (2021b); SAR是指在",
  "this study. CT/dt.ct and CC/dt.cc refer to catalog-based and cross-correlation-based differential travel time, following the hypoDD terminology. The ph2dt_cc module is a CC-based differential time calculation method developed in this study.  _en_zh_google": "这项研究。 CT/DT.CT和CC/DT.CC遵循基于目录的基于目录和基于互相关的差异旅行时间。 PH2DT_CC模块是本研究中开发的一种基于CC的差异时间计算方法。",
  "To locate and relocate the detections, we build interface for HypoInverse (abbreviated as HypoINV thereafter, Klein, 2002) and HypoDD (Waldhauser and Ellsworth, 2000; Waldhauser, 2001) (Figure 1). HypoINV is a widely adopted algorithm for absolute location, which minimize the travel times in an iterative manner, where the weight for the phases are adaptively determined based on their epicentral distance and residual time (Klein, 2002). HypoDD is a double-difference (DD) relocation algorithm that minimizes the differential travel times between event pairs to constrain their relative locations (Waldhauser and Ellsworth, 2000). Given that the fault structure is manifested by the relative locations in seismicity imaging, the relocation process can significantly improve the imaging resolution (e.g. Waldhauser and Ellsworth, 2000; Trugman and Shearer, 2017; Lomax and Savvaidis, 2022). Notably, the differential time $(d t)$ data used in hypoDD can come from catalog picks (CT, i.e. dt.ct) or cross-correlation (CC, i.e. dt.cc), and they can be jointly inversed or used individually. The best practice of using dt.ct and dt.cc comes from their different characteristics: dt.ct covers a larger inter-event distance, whereas the precision is relatively low, because it is dependent on the phase picking and location accuracy; dt.cc realize a sub-sampling-rate measurement for the differential time and is unaffected by picking errors, but it covers a much smaller distance, because it relies on waveform similarity between event pairs (as summerized in Waldhauser, 2001). Thus, jointly using dt.ct and dt.cc in some way is usually suggested. In our LoSAR workflow, we provide two approaches of combining dt.ct and dt.cc (Figure 1): (1) sequentially relocate with only dt.ct and dt.cc, and (2) relocate with dt.ct in the first step and jointly inverse dt.ct & dt.cc in the second relocation. The first approach is suitable for a relatively dense seismic network, because the near-source stations tend to have higher CC values; the second approach can maintain more events under a relatively sparse network, while also take advantage of the high-precision dt.cc data.  _en_zh_google": "为了定位和重新定位检测，我们建立了用于次要的界面(此后缩写为Hypoinv，Klein，2002)和HypoDD(Waldhauser和Ellsworth，2000; Waldhauser，2001)(图1)。 HypoINV是一种广泛采用的绝对位置算法，它以迭代方式最小化了行进时间，在该算法中，基于它们的地下距离和残留时间，可以自适应地确定相位的重量(Klein，2002)。 HypODD是一种双差(DD)重定位算法，可最大程度地减少事件对之间的差异旅行时间以限制其相对位置(Waldhauser and Ellsworth，2000年)。鉴于断层结构在地震性成像中的相对位置表现出来，恢复过程可以显着改善成像分辨率(例如Waldhauser和Ellsworth，2000; Trugman and Shearer，2017; Lomax and Savvaidis，2022)。值得注意的是，差异时间$(d t)$ hydoDD中使用的数据可能来自目录选片(CT，即DT.CT)或互相关(CC，即dt.cc)，并且可以共同反转或单独使用或单独使用。使用DT.CT和DT.CC的最佳实践来自其不同的特征：DT.CT涵盖了较大的事件间距离，而精度相对较低，因为它取决于相位的选择和位置精度； dt.cc实现了差分时间的子采样率测量值，并且不受选择错误的影响，但它涵盖了较小的距离，因为它依赖于事件对之间的波形相似性(如Waldhauser在Waldhauser，2001年的夏季)。因此，通常建议以某种方式共同使用DT.CT和DT.CC。在我们的LOSAR工作流程中，我们提供了两种方法，即将DT.CT和DT.CC(图1)组合(图1)：(1)仅使用DT.CT和DT.CC依次重新安置，(2)(2)在第一步中与DT.CT一起重新安置，并在第二个重置中将DT.CT重新安置。第一种方法适用于相对密集的地震网络，因为近源站往往具有更高的CC值。第二种方法可以在相对稀疏的网络下维护更多事件，同时还可以利用高精度DT.CC数据。",
  "The calculation of differential times is the fundamental step for hypoDD relocation. The hypoDD software (Waldhauser, 2001) provides a ph2dt module that calculate the dt.ct data from the input phase file. It forms a chain of $d t\\cdot$ -links between events by searching neighboring events within a certain radius. For each event, a maximum number of neighboring events are preset in this process, in order to lower down the computational complexity and model errors. Following a  _en_zh_google": "差异时间的计算是降低恢复的基本步骤。 HypoDD软件(Waldhauser，2001)提供了一个PH2DT模块，该模块从输入阶段文件中计算DT.CT数据。它通过在某个半径内搜索相邻事件，形成了$d t\\cdot$-链接事件之间的链条。对于每个事件，在此过程中预设了最大数量的相邻事件，以降低计算复杂性和模型错误。遵循",
  "159 similar strategy, we develop a ph2dt_cc module to calculate the high-precision dt.cc data with   \n160 waveform cross-correlation (Figure S10). It first finds all possible event pairs by comparing the   \n161 location differences and the common station picks. For each event pair, only events within a certain   \n162 hypocentral separation and with certain number of shared stations are selected as candidates. To   \n163 control the quality of $d t$ measurements, we only use stations within an epicentral distance of about   \n164 $100~\\mathrm{km}$ , and too small events (e.g. $\\mathbf{M}_{\\mathrm{L}}{<}0$ ) cannot be linked to each other. To avoid too many   \n165 measurements, we also limit the maximum number of stations for each event pair, and each event   \n166 can only be linked to a maximum number of neighbors. Secondly, we calculate the CC-derived dt   \n167 for each candidate event pair. In the CC calculation, users can set the window length, which   \n168 channel to use, and the filtering frequency band. The weight for each phase used in the hypoDD is   \n169 determined by the square root of CC value. After the CC calculation, we further select the dt   \n170 measurements by discarding that with a too large dt or a too small CC, and the minimum number   \n171 of station criteria still applies afterwards. Detailed parameters will be given for each real case in   \n172 the following sections.  _en_zh_google": "159类似策略，我们开发了一个PH2DT_CC模块，以计算使用高精度DT.CC数据   \n160波形互相关(图S10)。它首先通过比较   \n161位置差异和公共站选项。对于每个事件对，只有特定的事件   \n162次中心分离和一定数量的共享站点作为候选者。到   \n163控制$d t$测量的质量   \n164 $100~\\mathrm{km}$，而太小的事件(例如__ All_math_2__)不能互相链接。避免太多   \n165测量值，我们还限制了每个事件对的最大电台数量，每个事件   \n166只能链接到最大数量的邻居。其次，我们计算CC衍生的DT   \n每个候选活动对167。在CC计算中，用户可以设置窗口长度，该窗口长度   \n168通道使用和滤波频带。缩写中使用的每个阶段的重量为   \n169由CC值的平方根确定。 CC计算后，我们进一步选择DT   \n170通过用太大的DT或太小CC丢弃的测量   \n此后，171个车站标准仍然适用。将为每个实际情况提供详细的参数   \n172以下各节。",
  "# 2.2 Self-Attention RNN (SAR) Model for Phase Picking  _en_zh_google": "# 2.2自我发行RNN(SAR)模型用于相拾取",
  "The performance of a deep learning model is decided by multiple factors, including the model structure, target function (labeling strategy), training data, and training parameters. Here, we introduce a new phase picking neural network stemming from our previous work (Zhou et al., 2019), but incorporates the recent advances in this field targeting at the above factors (Figure 2).  _en_zh_google": "深度学习模型的性能由多种因素决定，包括模型结构，目标功能(标签策略)，培训数据和培训参数。在这里，我们介绍了一个新的阶段选择神经网络，该神经网络来自我们以前的工作(Zhou等，2019)，但在以上因素上纳入了该领域的最新进展(图2)。",
  "We adopt a Self-Attention RNN (SAR) model for phase picking. RNN is a typical deep learning model for sequence modelling, and has been widely adopted in various tasks related to time series, including speech recognition (e.g. Graves and Jaitly, 2014; Hannun et al., 2014) and natural language processing (e.g. Cho et al., 2014; Sutskever et al., 2014). Compared with Transformer (Vaswani et al., 2017), which is recently proven to be powerful in sequence-related tasks, RNNs have much fewer parameters, thus are more data-efficient and require less computational resources, making them a practical choice for small datasets (Ezen-Can, 2020; Peng et al., 2023). RNNs process sequences in a recurrent manner: generating outputs for each time step by integrating the current input with a hidden state that captures previously encountered sequence information. Zhou et al. (2019) first adopt a 2-layer bi-directional Gated Recurrent Unit (GRU) RNN in the phase picking task, where the RNN is trained to classify each 1-s time step as noise,  _en_zh_google": "我们采用自我发项的RNN(SAR)模型进行相拾取。 RNN是序列建模的典型深度学习模型，并且在与时间序列有关的各种任务中已被广泛采用，包括语音识别(例如Graves和Jaitly，2014; Hannun等，2014)和自然语言处理(例如Cho等，2014; Sutskever等，2014，2014)。与变压器(Vaswani等人，2017年)相比，最近被证明在序列相关的任务中具有功能强大，RNN的参数较少，因此比数据效率更高，需要更少的计算资源，使其成为小型数据集的实际选择(Ezen-Can，2020; Peng et el。，20233)。 RNNS以经常性的方式进行过程序列：通过将当前输入与隐藏的状态集成到以前遇到的序列信息的隐藏状态，从而为每个时间步生成输出。周等人。 (2019年)首先采用2层双向门控复发单元(GRU)RNN，在阶段拾取任务中，对RNN进行了训练，以将每个1-S时间步长分为噪声，",
  "128   \n129   \n130   \n131   \n132   \n133   \n134   \n135   \n136   \n137   \n138   \n139   \n140   \n141   \n142   \n143   \n144   \n145   \n146   \n147   \n148   \n149   \n150   \n151   \n152   \n153   \n154   \n155   \n156   \n157   \n158  _en_zh_google": "128   \n129   \n130   \n131   \n132   \n133   \n134   \n135   \n136   \n137   \n138   \n139   \n140   \n141   \n142   \n143   \n144   \n145   \n146   \n147   \n148   \n149   \n150   \n151   \n152   \n153   \n154   \n155   \n156   \n157   \n158",
  "189  \n190  \n191  \n192  \n193  \n194  \n195  \n196  \n197  \n198  \n199  \n200  \n201  \n202  \n203  \n204  \n205  \n206  \n207  \n208  \n209  \n210  \n211  \n212  \n213  \n214  \n215  \n216  \n217  \n218  \n219  _en_zh_google": "189  \n190  \n191  \n192  \n193  \n194  \n195  \n196  \n197  \n198  \n199  \n200  \n201  \n202  \n203  \n204  \n205  \n206  \n207  \n208  \n209  \n210  \n211  \n212  \n213  \n214  \n215  \n216  \n217  \n218  \n219",
  "P-wave, or S-wave. In this study, we adopt the same GRU structure with 2 bi-directional layers, and 128 hidden size, but divide the raw data into frames of a much smaller step length (0.5 s) and stride (0.1 s) to increase the theoretical phase picking precision (Figure 2a). Moreover, we add a multi-head self-attention layer (Bahdanau et al., 2014; Vaswani et al., 2017) after the GRU layers (Figure 2a).  _en_zh_google": "P波或S波。在这项研究中，我们采用了具有2个双向层的相同GRU结构和128个隐藏尺寸，但将原始数据分为较小的步长(0.5 s)和步幅(0.1 s)的帧，以提高理论阶段的选择精度(图2A)。此外，我们在GRU层后添加了一个多头自发注意层(Bahdanau等，2014； Vaswani等，2017)(图2A)。",
  "Multi-head self-attention is a mechanism that enhances the performance by allowing the model to simultaneously focus on different parts of the input sequence from different representation subspaces, which makes a key component of the Transformer architecture (Vaswani et al., 2017). In a single self-attention head, the input sequence (i.e. the output of GRU layers in our case) is transformed into three vectors: queries (Q), keys (K), and values (V), which are then used to compute attention scores that determine how much focus each element of the input sequence should have on every other element. This process captures dependencies regardless of their distance in the sequence, making the model able to capture complex dependencies that span across long sequences. Multi-head self-attention improves upon this by dividing the Q-K-V vectors into multiple independent heads, performing the self-attention process parallelly. Thus, each attention head learns to focus on different features of the input sequence, allowing the model to capture a richer array of relationships within the data. The outputs of all attention heads are then concatenated and linearly transformed to produce the final output, which combines the diverse learned representations. Similar attention mechanisms have been proved effective in enhancing the seismic phase picking performance (e.g. Mousavi et al., 2020; Zhang et al., 2023a).  _en_zh_google": "多头自我注意力是一种通过允许模型同时关注来自不同表示子空间的输入序列的不同部分来增强性能的机制，这使得成为变压器架构的关键组成部分(Vaswani等，2017)。在单个自我注意力头部中，输入序列(即我们案例中GRU层的输出)转换为三个矢量：查询(q)，键(k)和值(v)，然后使用这些媒介来计算确定输入序列每个元素的焦点的注意力评分，这些元素都应在其他每个元素上都有。该过程捕获依赖项，无论其序列中的距离如何，使模型能够捕获长序列跨度的复杂依赖关系。多头自我发作可以通过将Q-K-V向量分为多个独立的头部，从而对此进行了改善，从而进行自我发挥的过程。因此，每个注意力头都学会着眼于输入序列的不同特征，从而使模型可以捕获数据中更丰富的关系。然后将所有注意力头的输出串联并线性转换以产生最终输出，从而结合了多样的学说表示。事实证明，类似的注意机制在增强地震阶段的采摘性能方面有效(例如Mousavi等，2020； Zhang等，2023a)。",
  "For the model target in the training stage, we label only the frames containing P & S arrivals as P and S, respectively, and all other frames as Noise (Figure 2a). This labeling strategy forms a small but finite weight for the P&S arrival times, which guides the model to focus on these features and makes more stable phase detection. Since the invention of such labeling strategy by Zhu and Beroza (2018) for PhaseNet, it has been widely adopted by most of the following deep learning models (e.g. Mousavi et al., 2020; Yu and Wang, 2022; Sun et al., 2023). In the model prediction stage, instead of treating the SAR output as classifications, we only use the output prediction probability, so that users can set the detection threshold based on their own problems. In line with PhaseNet, we also set the default triggering threshold for SAR as 0.3 to balance the detection completeness and accuracy. We regard a group of consecutive frames with a prediction probability above the threshold as a $\\mathrm{\\bfP}$ or S pick, and take the median time of these frames as the picked phase arrival. For the cases when multiple P and S picks exist in a sliding window, we group these picks into all possible P&S pairs, only requiring that the S wave always arrives later than the P wave in a pair. Also, since we apply SAR in a sliding window manner, and that the sliding windows have about half the length overlapping, we will merge the picks from different windows if they have similar P&S picks.  _en_zh_google": "对于训练阶段的模型目标，我们仅将包含P＆S到达的帧标记为P和S，将所有其他帧标记为噪声(图2A)。对于P＆S到达时间，这种标签策略构成了一个小但有限的重量，该重量指导模型专注于这些特征并进行更稳定的相位检测。自从Zhu和Beroza(2018)对Phasenet发明这种标签策略以来，它已被以下大多数深度学习模型广泛采用(例如Mousavi等人，2020年； Yu和Wang，2022； Sun等，2023)。在模型预测阶段，我们只使用输出预测概率，而不是将SAR输出视为分类，以便用户可以根据自己的问题设置检测阈值。与Phasenet一致，我们还将SAR为0.3的默认触发阈值设置，以平衡检测完整性和准确性。我们将一组连续帧视为$\\mathrm{\\bfP}$或s选择，并将预测概率高于阈值，并将这些帧的中间时间作为选择阶段到达。对于在滑动窗口中存在多个P和S选件的情况，我们将这些选择分组为所有可能的P＆S对，只要求S波总是比一对P的P浪得晚。另外，由于我们以滑动窗口的方式应用了SAR，并且滑动窗口的长度约为重叠的一半，因此，如果它们具有相似的P＆S选择，我们将从不同的窗口中合并。",
  "![](images/a5f58776a60d64833c60102da46f1a5fd5d8f05ba501d69d442c2a87790766bf.jpg)  _en_zh_google": "![](images/a5f58776a60d64833c60102da46f1a5fd5d8f05ba501d69d442c2a87790766bf.jpg)",
  "Figure 2. The SAR model structure and training sample slicing strategy. (a) SAR model structure. The filtered 3-channel seismogram is plotted in black curves, and the red vertical lines mark the P&S arrival times. The data processing units are denoted by: $\\mathbf{X}_{\\mathrm{i}}$ for the $\\mathrm{i}^{\\mathrm{th}}$ input time step; $\\mathrm{G_{f}}$ and $\\mathrm{G}_{\\mathrm{b}}$ for forward and backward Grated Recurrent Unit (GRU); $\\mathrm{y_{i}}$ for the $\\mathrm{i}^{\\mathrm{th}}$ output of the GRU RNN; Q/K/V for Query, Key, and  _en_zh_google": "图2。SAR模型结构和训练样品切片策略。 (a)SAR模型结构。过滤后的3通道地震图用黑色曲线绘制，红色垂直线标志着P＆S到达时间。数据处理单元表示：$\\mathbf{X}_{\\mathrm{i}}$对于_$\\mathrm{i}^{\\mathrm{th}}$输入时间步长； $\\mathrm{G_{f}}$和$\\mathrm{G}_{\\mathrm{b}}$向前和向后磨碎的复发单元(GRU); $\\mathrm{y_{i}}$ for $\\mathrm{i}^{\\mathrm{th}}$ gru rnn的输出; Q/k/v用于查询，密钥和",
  "230 Value input in the multi-head self-attention terminology, and they are all set as the RNN output (i.e. y) in   \n231 the case of self-attention; “Linear” for  fully-connected layer; “MatMul” for matrix multiplication; “Concat”   \n232 for concatenation; $\\mathbf{Z}_{\\mathrm{i}}$ for the $\\mathrm{i}^{\\mathrm{th}}$ output of the multi-head self-attention layer; “N/P/S prob” for Noise, P wave,   \n233 and S wave prediction probability (b) Training sample slice strategy. Blue, red and pink waveforms for   \n234 negative, positive, and augmented positive samples, respectively.  _en_zh_google": "230多头自我发项术语中的值输入，它们都设置为RNN输出(即y)   \n231自我注意事项；完全连接层的“线性”；用于矩阵乘法的“ matmul”； “ concat”   \n232串联； $\\mathbf{Z}_{\\mathrm{i}}$对于_$\\mathrm{i}^{\\mathrm{th}}$多头自我注意力层的输出；噪声，p波，“ n/p/s概率”，   \n233和S波预测概率(b)训练样品切片策略。蓝色，红色和粉红色波形   \n234分别为阴性，阳性和增强的阳性样品。",
  "The training samples fundamentally determine how the model behaves. To train the SAR model with the local earthquakes detected by PAL, we design a sampling strategy to properly balance the model’s ability of detecting weak signals and identifying different types of noises (Figure 2b). We slice both positive (i.e. earthquakes) and negative (i.e. noise) samples for training. The positive samples are sliced surrounding the PAL-picked P&S arrivals (Figure 2b). We randomly position the $\\mathrm{\\bfP}$ arrival at the first half of the time window, so that the model has a consistent detection ability for random signal positions that it will encounter in the real applications. Data augmentation was employed to increase the diversity of the training set and improve the generalizability of the SAR model. This involves adding real noise, randomly sliced from the same station-date for a specific P&S pick. For each augmented sample, the noise amplitude is scaled by a random ratio between 0 and 0.5, multiplied by the maximum P-wave amplitude. In this way, the number of positive samples is:  _en_zh_google": "训练样本从根本上确定模型的行为。为了用PAL检测到的当地地震来训练SAR模型，我们设计了一种抽样策略，以正确地平衡该模型检测弱信号和识别不同类型的噪声的能力(图2B)。我们切成阳性(即地震)和负(即噪声)样品进行训练。阳性样品围绕着挑剔的P＆S到达(图2B)切成薄片。我们将$\\mathrm{\\bfP}$到达时间窗口的上半部分，以便模型具有一致的检测能力，以实现其在实际应用程序中会遇到的随机信号位置。采用数据增强来增加训练集的多样性并提高SAR模型的普遍性。这涉及添加真实的噪声，这些噪声是从同一站日期随机切成薄片以进行特定的P＆S选择。对于每个增强样品，噪声振幅按0到0.5之间的随机比例缩放，乘以最大P波幅度。这样，积极样本的数量是：",
  "$$\nN_{p o s}^{i j}=N_{a s s o c}^{i j}\\cdot N_{a u g},\n$$  _en_zh_google": "$$\nN_{p o s}^{i j}=N_{a s s o c}^{i j}\\cdot N_{a u g},\n$$",
  "where $i$ & $j$ is the station and date index, respectively; $N_{p o s}$ is the number of positive samples; $N_{a s s o c}$ is the number of associated picks; $N_{a u g}$ is the number of augmentations set by the users. Note that the users need to set the number of augmentations, so that the number of positive samples is large enough (empirically, $>100,000)$ . The negative samples are sliced randomly in each station-date pair (Figure 2b), while excluding the time ranges that has PAL-picked P&S arrivals. The number of negative samples on a certain station-date is decided by the number of associated and unassociated PAL picks on that station-date:  _en_zh_google": "其中$i$＆$j$____________________是日期索引； $N_{p o s}$是阳性样本的数量； $N_{a s s o c}$是关联的选择的数量； $N_{a u g}$是用户设置的增强次数。请注意，用户需要设置增强次数，以使积极样本的数量足够大(从经验上，__$>100,000)$。每个站日期对中的负样本被随机切割(图2B)，而排除了在某个站点上的p＆s pal pal pal pal pal and nettate-nect and nettate-nect and and nettate-nect and and dy nect and and necy的时间范围，该位置的数量是数字。",
  "$$\nN_{n e g}^{i j}=N_{u n a s s o c}^{i j}\\cdot\\frac{N_{a u g}\\cdot N_{a s s o c}}{N_{u n a s s o c}}\\cdot\\frac{0.5-\\frac{N_{a s s o c}^{i j}}{N_{p i c k}^{i j}}}{0.5},\n$$  _en_zh_google": "$$\nN_{n e g}^{i j}=N_{u n a s s o c}^{i j}\\cdot\\frac{N_{a u g}\\cdot N_{a s s o c}}{N_{u n a s s o c}}\\cdot\\frac{0.5-\\frac{N_{a s s o c}^{i j}}{N_{p i c k}^{i j}}}{0.5},\n$$",
  "where $i$ & $j$ is the station and date index, respectively; $N_{n e g}$ is the number of negative samples; $N_{p i c k},N_{a s s o c}\\notin N_{u n a s s o c}$ are the number of all picks, number of associated and unassociated picks, respectively; $N_{a u g}$ is the number of augmentations set by the users. The logic for each term of this equation is that: (1) the number of unassociated PAL picks indicate the noise level, the more noise a station-date is, the more negative samples we need to slice on it; (2) the number of positive and negative samples need to be balanced in the training process; (3) the pick association ratio indicate the true positive rate of the PAL picks, and a large number of unassociated picks and a high association rate can occur together in an intense sequence (e.g. aftershock sequences), thus we should reduce the number of negative samples in this case. Note that if the association ratio is larger than 0.5, we do not slice any negative samples on that station-date. In this way, we can obtain a temporally stable number of negative samples (Figure S7). We will show in this study that the above sampling strategy realizes stable detection performance.  _en_zh_google": "其中$i$＆$j$____________________是日期索引； $N_{n e g}$是负样本的数量； $N_{p i c k},N_{a s s o c}\\notin N_{u n a s s o c}$分别是所有选秀，相关和无关的选秀人数的数量； $N_{a u g}$是用户设置的增强次数。该方程式每个项的逻辑是：(1)无相关的PAL选片的数量表示噪声水平，站点日期的噪声越多，我们需要在其上切片的噪声越多； (2)在训练过程中需要平衡正面样本和负样本的数量； (3)选择比率表示PAL选片的真正正速率，并且大量的非相关选片和高相关率可以以强烈的序列(例如余震序列)一起出现，因此在这种情况下，我们应该减少负样本的数量。请注意，如果关联比大于0.5，则我们不会在该站日期上切成任何负样本。这样，我们可以获得时间稳定的负样品(图S7)。我们将在这项研究中表明，上述抽样策略实现了稳定的检测性能。",
  "The training of SAR is performed in a mini-batch manner. We feed both positive and negative samples in each iteration, and train for about 15-20 epochs to make about 100,000 total training iterations. Note that with the third term of Equation 2, the total number of negative samples will be smaller than the positives, thus we feed 128 positives and a smaller number of negatives so that they experience the same number of epochs. We adopt the Adam optimizer (Kingma and Ba, 2014) with a learning rate of $10^{-4}$ . As will be shown in the real cases here (Figure S8) and in our previous experiments for RNN (Zhou et al., 2019), the SAR model behaves very stable in the training process, without showing any signs of overfitting.  _en_zh_google": "SAR的训练是以迷你批量进行的。我们在每次迭代中都喂食正面和负样本，并训练约15-20个时代，以进行约100,000个总训练迭代。请注意，对于等式2的第三项，负样本的总数将小于阳性，因此我们要喂养128个阳性和较少数量的负面因素，因此它们经历了相同数量的时代。我们采用Adam Optimizer(Kingma and Ba，2014)，学习率为$10^{-4}$。如这里的实际情况所示(图S8)以及我们先前对RNN的实验(Zhou等，2019)，SAR模型在训练过程中的行为非常稳定，没有显示出任何过度拟合的迹象。",
  "# 3. Comparison of Cataloging Workflows  _en_zh_google": "# 3。编目工作流的比较",
  "To test the detectability and generalizability of our LoSAR workflow, we apply it to two cases that differ in tectonic settings and spatiotemporal scales: (1) the Ridgecrest-Coso (California) region from 2008 to 2019/07, covering its long-term preseismic period and 20-days’ early aftershocks; and (2) the East Anatolian Fault Zone (EAFZ, Turkey) from 2020 to 2023/04, which covers ${\\sim}3$ years’ preseismic period and ${\\sim}3$ months’ aftershocks. Both cases contain large earthquakes that significantly change the seismicity rate and patterns, which makes the cataloging more difficult, and is thus suitable for technical discussions. In these cases, we compare LoSAR with other popular cataloging workflows in terms of earthquake detection completeness, stability, and phase association rate.  _en_zh_google": "为了测试Losar工作流的可检测性和概括性，我们将其应用于两种构造环境和时空尺度不同的情况：(1)Ridgecrest-Coso(加利福尼亚州)区域从2008年到2019/07，涵盖了其长期的preseistip and 20天早期的余额； (2)2020年至2023/04年的东安纳托利亚断层区(EAFZ，土耳其)，该区域涵盖__$\\sim 3$年度的preseismisic时期和_$\\sim 3$1_月的余额。两种情况都包含大量地震，可显着改变地震速率和模式，这使得分类更加困难，因此适合技术讨论。在这些情况下，我们将Losar与其他流行的目录工作流相比，就地震检测完整性，稳定性和相关率而言。",
  "![](images/883db478c77bace9bef3351d5abedfa662890373d21fba33bed2c58e21a98779.jpg)  \n(b)LoSARAftershocks(2019/07/04-24)  _en_zh_google": "![](images/883db478c77bace9bef3351d5abedfa662890373d21fba33bed2c58e21a98779.jpg)  \n(b)Losaraftershocks(2019/07/04-24)",
  "Figure 3. Study region and catalog comparison for Case 1: Ridgecrest-Coso (2008-2019/07). (a-b) plot the LoSAR catalog generated in this study, with preseismic period (2008-2019/06) and aftershock period (2019/07/04-24) shown separately. Seismicity is plotted as dots that have its depth denoted by color and size varies by magnitude. $\\mathbf{M}{>}5$ earthquakes after 1946 are marked by yellow stars. Seismic stations used are denoted by white hollow triangles; active faults are plotted as black lines; surface rupture caused by the 2019 Ridgecrest earthquakes are marked by white lines. The area of Coso Geothermal Field (CGF) is marked by a red circle. The insets show location of the study area in a larger scale, with the San Andreas Fault (SAF) and Eastern California Shear Zone (ECSZ) marked. (c-d) are the same as (a-b), but for the relocated SCSN catalog (Hauksson et al., 2012). The blue box in (b) & (d) marks the location coverage in Figure 4a-b & 7.  _en_zh_google": "图3。案例1的研究区域和目录比较：Ridgecrest-Coso(2008-2019/07)。 (A-B)绘制了本研究中生成的Losar目录，并分别显示了Preseiscic时期(2008-2019/06)和余震期(2019/07/04-24)。地震性被绘制为具有颜色和尺寸表示深度的点，大小变化。 1946年以后的$\\mathbf{M}{>}5$地震以黄星为标志。使用的地震站用白色空心三角形表示；主动故障绘制为黑线；由2019年Ridgecrest地震引起的表面破裂以白色线为特征。 COSO地热场(CGF)的面积标有红色圆圈。插图显示了大规模研究区域的位置，标有圣安德烈亚斯断层(SAF)和东加州剪切区(ECSZ)。 (C-D)与(A-B)相同，但对于重新定位的SCSN目录(Hauksson等，2012)。 (b)和(d)中的蓝色框标记了图4A-B＆7中的位置覆盖范围。",
  "# 3.1.1 Background and Motivation  _en_zh_google": "# 3.1.1背景和动力",
  "The 2019 Ridgecrest, California sequence comprised a $\\mathbf{M}_{\\mathrm{w}}6.4$ foreshock on 2019/07/04, followed by a $\\mathbf{M}_{\\mathrm{w}}7.1$ mainshock on 2019/07/06, and was featured by intense aftershock activities that reveal widespread orthogonal structures (Ross et al., 2019a; Shelly, 2020). It is associated with a young fault system (Goldberg et al., 2020; Hauksson and Jones, 2020; Xu et al., 2020) and the majority of the ruptured faults are not mapped before the earthquake (Thompson Jobe et al., 2020). Tectonically, the Ridgecrest sequence is situated within the East California Shear Zone (ECSZ), an approximately $100{\\mathrm{-km}}$ -wide band dominated by right-lateral strike-slip faults that accommodates the relative motion between the Pacific and North American plates (Oskin et al., 2008; Spinler et al., 2010; Tymofyeyeva and Fialko, 2015). In this study, we focus on an area not only covering the Ridgecrest ruptures, but also two close-by tectonic units (Figure 3): (1) the central Garlock fault (McGill and Sieh, 1993; Ganev et al., 2012; Hatem and Dolan, 2018), a major fault cutting off the Ridgecrest faults on its south; and (2) the Coso Geothermal Field (CGF), one of the largest three geothermal fields in California that has been inducing intense seismicity for decades (Schoenball et al., 2015; Trugman et al., 2016; Im et al., 2021).  _en_zh_google": "2019年RIDGECREST，加利福尼亚州的序列包括2019/07/04的$\\mathbf{M}_{\\mathrm{w}}6.4$预防库，随后在2019/07/06举行了___$\\mathbf{M}_{\\mathrm{w}}7.1$ MAIMSHOCK，并以激烈的余震活动展示了广泛的正交结构(Ross et e shelly et e shelly e e shelly e e shelly et e shelly e e shelly e shelly;它与年轻的断层系统有关(Goldberg等，2020； Hauksson和Jones，2020; Xu等，2020)，大多数破裂的断层在地震之前没有被映射(Thompson Jobe等，2020)。 Tectonically, the Ridgecrest sequence is situated within the East California Shear Zone (ECSZ), an approximately $100{\\mathrm{-km}}$ -wide band dominated by right-lateral strike-slip faults that accommodates the relative motion between the Pacific and North American plates (Oskin et al., 2008; Spinler et al., 2010; Tymofyeyeva and Fialko, 2015).在这项研究中，我们专注于一个区域，不仅涵盖了Ridgecrest破裂，而且还关注两个近距离的构造单位(图3)：(1)中央Garlock断层(McGill and Sieh，1993; Ganev et al。，2012; Hatem and Dolan，2018年)，这是一个削减了Ridgecrest on is south south south south的主要故障； (2)COSO地热场(CGF)是加利福尼亚州最大的三个地热场之一，几十年来一直在诱导强烈的地震性(Schoenball等，2015; Trugman等，2016; Im等，2021)。",
  "We work on a time period from 2008 to 2019, because of the significant improvement in the seismic network starting from 2008 (Hutton et al., 2010), and to overlap with the decade-long QTM matched filtering catalog that covers 2008-2017 (Ross et al., 2019b). This time frame offers an exceptional opportunity to directly compare our novel workflow with MFT. For the aftershock period, we also align our investigations with the MFT catalog by Ross et al. (2019a), which spans the first 20 days since the $\\mathbf{M}_{\\mathrm{w}}6.4$ foreshock. Both time periods of the QTM catalog utilize the  _en_zh_google": "我们在2008年至2019年的时间段工作，因为从2008年开始的地震网络的显着改善(Hutton等，2010)，并与涵盖2008-2017的十年QTM匹配的过滤目录重叠(Ross等，2019b)。这个时间范围提供了一个非凡的机会，可以将我们的新型工作流程与MFT进行比较。在余震时期，我们还将研究与Ross等人的MFT目录进行对齐。 (2019a)，它跨越了$\\mathbf{M}_{\\mathrm{w}}6.4$预换的前20天。 QTM目录的两个时间段都利用",
  "319   \n320   \n321   \n322   \n323   \n324   \n325   \n326   \n327   \n328   \n329   \n330   \n331   \n332   \n333   \n334   \n335   \n336   \n337   \n338   \n339   \n340   \n341   \n342   \n343   \n344   \n345   \n346   \n347   \n348   \n349  _en_zh_google": "319   \n320   \n321   \n322   \n323   \n324   \n325   \n326   \n327   \n328   \n329   \n330   \n331   \n332   \n333   \n334   \n335   \n336   \n337   \n338   \n339   \n340   \n341   \n342   \n343   \n344   \n345   \n346   \n347   \n348   \n349",
  "routine SCSN catalog as templates, adopting a detection threshold of 12 times the median absolute deviation of CC, and are relocated with Growclust (Trugman and Shearer, 2017) that inverse the CC-based differential times. Also involved in the comparison is the relocated SCSN catalog (Hauksson et al., 2012), which has a similar number of detections as the routine SCSN catalog, but has a much higher relocation precision that comes from the CC-based relocation. To make a fair comparison, we utilize the same set of stations maintained by SCSN, which is composed of broad-band and short-period stations of 3- and 1-component recordings, along with several nearsource temporary stations deployed after the 2019 mainshock (Figure 3 & S1a-b).  _en_zh_google": "常规的SCSN目录为模板，采用了CC中值绝对偏差的检测阈值的12倍，并以growclust(Trugman and Shearer，2017年)重新定位，这是基于CC的差异时间的逆转。比较还涉及重新定位的SCSN目录(Hauksson等，2012)，该目录具有与常规SCSN目录相似的检测数量，但基于CC的搬迁具有更高的重置精度。为了进行公平的比较，我们利用了由SCSN维护的相同的站点，该站点由3和1组分记录的宽带和短期站组成，以及2019年主弹药后部署的几个近乎源临时站(图3＆S1A-B)。",
  "# 3.1.2 Detection and Location  _en_zh_google": "# 3.1.2检测和位置",
  "For this case, we run the LoSAR workflow for the ${\\sim}11$ -year preseismic period and the 20- day aftershock period separately, due to the considerable differences in station distribution (Figure 3 & S1) and seismicity rate. This approach also allows for an assessment of the workflow’s performance under two end-member situations: a scenario of very intense sequence observed by a rather dense seismic network, and a pure interseismic period (no large earthquakes) with regular observational condition. We set the LoSAR parameters specifically for the preseismic period, since it is less investigated; and we keep the same set of parameters for the aftershock period to make the results more comparable. In running PAL, we set the STA/LTA triggering threshold as 12 (defined by energy), S wave searching window as $12~\\mathrm{s}$ after the P pick, in line with the scale of study region and the average inter-station distance. For PAL association, we require at least 4 stations to have an original time deviation $<1.2\\mathrm{s}$ , and a maximum P-wave travel time residual $<0.8$ s. The PAL obtains 61,053 / 451,694 and 49,737 / 440,942 event detections / associated picks for the preseismic and aftershock period, respectively. In running SAR, we set the window length as 20 s and the sliding stride as $10~\\mathrm{s}$ in the predictions for continuous data. We augment the original training samples by 2 times, making a total of 812,771 / 451,689 positive / negative samples for training in the preseismic period, and 792,784 / 123,018 positive / negative training samples for the aftershock period. Note that there are ${\\sim}10\\%$ remaining samples serve as the validation set. The waveforms in a time window are band-pass filtered to $1{-}20\\mathrm{Hz}$ and normalized in both the training and application stage. We made 15 epochs of training until the accuracy is stable (Figure S8). As described in the last section, we apply the local-trained SAR picker and the same PAL associator to enhance the PAL detections. This gives $165,393/1,277,974$ and 122,933 / 1,078,038 event detections / associated picks for the preseismic and aftershock period, respectively. In summary,  _en_zh_google": "在这种情况下，由于站点分布的相当大差异(图3＆S1)和地震率，我们分别运行$\\sim 11$ -year preseismic时期和20天的后震动期的LOSAR工作流程。这种方法还允许在两个结束的情况下评估工作流程的性能：一个相当密集的地震网络观察到的非常激烈的序列的情况，以及一个纯粹的跨界时期(无大地震)，具有常规的观察状况。我们将Losar参数设置为专门针对狂热时期的参数，因为它的研究较少。并且我们在余震期间保留相同的参数集，以使结果更具可比性。在运行PAL时，我们将STA/LTA触发阈值设置为12(由能量定义)，S波搜索窗口为__ All_math_1__ p pick之后，与研究区域的规模和平均站间距离一致。对于PAL协会，我们需要至少4个站具有原始时间偏差$<1.2\\mathrm{s}$，以及最大的P-Wave旅行时间剩余时间$<0.8$ s。 PAR分别获得了61,053 / 451,694和49,737 / 440,942的事件检测 /相关的选拔，分别为狂热和余震期。在运行SAR时，我们将窗口长度设置为20 s，并将滑动步幅设置为$10~\\mathrm{s}$在连续数据的预测中。我们将原始培训样本增加了2次，在促震动期间，总计812,771 / 451,689正 /负样本，以及792,784 / 123,018的余震训练样本，为792,784 / 123,018。请注意，$\\sim 10\\%$剩下的样本用作验证集。时间窗口中的波形被带过滤到$1{-}20\\mathrm{Hz}$，并在训练和应用阶段均进行了归一化。我们进行了15个训练时期，直到准确性稳定为止(图S8)。如上一节所述，我们将经过局部培训的SAR选择器和相同的PAL协会来增强PAL检测。这给出了$165,393/1,277,974$和122,933 / 1,078,038的事件检测 /相关选秀，分别为preseismic和余震期。总之，",
  "350 for Ridgecrest-Coso, the LoSAR workflow achieves a \\~2.5-2.7-fold increase in detection number   \n351 compared to PAL.   \n352   \n354   \n355   \n356   \n357   \n358   \n359   \n360   \n361   \n362   \n363   \n364   \n365   \n366   \n367   \n368   \n369   \n370   \n371   \n372   \n373   \n374   \n375   \n376   \n377   \n378   \n379   \n380  _en_zh_google": "350对于Ridgecrest-Coso，Losar Workfflow的检测数量增加了2.5-2.7倍   \n351与PAL相比。   \n352   \n354   \n355   \n356   \n357   \n358   \n359   \n360   \n361   \n362   \n363   \n364   \n365   \n366   \n367   \n368   \n369   \n370   \n371   \n372   \n373   \n374   \n375   \n376   \n377   \n378   \n379   \n380",
  "To locate and relocate the LoSAR detections, considering a rather dense network, we adopt 353 the first approach described in Section 2.1 (Figure 1), utilizing dt.ct and dt.cc separately for a twostep relocation. Similar as the detection part, we adopt the same set of location parameters for both the preseismic and aftershock period. For the hypoINV absolute location, the distance weighting is configured as follows: $0{\\cdot}50~\\mathrm{km}$ assign full weight, $>100~\\mathrm{km}$ zero weight, and $50{-}100~\\mathrm{km}$ is assigned a cosine tapered in between. A similar weighting scheme is employed for the time residual between 0.25 and 0.75 s. For S waves, the weights are further adjusted by a factor of 0.6, considering a larger picking error relative to P waves. The above weighting strategy results in $95.4\\%$ events well located, and an average lateral and vertical uncertainty of $1.11~\\mathrm{km}$ and $2.22~\\mathrm{km}$ , respectively. In the hypoDD relocation process with dt.ct, we pair events within $8\\mathrm{km}$ (i.e. WDCT, in hypoDD terminology), P & S waves weighted respectively as 1 and 0.6, and inverse for 4 iterations. This results in a relative location error of about $120\\mathrm{m}$ for epicenter and $150\\mathrm{m}$ for depth, under the least square criteria by hypoDD. Given that the least-square location error reported by hypoDD tends to significantly underestimate the real uncertainty, we test the dt.ct relocation results under different velocity models, and found highly consistent distributions (Figure S16 & S32). In the final CC relocation stage, we measure the waveform-based differential time on $1{-}20\\mathrm{Hz}$ bandpass filtered waveforms, with the $\\mathrm{\\bfP}$ and S window length set as 2.5 s and $4\\mathrm{~s~}$ , starting from 0.5 s and 0.2 s before the phase arrival, respectively. We do not calculate dt between $\\mathbf{M}_{\\mathrm{L}}{<}0$ earthquakes to lower down the computational costs. A maximum number of 200 neighboring events are preset in the candidate neighbor selection step, sorted by the separation distance. After the CC calculation, we discard the measurements with $\\mathrm{CC}{<}0.35$ , or $d t_{-}p{>}0.5\\mathrm{~s~}$ , or $d t_{-}s{>}0.8~\\mathrm{s}$ , and the event pairs with ${<}4$ stations fulfilling these criteria are further dropped. The above selections finally maintain 18,421,488 P and 12,506,600 S differential time measurements for the preseismic period. For the aftershocks, these numbers are 13,718,530 for $\\mathrm{\\bfP}$ and 8,422,550 for S. In the hypoDD relocation process, we link events within $4\\mathrm{km}$ (i.e. WDCC, in hypoDD terminology), set both P and S waves’ weights as 1 and inverse for 4 iterations, because S waves have higher stability in waveform crosscorrelation. Finally, we obtained 101,193 and 61,578 well-relocated events for the preseismic and aftershock period, respectively. For both catalogs, the average relocation error reported by hypoDD is about $40~\\mathrm{m}$ and $60~\\mathrm{m}$ along horizontal and vertical directions, respectively. Note that  _en_zh_google": "为了定位和重新分配Losar检测，考虑到一个相当密集的网络，我们采用了353第2.1节中描述的第一种方法(图1)，分别利用DT.CT和DT.CC进行了两次托管迁移。与检测部件相似，我们在主震动和余震期采用相同的位置参数。对于HypoInv绝对位置，距离加权的配置如下：$0{\\cdot}50~\\mathrm{km}$分配全权重，_$>100~\\mathrm{km}$零重量和$50{-}100~\\mathrm{km}$分配了介于中间的余弦。在0.25至0.75 s之间的残留时间采用了类似的加权方案。对于S波，考虑到相对于P波的较大的拾取误差，重量将进一步调整0.6倍。上述加权策略导致$95.4\\%$良好的事件以及$1.11~\\mathrm{km}$和$2.22~\\mathrm{km}$的平均横向和垂直不确定性。在使用DT.CT的降低重定位过程中，我们将事件配对$8\\mathrm{km}$(即WDCT，在hypoDD术语中)，P＆S波分别为1和0.6加权，以及4个迭代的倒数。对于epicenter而言，这会导致相对位置误差约为$120\\mathrm{m}$，而$150\\mathrm{m}$对于深度，在hypodd的最小平方标准下。鉴于HypODD报告的最小二乘位置误差往往会显着低估实际不确定性，因此我们在不同速度模型下测试了DT.CT迁移结果，并发现了高度一致的分布(图S16＆S32)。在最终的CC重定位阶段，我们在$1{-}20\\mathrm{Hz}$带$\\mathrm{\\bfP}$和S窗口长度设置为2.5 s和_$4\\mathrm{~s~}$，从0.5 s和0.2 s开始，在$1{-}20\\mathrm{Hz}$ $1{-}20\\mathrm{Hz}$带有波形的差分时间之前，在相位到达前的0.5 s开始。我们不计算_$\\mathbf{M}_{\\mathrm{L}}{<}0$地震之间的DT来降低计算成本。在候选邻居选择步骤中，预设了200个相邻事件的最多数量，并以分离距离进行排序。在计算CC之后，我们将测量值丢弃使用$\\mathrm{CC}{<}0.35$或$d t_{-}p{>}0.5\\mathrm{~s~}$或$d t_{-}s{>}0.8~\\mathrm{s}$，而事件对${<}4$电台对满足这些条件的情况将进一步下降。以上选择最终维持18,421,488 p和12,506,600的差分时间测量。 For the aftershocks, these numbers are 13,718,530 for $\\mathrm{\\bfP}$ and 8,422,550 for S. In the hypoDD relocation process, we link events within $4\\mathrm{km}$ (i.e. WDCC, in hypoDD terminology), set both P and S waves’ weights as 1 and inverse for 4 iterations, because S waves have higher stability in waveform crosscorrelation.最后，我们分别为preseismic和倒影时期获得了101,193和61,578个良好的事件。对于两个目录，HypODD报告的平均重定位错误分别沿水平和垂直方向分别$40~\\mathrm{m}$和$60~\\mathrm{m}$。注意",
  "381   \n382   \n383   \n384   \n385   \n386   \n387   \n388   \n389   \n390   \n391   \n392   \n393   \n394   \n395   \n396   \n397   \n398   \n399   \n400   \n401   \n402   \n403   \n404   \n405   \n406   \n407   \n408   \n409   \n410   \n411  _en_zh_google": "381   \n382   \n383   \n384   \n385   \n386   \n387   \n388   \n389   \n390   \n391   \n392   \n393   \n394   \n395   \n396   \n397   \n398   \n399   \n400   \n401   \n402   \n403   \n404   \n405   \n406   \n407   \n408   \n409   \n410   \n411",
  "this location error is in the relative and average sense, and reflects more about the goodness of data fitting, instead of the real uncertainty.  _en_zh_google": "此位置误差是相对和平均意义的，并且更多地反映了数据拟合的优点，而不是真正的不确定性。",
  "# 3.1.3 Catalog Comparisons  _en_zh_google": "# 3.1.3目录比较",
  "The cataloging methodology and parameters outlined in the preceding subsection yield the seismicity distribution shown in Figure 3. The LoSAR catalog and the relocated SCSN catalog exhibit an overall consistent distribution, particularly in areas of major intense clusters. Nonetheless, the LoSAR catalog demonstrates a significantly enhanced detection capability, rendering previously indistinct seismicity structures much more discernible (Figure 3). To make a more comprehensive and quantitative comparison, we plot the frequency-magnitude distribution (FMD) and magnitude-time sequences of the relocated SCSN, the QTM catalog, and the LoSAR catalog for both the aftershock and preseismic period (Figure 4).  _en_zh_google": "前面小节中概述的分类方法和参数产生了图3所示的地震性分布。LOSAR目录和重新定位的SCSN目录表现出总体一致的分布，尤其是在大型强烈集群区域。尽管如此，Losar目录表现出显着增强的检测能力，使以前模糊的地震性结构更加明显(图3)。为了进行更全面和定量的比较，我们绘制了重新定位的SCSN，QTM目录和Losar目录的频率 - 速度分布(FMD)和幅度时间序列(图4)。",
  "FMDs serve to illustrate not only the total number of detections, but also the distribution of events across different magnitude bins. Ideally, a FMD should adhere to the GR law (Gutenberg and Richter, 1944), meaning that for the magnitude range above a completeness threshold (approximately the magnitude of maximum non-cumulative distribution, Wiemer and Wyss, 2000), the occurrence frequency of earthquakes is expected to follow a power-law distribution relative to their magnitudes (i.e. a linear relationship when plotted on a logarithmic scale). Furthermore, the objective of earthquake detection is also to achieve the smallest possible magnitude of completeness, or equivalently, the largest possible cumulative count. Applying the above criteria to analyze the FMDs, it becomes evident that LoSAR has a comparable or superior detectability compared with QTM, especially for the preseismic period (Figure 4a-c). While QTM shows a higher detection ability for the intense aftershock sequence (Figure 4a), it is noteworthy that ratio of well-located events determined by the Growclust algorithm falls below $35\\%$ (Figure 4b). This result also suggests that a trade-off between the quantity of detections and the quality of their locations, emphasizing the necessity of keeping comparable relocation precision for an equitable comparison of detectability across methodologies. In addition to overall event counts, the slope of these FMDs also offer critical insights. First, an apparent inconsistency in detection completeness exists in both the SCSN and QTM catalogs between the $\\mathbf{M}\\left(\\right)-2$ and $\\mathbf M>2$ events, as evidenced by the varying slopes in the FMDs (Figure 4a-c). Second, also for the SCSN & QTM catalog, there is a noticeable shift in the FMDs’ slope around $\\mathrm{~M~}3.5$ (Figure 4a-c). This shift is partially caused by the adoption of different magnitude scales (e.g. Ml, $\\mathbf{M}_{\\mathrm{w}}$ , or $\\mathbf{M}_{\\mathrm{lr}}$ , as detailed at  _en_zh_google": "FMD不仅说明了检测总数，还可以说明事件在不同级别箱之间的分布。理想情况下，FMD应遵守GR Law(Gutenberg and Richter，1944)，这意味着，对于高于完整性阈值的幅度范围(大约是最大非肿瘤分布的最大幅度，Wiemer and Wyss，Wyss，2000)，地震的发生频率预计会遵循相对于他们的Magnitude(loe)的相对范围(即在loe的范围内)。此外，地震检测的目的也是达到最小的完整性幅度，或者等效地是最大的累积计数。使用上述标准来分析FMD，很明显，Losar与QTM相比具有可比较或卓越的可检测性，尤其是在主震动时期(图4A-C)。尽管QTM显示出强烈余震序列的较高检测能力(图4A)，但值得注意的是，由growclust算法确定的良好定位事件的比率降至$35\\%$以下(图4B)。该结果还表明，检测量与其位置质量之间的权衡，强调了保持可比较的搬迁精度，以公平地比较跨方法论的可检测性。除了整体事件数量外，这些FMD的斜率还提供了关键的见解。首先，在_$\\mathbf{M}\\left(\\right)-2$和$\\mathbf M>2$事件之间的SCSN和QTM目录中都存在明显的检测完整性，这是FMDS中不同斜率所证明的(图4A-C)。其次，对于SCSN和QTM目录，FMD的斜率围绕$\\mathrm{~M~}3.5$______________________________________________________________________________________(图4A-C)。这种转变部分是由采用不同幅度量表(例如ml，__$\\mathbf{M}_{\\mathrm{w}}$或$\\mathbf{M}_{\\mathrm{lr}}$)引起的",
  "412   \n413   \n414   \n415   \n416   \n417   \n418   \n419   \n420   \n421   \n422   \n423   \n424   \n425   \n426   \n427   \n428   \n429   \n430   \n431   \n432   \n433   \n434   \n435   \n436   \n437   \n438   \n439   \n440   \n441   \n442  _en_zh_google": "412   \n413   \n414   \n415   \n416   \n417   \n418   \n419   \n420   \n421   \n422   \n423   \n424   \n425   \n426   \n427   \n428   \n429   \n430   \n431   \n432   \n433   \n434   \n435   \n436   \n437   \n438   \n439   \n440   \n441   \n442",
  "https://scedc.caltech.edu/eq-catalogs/change-history.html), which can affect the catalog-based bvalue studies. The LoSAR catalog does not exhibit the aforementioned issues, demonstrating a consistent detection performance across the magnitude range in this study.  _en_zh_google": "https://scedc.caltech.edu/eq-catalogs/change-history.html)，这可能会影响基于目录的BVALUE研究。 Losar目录没有表现出上述问题，在本研究中表明了整个幅度范围内的检测性能一致。",
  "The magnitude-time sequence reveals the temporal evolution of seismicity, which is modulated by external sources, such as tectonic loading, as well as internal triggering between earthquakes (Ogata, 1988; Zhuang et al., 2002; Zaliapin and Ben-Zion, 2020; Hsu et al., 2024). Thus, statistical studies will require a catalog to have temporally stable detection capability for both the intense sequences and the background seismicity. In our case in the Ridgecrest-Coso preseismic period, we observe that the SCSN catalog is not temporally consistent, displaying high detectability mainly during the intense seismic sequences (Figure 4d). This pattern arises from the SCSN catalog’s compilation process, which involves a semi-automated detection supplemented by manual inspections, particularly for intense seismic sequences (as detailed at https://scedc.caltech.edu/eq-catalogs/change-history.html). The issue of temporal inconsistency is not alleviated, but being exacerbated in the QTM catalog, as indicated by the highly variable lower magnitude limit (Figure 4e). It is probably due to the fact that earthquakes within an intense sequence tend to have high waveform similarity, making them easy to be detected by matched filtering; Conversely, the background seismicity comes from a wider variety of faults and asperities, which inherently diminishing the effectiveness of matched filter. In contrast, our LoSAR catalog realizes markedly improved stability in detection throughout this 11-year period (Figure 4f), without showing any notable gaps in the detection of lower magnitude events. This robustness suggests that the SAR model is adept at capturing the statistical features of seismic events over a large spatiotemporal range, thus making it a more generalized algorithm for longterm earthquake detection.  _en_zh_google": "幅度时间序列揭示了地震性的时间演变，这是由外部来源(例如构造负荷以及地震之间的内部触发)调节的(Ogata，1988; Zhuang et al。，2002; Zaliaiapin and Ben-Zion and Ben-Zion，2020; Hsu等，2024; HSU等。因此，统计研究将要求目录具有时间稳定的强度序列和背景地震性的能力。在我们的情况下，在Ridgecrest-Coso preseismic时期，我们观察到SCSN目录在时间上并不一致，主要在强烈的地震序列中显示高可检测性(图4D)。这种模式来自SCSN目录的汇编过程，该过程涉及手动检查补充的半自动检测，特别是对于强烈的地震序列(如https://scedc.caltech.edu/eq-catalogs/eq-catalogs/change-history.html)。时间不一致的问题不能缓解，而是在QTM目录中加剧的，如高度较低的较低幅度限制所示(图4E)。这可能是由于以下事实：强烈序列内的地震往往具有高波形相似性，因此可以轻松地通过匹配的过滤检测到它们。相反，背景地震活动来自更广泛的故障和浅层，这固有地降低了匹配过滤器的有效性。相比之下，我们的Losar目录在整个11年期间都显着提高了检测的稳定性(图4F)，没有显示出较低幅度事件的任何明显差距。这种鲁棒性表明，SAR模型擅长捕获大型时空范围内地震事件的统计特征，从而使其成为长期地震检测的更普遍的算法。",
  "In our final comparison, we assess the computational efficiency of the LoSAR workflow against QTM. The entire LoSAR process (including running PAL) is executed within $^{\\sim7}$ days with 1 Nvidia GeForce RTX 2080 GPU card and 1 Intel Xeon E5-2695 CPU. Contrarily, the construction of the QTM catalog requires 200 Nvidia P100 GPU cards, with a runtime exceeding 60 days. Although the study area of QTM is $\\mathord{\\sim}20$ times larger, there is still a 100-fold difference in computational efficiency. This significant difference is attribute to the computationally intensive nature of cross-correlation and that the linear increase in runtime with the addition of templates in matched filtering.  _en_zh_google": "在最后的比较中，我们评估了Losar工作流与QTM的计算效率。整个LOSAR过程(包括运行PAL)在$^{\\sim7}$天内执行，使用1个NVIDIA GEFORCE RTX 2080 GPU卡和1张Intel Xeon E5-2695 CPU。相反，QTM目录的构建需要200个NVIDIA P100 GPU卡，运行时超过60天。尽管QTM的研究区域是_$\\mathord{\\sim}20$倍，但计算效率仍然存在100倍。这种显着差异归因于互相关的计算密集型性质，并且在匹配的滤波中添加模板的运行时线性增加。",
  "![](images/528fbc181d53583944c4c0013698b4a73a7009def95c82c986e2c5bb331f48ab.jpg)  _en_zh_google": "![](images/528fbc181d53583944c4c0013698b4a73a7009def95c82c986e2c5bb331f48ab.jpg)",
  "The blue, green, and red color denote the SCSN catalog (Hutton et al., 2010; Hauksson et al., 2012), the QTM catalog (Ross et al., 2019a; Ross et al., 2019b), and the LoSAR catalog in this study, respectively. (ac) plot the FMD comparison for the total aftershock detections, well located aftershocks, and the preseismic period (2008-2017), respectively. The dots and triangles denote cumulative and non-cumulative distribution in FMD. (d-f) plot the magnitude-time comparisons for the preseismic period (2008-2017). The thick black lines denote the magnitude of completeness in the current panel, and the colored dash lines plot that for two other catalogs. Note that only the events within the location coverage of Figure 3 are included in the statistics.  _en_zh_google": "蓝色，绿色和红色表示SCSN目录(Hutton等，2010； Hauksson等，2012)，QTM目录(Ross等，2019a; Ross等，2019b)和Losar Catalog，分别是这项研究中的Losar目录。 (AC)分别绘制总余震检测的FMD比较，分别位于余震和preseismic时期(2008-2017)。点和三角形表示FMD中的累积和非肿瘤分布。 (d-f)绘制preseismic时期(2008-2017)的幅度时间比较。厚的黑线表示当前面板中完整性的大小，而彩色的仪表板线则绘制了另外两个目录的绘图。请注意，统计信息中只有图3的位置覆盖范围内的事件。",
  "In conclusion, the LoSAR workflow not only exhibits superior detection capabilities and stability compared to the matched filter approach, but also significantly outperforms in computational efficiency. This makes it particularly advantageous for applications across extensive spatiotemporal scales.  _en_zh_google": "总之，与匹配的滤波器方法相比，Losar工作流不仅具有出色的检测能力和稳定性，而且在计算效率方面的表现也明显胜过。这使得它对于跨时空尺度的应用尤其有利。",
  "# 3.2 Case 2: East Anatolian Fault Zone (2020-2023/04)  _en_zh_google": "# 3.2案例2：东阿纳托利亚断层区(2020-2023/04)",
  "# 3.2.1 Background and Motivation  _en_zh_google": "# 3.2.1背景和动力",
  "On February 6, 2023, Southeast Turkey's Kahramanmaraş region was struck by an $\\mathbf{M}_{\\mathrm{w}}\\mathbf{\\nabla}7.8$ earthquake followed by another $\\mathbf{M}_{\\mathrm{w}}\\:7.6$ within ${\\sim}9$ hours, marking one of the largest continental earthquake doublets ever documented (Dal Zilio and Ampuero, 2023; Hussain et al., 2023; Jia et al., 2023; Xu et al., 2023; Zhang et al., 2023b; Ren et al., 2024). The 2023 Turkey earthquake doublet occurs on the East Anatolian Fault Zone (EAFZ), a roughly \\~600-km-long fault zone defining the plate boundary between the Anatolian and Arabian plates (Figure 5). Driven by the collision between the Arabian and Eurasian plates, the Anatolian plate is extruded westward at a rate of approximately $20{-}25\\mathrm{mm/yr}$ , along with a counterclockwise rotation (McClusky et al., 2000; Bulut et al., 2012; Barbot and Weiss, 2021; Güvercin et al., 2022). This plate motion give rise to the predominantly left-lateral strike-slip characteristics observed along the EAFZ. Additionally, the fault slip rate along the EAFZ is relatively low, ranging from ${\\sim}4\\mathrm{mm/yr}$ on the SW segments to ${\\sim}10\\mathrm{mm/yr}$ on the central and NE segments (Cavalié and Jónsson, 2014; Walters et al., 2014; Aktug et al., 2016; Weiss et al., 2020). It is noteworthy that the two mainshocks of the 2023 doublet are associated with different fault systems (Figure 5): the first $\\mathbf{M}_{\\mathrm{w}}\\mathbf{\\nabla}7.8$ mainshock (denoted as $M I$ ) occurs on the major plate boundary faults, whereas the second $\\mathbf{M}_{\\mathrm{w}}7.6$ mainshock  _en_zh_google": "On February 6, 2023, Southeast Turkey's Kahramanmaraş region was struck by an $\\mathbf{M}_{\\mathrm{w}}\\mathbf{\\nabla}7.8$ earthquake followed by another $\\mathbf{M}_{\\mathrm{w}}\\:7.6$ within $\\sim 9$ hours, marking one of the largest continental earthquake doublets ever documented (Dal Zilio and Ampuero, 2023; Hussain et al., 2023; Jia et al., 2023; Xu等，2023; 2023年的火鸡地震双重表发生在东阿纳托利亚断层区(EAFZ)，这是一个大约\\ 〜600公里长的断层区，定义了安纳托利亚和阿拉伯板之间的板块边界(图5)。在阿拉伯人和欧亚板之间的碰撞驱动下，安纳托利亚板以大约$20{-}25\\mathrm{mm/yr}$向西挤压，以及逆时针旋转(McClusky等，2000; Bulut等，2000; Bulut等，2012; Barbot and 2012; Barbot and Weiss and Weiss and Weiss and 2021; Gutercin; guvercin et al et，20222222222;这种板运动产生主要是沿EAFZ观察到的主要左侧滑滑特征。此外，沿EAFZ的断层滑移速率相对较低，从$\\sim 4\\mathrm{mm/yr}$在SW细分市场上到中央和NE段的$\\sim 10\\mathrm{mm/yr}$(Cavalié和Jónsson，2014; Walters等，2014; Walters等，2014; Aktug et al。值得注意的是，2023 Doublet的两个主震与不同的故障系统相关联(图5)：第一个__$\\mathbf{M}_{\\mathrm{w}}\\mathbf{\\nabla}7.8$ MAIMSHOCK(称为$M I$)出现在主要板界故障上",
  "475 475   \n476   \n477   \n478   \n479   \n480   \n481   \n482   \n483   \n484   \n485   \n486   \n487   \n488   \n489   \n490   \n491   \n492   \n493   \n494   \n495   \n496   \n497   \n498   \n499  _en_zh_google": "475 475   \n476   \n477   \n478   \n479   \n480   \n481   \n482   \n483   \n484   \n485   \n486   \n487   \n488   \n489   \n490   \n491   \n492   \n493   \n494   \n495   \n496   \n497   \n498   \n499",
  "474 (denoted as M2) ruptures the intraplate faults. The distinct aftershock patterns observed across this dual faults suggest contrasting fault properties (Ding et al., 2023; Güvercin, 2024).  _en_zh_google": "474(称为M2)破裂板内断层。在此双重断层上观察到的明显的余震模式表明对比的故障特性(Ding等，2023；Güvercin，2024)。",
  "In this study, we build a seismic catalog covering the entire EAFZ, a task that presents technical challenges due to the large spatial extent, and the relatively sparse seismic network, with its inter-station distances ranging from about 30 to $60\\mathrm{km}$ (Figure 5 & S1c). This network density is representative of most regions outside of the well-monitored areas like California and Japan. We start our analysis from 2020, because of the significant enhancement of Turkey seismic network in that year (Figure S1c & S2b), spurred by a $\\mathbf{M}_{\\mathrm{w}}6.8$ earthquake on January 24, 2020, that ruptured the NE side of the 2023 rupture zones (Gallovič et al., 2020; Lin et al., 2020; Melgar et al., 2020; Pousse-Beltran et al., 2020). Our study extends over a 3-month aftershock period to 2023/04, which expands our previous rapid work that only covers 1 months’ early aftershocks (Ding et al., 2023) and the 2-month aftershock period examined by Güvercin (2024). We combine 3-channel broad-band stations from multiple networks, including the TU network from the Disaster and Emergency Management Presidency (AFAD) and the KO network from the Kandilli Observatory and Earthquake Research Institute (KOERI). Instead of discussing this case in the EAFZ alone, we will combine the previous case in the Ridgecrest-Coso to compare the generalization ability of different phase picking and association algorithms in earthquake detection. This is motivated by the fact that the two cases are associated with contrasting tectonic settings, spatiotemporal scales, and network configurations.  _en_zh_google": "在这项研究中，我们建立了一个涵盖整个EAFZ的地震目录，该任务由于空间范围很大而引起的技术挑战，以及相对稀疏的地震网络，其站间距离的距离约为30至$60\\mathrm{km}$(图5＆S1C)。该网络密度代表了加利福尼亚和日本等良好地区以外的大多数地区。我们从2020年开始分析，这是因为当年土耳其地震网络的显着增强(图S1C和S2B)，这是由2020年1月24日的_____l_math_1_地震刺激的，它破裂了2023年的NE侧2023年破裂区的NE一侧(Gallovič等，2020年，2020年，2020; lin et e an e al al an al。 2020)。我们的研究将3个月的余震时间延长至2023/04，这扩展了我们以前的快速工作，该工作仅涵盖1个月的早期余震(Ding等，2023)和Güvercin(2024)检查的2个月后盘后。我们结合了来自多个网络的3通道宽带站点，包括来自灾难和紧急管理总统的TU网络和KANDILLI天文台和地震研究所(KOERI)的KO网络。我们将在Ridgecrest-Coso中结合先前的情况，以比较地震检测中不同相拾取和关联算法的概括能力，而不是仅在EAFZ中讨论这种情况。这是由于这两种情况与对比构造设置，时空尺度和网络配置相关的事实的动机。",
  "# 3.2.2 Detection and Location  _en_zh_google": "# 3.2.2检测和位置",
  "Contrary to our first case in Ridgecrest-Coso, for this case in EAFZ, we execute the LoSAR workflow over a combined ${\\sim}3.5$ -year pre-postseismic period. This approach offers additional validation of LoSAR’s capability to handle highly variable seismicity rates. The detection and location parameters for this EAFZ case largely align with those used in the Ridgecrest-Coso case, with the exception of several parameters adjusted to accommodate the expanded scope and density of the network.  _en_zh_google": "与我们在Ridgecrest-Coso中的第一个案例相反，对于EAFZ，我们在合并的__ All_math_0__-year Prestseismic时期内执行Losar工作流程。这种方法提供了Losar处理高度可变地震率的能力的额外验证。此EAFZ情况的检测和位置参数在很大程度上与Ridgecrest-Coso案例中使用的检测参数一致，但调整了几个参数以适应网络的扩展范围和密度。",
  "![](images/3fa040445806ecbde2b8428ac57cd2943e5e9a74c0d2fecd62d3a0a642ae18b9.jpg)  _en_zh_google": "![](images/3fa040445806ecbde2b8428ac57cd2943e5e9a74c0d2fecd62d3a0a642ae18b9.jpg)",
  "Figure 5. Study region and catalog comparison for Case 2: East Anatolian Fault Zone (2020- 2023/04). (a-b) plot the LoSAR catalog generated in this study, with preseismic period (2020-2023/02/05) and aftershock period (2023/02/06-04/30) shown separately. Seismicity is plotted as dots that have its depth denoted by color and size varies by magnitude. $\\mathbf{M}{>}6$ earthquakes after 2020 are marked by yellow stars. Seismic stations used are denoted by white hollow triangles; active faults are plotted as black lines; responsible faults for the 2023 earthquake doublet are marked by red lines. The insets show location of the study area in a larger scale, with the Arabian Plate (AR Plt.) and Anatolian Plate (AN Plt.) marked. (c-d) are the same as (a-b), but for the relocated AFAD catalog by Lomax (2023). The blue boxes mark the location coverage in Figure 9.  _en_zh_google": "图5。案例2的研究区域和目录比较：东阿纳托利亚断层区(2020-2023/04)。 (A-B)绘制了本研究中生成的Losar目录，分别显示了Preseiscic时期(2020-2023/02/05)和余震周期(2023/02/06-04/30)。地震性被绘制为具有颜色和尺寸表示深度的点，大小变化。 $\\mathbf{M}{>}6$ 2020年以后的地震标有黄星。使用的地震站用白色空心三角形表示；主动故障绘制为黑线； 2023年地震双线的负责故障以红线为标志。这些插图显示了大规模的研究区域的位置，标有阿拉伯板(Ar plt。)和Anatolian板(Anatolian板(Plt。)。 (C-D)与(A-B)相同，但对于Lomax(2023)重新定位的AFAD目录。蓝色框标记了图9中的位置覆盖范围。",
  "In running PAL, the phase picker utilizes the same triggering threshold, but an 18-s S wave search window, which corresponds to a $\\sim150{\\cdot}\\mathrm{km}$ epicentral distance. The PAL associator maintains a 4-station requirement, but different in the limit for original time deviation as $<1.6~\\mathrm{s}$ and the P-wave travel time as $<1.2\\mathrm{~s~}$ . These specifications resulted in 47,416 / 295,494 event detections / associated picks. In running SAR, we set a larger window length of $25~\\mathrm{s}$ and maintain the same 10-s sliding stride. We augment the original training samples by 2 times, making a total of 516168 / 322,894 positive / negative training samples. Similarly, ${\\sim}10\\%$ remaining samples are used for validation. We applied the same data preprocessing, and made 20 epochs of training until the accuracy is stabilized (Figure S8). After applying the locally-trained SAR picker and the same PAL associator, we got 140,119 / 929,944 event detections / associated picks, which represents a ${\\sim}3$ -fold increase in the number of detections compared to PAL.  _en_zh_google": "在运行PAL时，相接送器使用相同的触发阈值，但是一个18-S S Wave搜索窗口，对应于$\\sim150{\\cdot}\\mathrm{km}$层状距离。 PAL Associator保持了4个站的要求，但原始时间偏差的极限不同，为_$<1.6~\\mathrm{s}$和P-WAVE旅行时间为$<1.2\\mathrm{~s~}$。这些规格产生了47,416 / 295,494事件检测 /相关选择。在运行SAR时，我们将较大的窗口长度设置为$25~\\mathrm{s}$并保持相同的10-S滑动步幅。我们将原始培训样本增加了2次，总计516168 / 322,894正 /负训练样本。同样，$\\sim 10\\%$剩余的样本用于验证。我们应用了相同的数据预处理，并进行了20个训练时期，直到稳定该准确性为止(图S8)。在应用了局部训练的SAR选择器和同一PAL协会者之后，我们获得了140,119 / 929,944事件检测 /相关的选择，这代表$\\sim 3$-折叠率增加了检测数量与PAL相比。",
  "To locate and relocate these detections, we adopt the second approach described in Section 2.1 (Figure 1), utilizing both dt.ct and dt.cc in the second round of relocation. For the hypoINV absolute location, we also weight the phases by its epicentral distance and residual times, but set a less restrictive set of parameters to account for the sparser network: the distance weighting is configured as $0{\\cdot}80\\mathrm{km}$ full weight, $>160\\mathrm{km}$ zero weight, and $80{-}160\\mathrm{km}$ cosine tapered; the time residual weighting is configured in the same way between $0.4\\:\\mathrm{s}$ and 1.2 s. Similar as for RidgecrestCoso, the S-wave weights are further adjusted by a factor of 0.6. The hypoINV outputs ${\\sim}93.1\\%$ well located events, with an average lateral and vertical uncertainty of $2.48~\\mathrm{km}$ and $3.73~\\mathrm{km}$ , respectively. Note that the location error is highly variable across our study region, due to the heterogenous station distribution. In the first round of hypoDD relocation with dt.ct, we pair events within $20~\\mathrm{km}$ (i.e. WDCT, in hypoDD terminology), and $\\mathrm{P}$ & S waves weighted as 1 & 0.6,  _en_zh_google": "为了找到和重新安置这些检测，我们采用了第2.1节(图1)中描述的第二种方法，在第二轮搬迁中同时利用DT.CT和DT.CC。 For the hypoINV absolute location, we also weight the phases by its epicentral distance and residual times, but set a less restrictive set of parameters to account for the sparser network: the distance weighting is configured as $0{\\cdot}80\\mathrm{km}$ full weight, $>160\\mathrm{km}$ zero weight, and $80{-}160\\mathrm{km}$ cosine tapered;残留加权的时间以相同的方式配置在$0.4\\:\\mathrm{s}$和1.2 s之间。与Ridgecrestcoso相似，S波重量进一步调整了0.6倍。 Hypoinv输出$\\sim 93.1\\%$位置良好的事件，分别为$2.48~\\mathrm{km}$和$3.73~\\mathrm{km}$的平均横向和垂直不确定性。请注意，由于异源站分布，位置误差在我们研究区域的高度变化。在与DT.CT的第一轮搬迁的第一轮中，我们将事件配对$20~\\mathrm{km}$(即WDCT，在hypodd术语中)，$\\mathrm{P}$＆s wave加权为1＆0.6，",
  "532   \n533   \n534   \n535   \n536   \n537   \n538   \n539   \n540   \n541   \n542   \n543   \n544   \n545   \n546   \n547   \n548   \n549   \n550   \n551   \n552   \n553   \n554   \n555   \n556   \n557   \n558   \n559   \n560  _en_zh_google": "532   \n533   \n534   \n535   \n536   \n537   \n538   \n539   \n540   \n541   \n542   \n543   \n544   \n545   \n546   \n547   \n548   \n549   \n550   \n551   \n552   \n553   \n554   \n555   \n556   \n557   \n558   \n559   \n560",
  "inversed for 4 iterations. The relocation uncertainty is also correlated with the station density, ranging from about $180–280\\mathrm{~m~}$ for epicenter and $250–550\\mathrm{~m~}$ for depth, under the least square criteria by hypoDD. For CC-based differential time measurements, we filter the waveforms to 1- $12\\mathrm{Hz}$ , considering the sparser network, while keeping the same P and S windows as in RidgecrestCoso. We only calculate dt between $\\mathrm{M}_{\\mathrm{L}}{>}0.5$ earthquakes and other events. We limit a maximum number of 50 neighboring events in the candidate selection step, and we require $\\mathrm{CC}{>}0.3,d t{\\_}p{<}1$ s, and $d t\\_s{<}1.75\\mathrm{~s~}$ , in addition to a minimum number of 4 stations fulfilling these criteria. The above processes finally obtain 3,719,995 P and 2,961,716 S differential times. For the final hypoDD relocation process that combines dt.ct & dt.cc, we made 2 sets of inversions. In the first round, we set WDCC and WDCT as $4\\mathrm{km}$ and $10\\mathrm{km}$ , and weighted the dt.ct data strongly; in the second round of inversion, the WDCC and WDCT are set to $2\\mathrm{km}$ and $5\\mathrm{km}$ , with the dt.cc being dominantly weighted. Using this weighting scheme, we benefit from both the high-precision dt.cc data and the wide coverage of dt.ct that  helps maintain more events in relocation. Finally, we obtained 93,680 well-relocated events, with an average relocation error ranging from about 40-80 m and $70–120\\mathrm{m}$ along horizontal and vertical directions, respectively. Furthermore, aiming for a higher-resolution catalog (at the cost of reducing the number of detections), and for a more realistic estimation of location uncertainty, we also applied the first approach outlined in Section 2.1 (Figure 1) to relocate the LoSAR detections. We exclusively used dt.cc for relocation, setting WDCC as $2~\\mathrm{km}$ and performing the inverse over 4 iterations. This yielded 56,656 events with a much lower relocation uncertainty and an overall consistent distribution of seismicity (Figure S22- S24). However, it is important to note that this relocation approach results in a considerable reduction of events above the completeness magnitude, rendering it less suitable for b-value analysis.  _en_zh_google": "反向进行4次迭代。搬迁不确定性也与站点密度相关，范围从____ All_math_0__ for epicenter和__$250–550\\mathrm{~m~}$ for Depth，在最小的正方形标准下，范围为hypodd。对于基于CC的差异时间测量，我们考虑使用稀疏网络，将波形过滤到1- __ All_math_2__，同时保留与RidgeCrestCoso中相同的P和S窗口。我们仅计算$\\mathrm{M}_{\\mathrm{L}}{>}0.5$地震与其他事件之间的DT。除了满足这些条件的最低数量，我们还限制了候选选择步骤中最多50个相邻事件的数量，我们需要$\\mathrm{CC}{>}0.3,d t{\\_}p{<}1$ s和$d t\\_s{<}1.75\\mathrm{~s~}$ s和$d t\\_s{<}1.75\\mathrm{~s~}$。上述过程最终获得3,719,995 p和2,961,716的差异时间。对于结合了DT.CT＆DT.CC的最终置换搬迁过程，我们进行了2组反演。在第一轮中，我们将WDCC和WDCT设置为$4\\mathrm{km}$和$10\\mathrm{km}$，并强烈加权DT.CT数据；在第二轮倒置中，WDCC和WDCT设置为$2\\mathrm{km}$和$5\\mathrm{km}$，而DT.CC则主要加权。使用此加权方案，我们从高精度DT.CC数据和DT.CT的广泛覆盖范围中受益，这有助于维持更多的搬迁事件。最后，我们获得了93,680个良好的事件，平均重定位误差范围约为40-80 m，沿水平和垂直方向分别为40-80 m和$70–120\\mathrm{m}$。此外，旨在实现高分辨率目录(以减少检测数量的成本)，并且为了对位置不确定性进行更现实的估计，我们还采用了第2.1节(图1)中概述的第一种方法(图1)来重新安置Losar检测。我们专门使用dt.cc进行重新定位，将WDCC设置为_$2~\\mathrm{km}$并执行超过4个迭代的反向。这产生了56,656个事件，其搬迁不确定性和整体地震性分布较低(图S22-S24)。但是，重要的是要注意，这种搬迁方法导致事件的大幅度降低，使其不适合B值分析。",
  "The detection and location strategies elaborated above result in a significantly enhanced catalog compared with the relocated AFAD catalog produced by Lomax (2023), as show in Figure 5. Such advancement is made possible by a much higher detectability and relocation precision. Similar as in Ridgecrest-Coso, the LoSAR catalog exhibit ideal FMDs and magnitude-time series in EAFZ (Figure S25), effectively capturing the seismicity features for both the preseismic and postseismic period.  _en_zh_google": "如图5所示，与Lomax生成的迁移的AFAD目录相比，上述检测和位置策略导致目录显着增强。通过更高的可检测性和重新定位精确度，这一进步是可能的。与Ridgecrest-Coso相似，Losar目录在EAFZ中表现出理想的FMD和幅度时间序列(图S25)，有效地捕获了preseismic and the Perseismic and the Perseismic时期的地震性特征。",
  "![](images/c4a1d1139b7675d4af11b45ca64de1530603e1e7cb2368b6d0d2b63d122925ea.jpg)  _en_zh_google": "![](images/c4a1d1139b7675d4af11b45ca64de1530603e1e7cb2368b6d0d2b63d122925ea.jpg)",
  "Figure 6. Comparison of phase picking and association performance. The blue, cyan, orange, and red markers denote the results by PAL, PhaseNet picker $^+$ GaMMA associator, PhaseNet picker $^+$ PAL associator, and LoSAR workflow developed in this study, respectively. (a & e) plot the number of picks. The P & S picks are marked by darker and lighter colors. The paired P&S picks are filled by color, with the paired ratio annotated on top of the bar; (b & f) plot the number of associated picks. The pick association ratio is annotated on top the bar; (c & g) plot the FMD comparison, where circles and triangles denote cumulative and non-cumulative numbers, respectively; (d & h) plot the number of unassociated picks on each station. The stations are sorted by the number by PAL. (a-d) and (e-h) plot the Case 1 (RidgecrestCoso) and Case 2 (EAFZ), respectively. Note that for (c) & (g), only the events within the location coverage of Figure 5 are included in the statistics.  _en_zh_google": "图6。相拾取和关联性能的比较。蓝色，青色，橙色和红色标记表示PAL的结果，Phasenet Picker $^+$ GAMMA Associator，Phasenet Picker $^+$1_ PAL Associator和Losar Workflow在这项研究中开发了。 (A＆E)绘制选秀人数。 P＆S的精选标志着较暗，更浅的颜色。配对的P＆S选片是用颜色填充的，在栏顶上注释了配对比。 (B＆F)绘制关联的选择的数量。在栏上注释了选拔协会比率； (C＆G)绘制FMD比较，其中圆圈和三角形分别表示累积和非肿瘤数字； (d＆h)绘制每个站点上无关的选秀数量。电台按数字按PAL对。 (A-D)和(E-H)分别绘制情况1(Ridgecrestcoso)和案例2(EAFZ)。请注意，对于(c)＆(g)，统计信息中仅包含图5的位置覆盖范围内的事件。",
  "# 3.2.3 Comparisons with Both Cases  _en_zh_google": "# 3.2.3与两种情况的比较",
  "Utilizing this case in the EAFZ pre-postseismic period, along with our previous case in the Ridgecrest-Coso preseismic period, we conduct detailed comparisons against PhaseNet (Zhu and Beroza, 2018) and GaMMA (Zhu et al., 2022c), both of which are considered as the state-ofthe-art phase picking and association algorithms, and are being widely adopted in cataloging workflows (e.g. Zhang et al., 2022; Zhu et al., 2022b). Through these comparisons, we can evaluate the scalability of these algorithms across different tectonic environments, spatiotemporal ranges, and network densities.  _en_zh_google": "我们在EAFZ前震中时期使用此案，以及我们先前在Ridgecrest-Coso preseismin时期的案例，我们进行了与Phasenet(Zhu and Beroza，2018)(Zhu and Beroza，2018)和Gamma(Zhu等人，2022C)的详细比较，这两种比较被认为是在这种状态下，并且被认为是与Algorith Algorith的状态相结合的，并且是相结合的相结合。工作流(例如Zhang等，2022； Zhu等，2022b)。通过这些比较，我们可以评估这些算法在不同的构造环境，时空范围和网络密度之间的可扩展性。",
  "In executing PhaseNet and GaMMA, we adhere primarily to their default parameters and the behaviors anticipated for typical users, which are intended to be broadly applicable. For PhaseNet, we use 30-s time windows that slide in 15-s steps. They are larger than what we set for SAR picker in the two cases, and should have enough coverage. The waveforms are high-pass filtered above $1\\mathrm{Hz}$ . We keep the default triggering threshold at 0.3. Picks from overlapping sliding windows are merged using a 0.5-s window, where the picks with higher prediction probabilities are selected. Note that PhaseNet pick P & S arrivals independently, and we pair them up to combine with the PAL associator. The phase pairing strategy is consistent with that used for the SAR picker; however, it necessitates manually setting an S-wave search window, which we keep the same as for PAL picker in the two cases. For GaMMA, we set the criterion at a minimum of 8 phases to declare an event detection, aligning this requirement with the 4-station criterion of the PAL associator that we applied in both the EAFZ and Ridgecrest-Coso cases. It is important to highlight that the association results from GaMMA do not necessarily ensure paired P and S phases  _en_zh_google": "在执行Phasenet和Gamma时，我们主要遵守它们的默认参数以及针对典型用户预期的行为，这些参数旨在广泛适用。对于Phasenet，我们使用30秒的时间窗口，该窗口以15秒的步骤滑动。它们比我们在两种情况下为SAR采摘器设置的要大，并且应该具有足够的覆盖范围。波形被高通滤波在$1\\mathrm{Hz}$上方。我们将默认的触发阈值保持在0.3。从重叠的滑动窗口中的选件是使用0.5-S窗口合并的，其中选择了具有较高预测概率的选件。请注意，Phasenet选择P＆S P＆S到达，我们将它们配对以与PAL Associator结合。相对配对策略与SAR选择器所使用的策略一致。但是，它需要手动设置一个S波搜索窗口，在两种情况下，我们将其与PAL Picker相同。对于Gamma，我们将标准设置为至少8个阶段来宣布事件检测，这将这一要求与我们在EAFZ和Ridgecrest-Coso案例中应用的PAL Associator的4站标准保持一致。重要的是要强调，伽马产生的关联不一定确保配对P和S相",
  "593   \n594   \n595   \n596   \n597   \n598   \n599   \n600   \n601   \n602   \n603   \n604   \n605   \n606   \n607   \n608   \n609   \n610   \n611   \n612   \n613   \n614   \n615   \n616   \n617   \n618   \n619   \n620   \n621   \n622  _en_zh_google": "593   \n594   \n595   \n596   \n597   \n598   \n599   \n600   \n601   \n602   \n603   \n604   \n605   \n606   \n607   \n608   \n609   \n610   \n611   \n612   \n613   \n614   \n615   \n616   \n617   \n618   \n619   \n620   \n621   \n622",
  "for each station. However, we observed that directly utilizing the GaMMA outputs for hypoINV lead to a significant number of events unconstrained (Figures S11 & S12). Consequently, we opted to refine the GaMMA outputs by excluding the stations with only single P or S picks and imposed a requirement for a minimum of 4 stations.  _en_zh_google": "每个站。但是，我们观察到，直接利用伽马输出进行hypoINV导致大量事件不受限制(图S11＆S12)。因此，我们选择通过排除只有单个P或S选件的站点来完善伽马输出，并对最低4个站提出了要求。",
  "We first compare the number of associated picks and the association ratio (Figure 6a-b & e-f). We assume that the association process filters out most of the false picks, thus the number of associated picks represents the phase detection completeness, and the association ratio indicate the detection accuracy. In the Ridgecrest-Coso case, all three combinations of AI-driven pickerassociator setups (i.e. PhaseNet $^{+}$ GaMMA, PhaseNet+PAL, and LoSAR) achieved a similar number of associated picks, with an association ratio around $10\\%$ (Figure 6a-b). This performance markedly outperforms that of the STA/LTA method, as represented by PAL, demonstrating the advanced picking accuracy and completeness afforded by deep learning methodologies that learn from waveform features. Note that PhaseNet is originally trained on Northern California data, thus is intrinsically localized for the Ridgecrest-Coso case. Moreover, all three methods recalled ${\\sim}97\\%$ events in the SCSN catalog, showing great consistency in event detection. In contrast, in the EAFZ case, the number of associated picks by LoSAR surpasses that of PhaseNet+PAL by ${\\sim}1.5$ times, and ${\\sim}2.5$ times more than PhaseNet+GaMMA (Figure 6e-f). Furthermore, both PhaseNet+PAL and PhaseNet+GaMMA demonstrate significantly lower association ratios $5.9\\%$ and $3.3\\%$ , respectively) in comparison to LoSAR’s $23.1\\%$ , as well as to their performances in the RidgecrestCoso case $(\\sim10\\%)$ . This result indicates that PhaseNet is less tailored for the EAFZ data, and that GaMMA suffers from a much larger-scale network with sparse station distributions. By comparing the FMDs (Figure 6c & g), it is evident that the three AI-driven picker-associator combinations show high consistency in Ridgecrest-Coso, as previously noted. However, PhaseNet $^{+}$ GaMMA displays noticeable discrepancies for the EAFZ case, missing a significant portion of events above the complete magnitude. Excluding this particular instance, the remaining seven catalogs across both cases display consistent FMDs for the portion above completeness magnitude, aligning with the expectations set by the GR law.  _en_zh_google": "我们首先比较相关的选件的数量和关联比(图6a-b＆e-F)。我们假设关联过程会滤除大多数错误的选择，因此相关选片的数量表示相位检测的完整性，关联比表示检测准确性。 In the Ridgecrest-Coso case, all three combinations of AI-driven pickerassociator setups (i.e. PhaseNet $^{+}$ GaMMA, PhaseNet+PAL, and LoSAR) achieved a similar number of associated picks, with an association ratio around $10\\%$ (Figure 6a-b).这种性能明显优于PAL代表的STA/LTA方法的表现，这表明了深度学习方法提供了从波形功能中学习的高级选择精度和完整性。请注意，Phasenet最初是对北加州数据进行培训的，因此在Ridgecrest-Coso案例中本质上定位。此外，所有三种方法都召回了SCSN目录中的$\\sim 97\\%$事件，在事件检测中显示出非常一致的一致性。相比之下，在EAFZ情况下，Losar的相关选秀人数超过了Phasenet+PAL的$\\sim 1.5$次，而$\\sim 2.5$倍于phasenet+gamma(图6e-f)。此外，与Losar的_____l_math_7__相比，Phasenet+Pal和Phasenet+Gamma分别表现出明显较低的关联比$5.9\\%$和$3.3\\%$_______该结果表明，对于EAFZ数据，Phasenet量身定制的量较低，并且伽玛遭受了一个较大的网络，其网站分布稀疏。通过比较FMD(图6c＆g)，很明显，三个AI驱动的选择器 - 相关剂组合在RIDGECREST-COSO中表现出很高的一致性，如前所述。但是，phasenet $^{+}$伽玛对EAFZ案件显示出明显的差异，缺少超过完整幅度的大部分事件。除了此特定实例外，两种情况下的其余七个目录都显示出一致的FMD，该部分的部分超过了完整性幅度，与GR法律设定的期望保持一致。",
  "Lastly, we examine the number of unassociated picks across all stations in both cases (Figure 6d & h). Given the presumption that a large portion of the unassociated picks represent false detections, the spread of unassociated picks across stations serves as an indicator of a phase picker’s detection stability. In our analysis, we compare three phase pickers: PAL, PhaseNet, and  _en_zh_google": "最后，我们在两种情况下都检查了所有站点的无关选秀的数量(图6D＆H)。考虑到大部分非相关的选片代表虚假检测的假设，因此在跨站中无关​​的选拔物的传播是相拾取器的检测稳定性的指标。在我们的分析中，我们比较了三个相采集器：PAL，Phasenet和",
  "LoSAR, employing PAL (based on STA/LTA) as the benchmark for evaluating PhaseNet and LoSAR. The rationale behind this comparison stems from the high sensitivity of STA/LTA algorithms to pulse-like noises (e.g. data glitches), which often results in a higher volume of unassociated picks. Consequently, when PhaseNet or LoSAR generate significantly more unassociated picks than PAL, it suggests a high false detection rate for low-SNR phases. In both cases, there is no correlation in the number of unassociated picks between PAL and the two AIbased pickers (Figure 6d & h), demonstrating the AI pickers’ effective ability to discriminate against pulse-like noises. This performance aligns with expectations due to their design to analyze whole-waveform characteristics. However, even in the case of Ridgecrest-Coso (Figure 6d), a few stations were identified where PhaseNet produced a significantly higher number of unassociated picks compared to PAL. Such instability of PhaseNet is notably severer in EAFZ, where multiple stations recorded more than twice the unassociated picks than PAL (Figure 6h). These observations suggest that PhaseNet may be sensitive to certain types of low-SNR noises. A similar behavior is also observed with LoSAR’s picking results, albeit to a lesser extent (Figure 6d). The above observations highlight a potential area for improvement in AI-picker’s noise discrimination capabilities, and a multi-station-based picking algorithm could offer a solution (e.g. Feng et al., 2022; Sun et al., 2023).  _en_zh_google": "Losar，使用PAL(基于STA/LTA)作为评估Phasenet和Losar的基准。这种比较背后的基本原理源于STA/LTA算法对脉冲样噪声的高灵敏度(例如数据故障)，这通常会导致较高体积的无相关选拔。因此，当Phasenet或Losar产生比PAL明显更多的无相关选片时，它表明对于低SNR阶段的错误检测率很高。在这两种情况下，PAL和两个基于AIB的拾取器之间的无相关选择数量都没有相关性(图6D＆H)，这表明了AI采摘者有效区分脉冲样噪声的有效能力。由于设计分析全波形特征，这种性能与期望相符。但是，即使在Ridgecrest-coso的情况下(图6D)，也发现了一些站点，与PAL相比，Phasenet产生的无相关选拔次数明显更高。在EAFZ中，这种伪造的不稳定性明显更加严重，在此，多个电台的记录是无关的选择是PAL的两倍以上(图6H)。这些观察结果表明，Phasenet可能对某些类型的低SNR噪声敏感。 Losar的挑选结果也观察到了类似的行为，尽管程度较小(图6D)。上述观察结果凸显了AI-Picker噪声辨别能力改善的潜在领域，而基于多站的采摘算法可以提供解决方案(例如Feng等，2022; Sun等，2023)。",
  "In summary, our comparative analysis across cases with divergent characteristics demonstrate the LoSAR’s superiority in detection completeness and stability over PhaseNet, as well as PAL’s greater scalability in phase association compared to GaMMA. These attributes position LoSAR as a notably robust workflow for compiling long-term, large-scale seismic catalogs.  _en_zh_google": "总而言之，我们在具有不同特征的情况下进行的比较分析表明，与伽马相比，Losar在检测完整性和稳定性方面的优势以及PAL在相关性方面的可扩展性更高。这些属性位置losar是一种尤其是可靠的工作流程，用于编译长期大规模的地震目录。",
  "# 4. Characterizing Preseismic Fault Behaviors  _en_zh_google": "# 4。表征preseismic的断层行为",
  "Leveraging the high-resolution catalogs developed in the preceding section, we conduct practical analysis to demonstrate the advantages of an enhanced catalog in characterizing fault behaviors before a large earthquake. Our investigation spans both the Ridgecrest-Coso and EAFZ region, exploring whether the preseismic catalog shed light on coseismic fault behaviors, which is potentially helpful in seismic hazard assessment for other regions prior to large earthquakes. We confine the analysis within the spatial dimension, utilizing seismicity distribution to infer the fault geometry and using b-value as an indicator of stress level. The examinations of temporal seismicity evolution and b-value variation demand more rigorous analysis and statistical techniques, thus fall beyond the scope of this paper.  _en_zh_google": "利用前一节中开发的高分辨率目录，我们进行了实践分析，以证明增强目录在表征大地震之前表征断层行为方面的优势。我们的调查涵盖了Ridgecrest-Coso和EAFZ地区，探索了Preseismic目录是否阐明了coseis震动断层行为，这可能有助于对大地震之前其他地区的地震危害评估。我们将分析局限于空间维度，利用地震性分布来推断断层几何形状并使用B值作为应力水平的指标。时间地震性进化和B值变化的检查需要更严格的分析和统计技术，因此超出了本文的范围。",
  "The seismicity imaging technique relies on the understanding that earthquakes, regardless of their size, occur on faults, including both major and subsidiary ones. Consequently, the clustered seismicity serves as a tool to detect geologically hidden faults, and to direct delineate fault structures at depth with a high resolution (e.g. Waldhauser and Schaff, 2008; Hauksson et al., 2012; Ross et al., 2019b; Shelly, 2020). However, the occurrence of seismicity is intricately linked to the stress and frictional state of faults (as reviewed in Bürgmann, 2018), which introduces several caveats in the interpretation of seismicity distribution. For example, certain fault segments can be quiescent during the interseismic period, because of the stress shadow drawn by a deeply penetrated rupture of previous large earthquakes (Jiang and Lapusta, 2016). Therefore, a lack of continuous seismicity does not necessarily imply a discontinuity in fault structure. Another commonly observed phenomenon is the complementary distribution between aftershocks and coseismic slip (Wetzler et al., 2018; Toda and Stein, 2022). In such cases, aftershocks tend to concentrate on the periphery of ruptured asperities, thereby obscure the fault dip in cross-section views. Thus, to accurately infer fault geometry, it is always recommended to jointly consider the focal mechanism solutions and the surface traces of faults or ruptures (e.g. Lu et al., 2021; Zhou et al., 2022a; Ding et al., 2023).  _en_zh_google": "地震成像技术取决于理解，地震，无论其大小如何，都发生在包括主要和子公司的断层上。因此，聚集的地震性是检测地质隐藏断层的工具，并以高分辨率将划定断层结构引导到深度(例如Waldhauser and Schaff，2008; Hauksson等，2012; Ross et al。，Ross et al。，2019b; Shelly，2020年)。但是，地震性的发生与断层的压力和摩擦状态相关(如Bürgmann，2018年所述)，这在解释地震性分布时引入了一些警告。例如，某些断层段可以在微区时期静止不动，因为由于以前的大地震的深处破裂而引起了压力阴影(Jiang and Lapusta，2016年)。因此，缺乏连续的地震性并不一定意味着断层结构的不连续性。另一个普遍观察到的现象是余震与coseis震滑之间的互补分布(Wetzler等，2018； Toda和Stein，2022)。在这种情况下，余震倾向于集中在破裂的垂体破裂的周围，从而掩盖了横截面视图中的断层倾角。因此，为了准确推断故障几何形状，始终建议共同考虑焦点机理解和断层或破裂的表面痕迹(例如Lu等，2021; Zhou等，2022a; ding等，2023)。",
  "The b-value in the GR-law, which quantifies the relative number of large versus small earthquakes, is inversely related to the stress level, as demonstrated by numerous experimental and statistical studies (Scholz, 2015, and references therein). In this study, we obtain the spatial distribution of b-values by calculations performed on each grid cell, incorporating earthquakes within a specified radius. Given a set of earthquakes, the b-value can be estimated by the maximum-likelihood method (Aki, 1965):  _en_zh_google": "GR-LAW中的B值量化了大地震的相对数量，与应力水平成反比，如大量实验和统计研究所证明(Scholz，2015，其中的参考文献)。在这项研究中，我们通过在每个网格电池上进行的计算获得了B值的空间分布，并在指定半径内结合了地震。鉴于一组地震，可以通过最大似然法估算B值(AKI，1965年)：",
  "$$\nb=\\frac{\\log_{10}e}{\\overline{{{M}}}-M_{C}+\\frac{\\Delta M}{2}},\n$$  _en_zh_google": "$$\nb=\\frac{\\log_{10}e}{\\overline{{{M}}}-M_{C}+\\frac{\\Delta M}{2}},\n$$",
  "where ${\\bar{M}},M_{C}$ , and $\\Delta M$ is the mean magnitude, lower cut-off magnitude, and the magnitude bin, respectively. The b-value uncertainty is estimated following Shi and Bolt (1982):  _en_zh_google": "其中${\\bar{M}},M_{C}$和$\\Delta M$分别是平均大小，较低的大小和大小bin。在Shi和Bolt(1982)之后，估计B值不确定性：",
  "$$\n\\delta b=2.3\\times b^{2}\\times\\sqrt{\\sum_{i=1}^{n}\\frac{(M_{i}-\\overline{{{M}}})^{2}}{n(n-1)}},\n$$  _en_zh_google": "$$\n\\delta b=2.3\\times b^{2}\\times\\sqrt{\\sum_{i=1}^{n}\\frac{(M_{i}-\\overline{{{M}}})^{2}}{n(n-1)}},\n$$",
  "where $n$ is the number of events. For reliable b-value estimations, we require a minimum number of events above the cut-off magnitude, typically $>80$ . It is important to recognize that the b-value uncertainty determined by Equation 4 tend to underestimate its true variability (Woessner and Wiemer, 2005; Amorèse et al., 2010; Marzocchi et al., 2019). Therefore, we conduct additional tests to prevent over-interpretation in our applications, which includes: (1) Adjusting the slicing radius for each grid, which affect the number of events in b-value estimations; (2) Modifying the cut-off magnitude $(M_{C})$ , given that b-value estimation is positively correlated with $M_{C}$ (Cao and Gao, 2002; Zhou et al., 2018); and (3) whether to adopt a uniform $M_{C}$ or calculate $M_{C}$ individually on each grid. Note that we opt to use a uniform $M_{C}$ in the main text, based on the considerations mentioned above.  _en_zh_google": "其中$n$是事件的数量。对于可靠的B值估计，我们需要最少的事件数量以上的截止幅度，通常为_$>80$。重要的是要认识到，公式4确定的B值不确定性倾向于低估其真实变异性(Woessner和Wiemer，2005；Amorèse等，2010； Marzocchi等，2019)。因此，我们进行了其他测试，以防止应用程序中的过度解释，其中包括：(1)调整每个网格的切片半径，这会影响B值估计中事件的数量； (2)修改截止幅度$(M_{C})$，鉴于B值估计与$M_{C}$呈正相关(Cao和Gao，2002; Zhou等，2018); (3)是在每个网格上采用统一的$M_{C}$还是单独计算$M_{C}$。请注意，我们根据上述考虑因素选择在主文本中使用统一的$M_{C}$。",
  "# 4.1 2019 Ridgecrest-ruptured fault  _en_zh_google": "# 4.1 2019 RIDGECREST破坏故障",
  "As reviewed in Section 3.1.1, the 2019 Ridgecrest sequence activated a largely unmapped orthogonal fault system. However, subsequent detailed geological investigation by Thompson Jobe et al. (2020) suggest that up to $50\\%$ of the fault traces could have been mapped before the earthquake. It is practically important to know whether those faults can be imaged by long-term seismicity, and whether this region represent a hazardous seismic gap, considering that the Ridgecrest sequence breaks a ${\\sim}20$ -year quiescence in the ECSZ (Ross et al., 2019a; Chen et al., 2020; Hauksson and Jones, 2020).  _en_zh_google": "如第3.1.1节所述，2019年Ridgecrest序列激活了一个很大程度未映射的正交故障系统。但是，随后的Thompson Jobe等人进行了详细的地质研究。 (2020)建议在地震之前可能已映射到故障迹线的$50\\%$。实际上，要知道是否可以通过长期的地震性来成像这些故障，以及该地区是否代表危险的地震差距，考虑到Ridgecrest序列破坏了ECSZ中的____MATH_1_ -YEREAR静止(Ross et al。",
  "From the event distribution prior to the earthquake (Figure 7a-b), it is evident that an over 20-km-wide zone along the Ridgecrest faults is characterized by spreading microseismicity. This pattern is more distinctly observed in our LoSAR catalog compared to both the relocated SCSN catalog and the QTM catalog (Figure S17). Though the southern segments have much lower seismicity rate, the seismicity in the LoSAR catalog exhibit multiple clusters trending orthogonally to the main faults ruptured during the $2019\\mathbf{M}_{\\mathrm{w}}7.1$ earthquake, aligning with the focal mechanisms of $\\mathbf M\\textgreater2$ events within those clusters (Figure S18). Additionally, these orthogonal clusters appear to be further activated following the mainshock, since they collocate with the aftershocks and mapped surface traces (Figure 7c). The above observations suggest that multiple subparallel faults extend to the SE of the $2019\\mathbf{M}_{\\mathrm{w}}6.4$ foreshock, an area where previously few fault traces had been mapped. The net effect of such a fault system is a distributed shear deformation and a low slip rate on each individual fault, which agree with the weak seismic activity observed in this region.  _en_zh_google": "从地震之前的事件分布(图7a-b)，很明显，沿着山脊的断层超过20公里的区域的特征是传播微作用。与重新定位的SCSN目录和QTM目录相比，在我们的Losar目录中观察到了这种模式(图S17)。尽管南部细分市场的地震速率较低，但Losar目录中的地震性表现出多个群集的趋势在__$2019\\mathbf{M}_{\\mathrm{w}}7.1$地震期间与主要断层破裂的趋势趋于趋势，与这些群集中的$\\mathbf M\\textgreater2$事件的焦点机制保持一致。此外，这些正交簇在主震后似乎进一步激活，因为它们与余震和映射的表面痕迹(图7C)。上述观察结果表明，多个次平行断层扩展到$2019\\mathbf{M}_{\\mathrm{w}}6.4$ forhock的SE，该区域以前绘制了很少的故障迹线。这种断层系统的净效应是分布式剪切变形和每个单个断层的较低滑动速率，这与该区域中观察到的弱地震活性一致。",
  "By examining the seismicity depth distribution in the cross sections (Figure 7), we find a similar pattern of depth contour before and after the 2019 mainshocks, despite contrasting intensities of seismic activity, both complementing the coseismic slip. Furthermore, the b-value mapping results reveal that the areas of weak seismicity in the southern segments correspond to notably low b-values (Figure 8), indicating a high level of differential stress. Collectively, these findings suggest that the southern segments were strongly locked prior to the earthquake, and can be considered as a persistent asperity primed for rupture. It is noteworthy that the northern segments, responsible for the $\\mathbf{M}_{\\mathrm{w}}\\mathbf{\\nabla}7.1$ mainshock ruptures, are of relatively high b-value (Figure 8). This can be interpreted by the stress shadow effect caused by several $\\mathbf{M}{>}5$ events during the 1990s on its western subparallel faults. Nanjo (2020) identified a similar contrasting pattern in preseismic b-value distribution using an extensive dataset from over 40-yr SCSN catalog, a pattern not discernible with merely ${\\sim}11$ years of data, as shown in Figure 8a. This contrast in preseismic b-value near the foreshock and mainshock hypocenters provides insight into the sequential occurrence of the $\\mathbf{M}_{\\mathrm{w}}6.4$ foreshock before the larger $\\mathbf{M}_{\\mathrm{w}}7.1$ mainshock.  _en_zh_google": "通过检查横截面中的地震性深度分布(图7)，我们发现了2019年主震前和之后的深度轮廓模式，尽管地震活性的强度对比了，这两者都补充了coseis震动。此外，B值映射结果表明，南部段中的地震性弱区域对应于较低的B值(图8)，表明较高的差异应力水平。总的来说，这些发现表明，南部段在地震前被强烈锁定，可以被视为持续的垂体，以破裂。值得注意的是，负责$\\mathbf{M}_{\\mathrm{w}}\\mathbf{\\nabla}7.1$主余的北部部分的B值相对较高(图8)。这可以通过1990年代在其西部平行断层的几个_$\\mathbf{M}{>}5$事件引起的应力阴影效应来解释。 Nanjo(2020)使用来自40多个SCSN目录的广泛数据集确定了PRESEISIC B-VALUE分布中的类似对比模式，如图8a所示，仅与__ All_math_2__年的数据相差仅__ All_math_2__年。在前锁和主震置次数附近的Preseismic B值中的这种对比提供了对$\\mathbf{M}_{\\mathrm{w}}6.4$前进的顺序出现之前的洞察力，然后在较大的__$\\mathbf{M}_{\\mathrm{w}}7.1$ MAINSHOCK之前进行了预测。",
  "In summary, the distributed microseismicity prior to the mainshock unveils a preexisting fault system composed of multiple subparallel branches. This system, characterized by a weak seismicity and an overall low b-value, represents a persistent asperity of potential hazard.  _en_zh_google": "总而言之，在主震中之前的分布式微作用性揭示了由多个次平行分支组成的先前存在的断层系统。该系统的特征是地震性弱和总体低价值，代表了潜在危害的持续性。",
  "![](images/995178ab032d8435b4d485df11a0c01fd701b35a2a99c8630bee423684a56d96.jpg)  _en_zh_google": "![](images/995178ab032d8435b4d485df11a0c01fd701b35a2a99c8630bee423684a56d96.jpg)",
  "Figure 7. Seismicity on the Ridgecrest faulting area before and after the 2019 earthquakes. (a-b) plot the preseismic period of relocated SCSN catalog (Hauksson et al., 2012) and LoSAR catalog in this study, respectively, and (c) for the LoSAR catalog aftershock period. Note that the dot size and transparency for the preseismic (a-b) and aftershock (c) period are set differently, because of the very different seismicity rate. In the map view plots (upper panels), the seismicity is plotted as dots that have its color denoting the depth and size varies with the magnitude. The active faults are plotted as black lines; the surface ruptures are marked by white lines. The reference points and spatial coverage of the along-fault cross-section is marked by blue dashed rectangle. The hollow black stars denote the largest foreshock and the mainshock of the 2019 Ridgecrest sequence. In the cross-sections (lower panels), the rupture model by Yue et al. (2021) is plotted as different shades of red. The Garlock Fault (GF) on the surface and seismicity-interpreted depth extension is marked by red lines. The black lines are the imaged cross faults by seismicity.  _en_zh_google": "图7。2019年地震之前和之后的Ridgecrest断层区域的地震性。 (A-B)在本研究中分别绘制了重新定位的SCSN目录(Hauksson等，2012)和Losar目录的preseismis，在Losar目录余震时期和(c)。请注意，由于地震速率的截然不同，请持不同的震颤(A-B)和余震(C)期的点大小和透明度设置不同。在地图视图图(上图)中，将地震性绘制为具有其颜色的点，表示深度和尺寸随幅度而变化。主动缺陷被绘制为黑线。表面破裂以白线标记。沿蓝色虚线矩形标记的及其横截面的参考点和空间覆盖范围。空心的黑色星星表示2019年Ridgecrest序列的最大预壳和主震动。在横截面(下图)中，Yue等人的破裂模型。 (2021)将其绘制为不同的红色阴影。表面上的Garlock断层(GF)和地震性解释深度延伸以红线为标志。黑线是通过地震性成像的交叉断层。",
  "![](images/e59f824956e0b7b3a38d3e15a0fe509318859179105648953b93e0915e74bb73.jpg)  \nFigure 8. Comparison of b-value mapping results for the RC-Coso region during preseismic period  _en_zh_google": "![](images/e59f824956e0b7b3a38d3e15a0fe509318859179105648953b93e0915e74bb73.jpg)  \n图8。在Preseismic时期，RC-COSO区域的B值映射结果的比较",
  "with different seismic catalogs. (a-c) plot the b-value mapping results with the relocated SCSN catalog (Hauksson et al., 2012), the QTM catalog (Ross et al., 2019b), and the LoSAR catalog in this study, respectively. The active faults and surface ruptures are plotted by gray and black lines, respectively. The M>5 earthquakes after 1946 are marked by yellow stars. The area of Coso Geothermal Field (CGF) is marked by red circle in the map view and by horizontal line in the cross section. The coseismic slip by Yue et al. (2021) is plotted as black contours in the cross section. Annotations in the map view include: ${\\bf R}_{\\mathrm{slice}}$ ,  _en_zh_google": "具有不同的地震目录。 (A-C)绘制B值映射的结果，分别与重新定位的SCSN目录(Hauksson等，2012)，QTM目录(Ross等，2019b)和Losar目录中的QTM目录。主动断层和表面破裂分别由灰色和黑线绘制。 1946年以后的M> 5地震以黄星为特征。 COSO地热场(CGF)的面积在地图视图中以红色圆和横截面中的水平线标记。 Yue等人的Coseissic滑动。 (2021)在横截面中绘制为黑色轮廓。地图视图中的注释包括：${\\bf R}_{\\mathrm{slice}}$，",
  "749   \n750   \n751   \n752   \n753   \n754   \n755   \n756   \n757   \n758   \n759   \n760   \n761   \n762   \n763   \n764   \n765   \n766   \n767   \n768   \n769   \n770   \n771   \n772   \n773   \n774   \n775   \n776   \n777   \n778  _en_zh_google": "749   \n750   \n751   \n752   \n753   \n754   \n755   \n756   \n757   \n758   \n759   \n760   \n761   \n762   \n763   \n764   \n765   \n766   \n767   \n768   \n769   \n770   \n771   \n772   \n773   \n774   \n775   \n776   \n777   \n778",
  "the slicing radius for each grid in b-value calculation; $\\mathrm{{N_{min}}}$ , the minimum number of events above the complete magnitude to calculate b-value; $\\mathbf{M}_{\\mathrm{C}}$ , the magnitude of completeness.  _en_zh_google": "B值计算中每个网格的切片半径； $\\mathrm{{N_{min}}}$，最小事件数量高于完整幅度的计算B值； $\\mathbf{M}_{\\mathrm{C}}$，完整的大小。",
  "# 4.2 Erkenek-Pütürge fault segment (EPF) of EAFZ  _en_zh_google": "# 4.2 EAFZ的Erkenek-Pütürge故障细分市场(EPF)",
  "As reviewed in Section 3.2.1, the 2023 Turkey doublet is extraordinarily large for continental environments, raising questions about the mechanisms that allow an earthquake to reach such size. Instead of investigating how the rupture grows, we are curious about how it terminates. Specifically, we explore the termination of the M1 rupture at its NE end, named as Erkenek-Pütürge fault segment (EPF), which acted as a barrier not only for $M I$ , but also for the $2020\\mathrm{M}_{\\mathrm{w}}6.8$ earthquake and multiple historical and paleoseismic events (Hubert-Ferrari et al., 2020; Güvercin et al., 2022; Karabacak et al., 2023). Fortunately, the observational condition for this segment of the EAFZ were optimal during our study period from 2020 to 2023, which set a solid foundation to examine the formation of this persistent barrier.  _en_zh_google": "如第3.2.1节所述，对于大陆环境，2023年土耳其双线非常大，引发了有关使地震达到这样大小的机制的问题。我们对破裂的增长方式没有调查，我们对它的终止方式感到好奇。具体而言，我们探索了M1破裂在其结束时的终止，称为Erkenek-Pütürge断层部分(EPF)，它不仅是$M I$，而且对__All_Math_Math_1__1_________________________________________________________________________________________________________________ER和多种历史和古seas虫事件(Hubert-Ferrari-ferrari and an and 2020; g。 Karabacak等，2023)。幸运的是，在2020年至2023年我们的研究期间，EAFZ这一部分的观察条件是最佳的，这为检查这种持续性障碍的形成奠定了坚实的基础。",
  "Firstly, we utilize all seismicity from 2020-2023 to image the fault structure (Figure 9). The map view (Figure 9a-b) and cross-sections (Figure 9c) reveal an along-strike variation in fault structure: from a single major fault in profile 01-04, to a major-secondary fault style in profile 05- 10, and then to a wide fault zone from profile 11-15, and reverts to the major-secondary pattern in profile 16-18. A zoom-in plot with CC-relocated LoSAR catalog (Figure 10c) show that the ${\\sim}10.$ - km wide fault zone (profile 11-15) is composed of two major subparallel branches, along with several subsidiary conjugate faults in between. Intriguingly, the surface fault traces in this area also exhibit two subparallel branches with shapes similar to the seismicity observed at depth, but of a much narrower width (Figure 10c). This may imply that the fault zone broadens as it extends deeper into the crust, a scenario not commonly observed (Scholz, 1988; Ben-Zion and Sammis, 2003; Scholz, 2019). In addition to the aforementioned structural variation is a shift in the dip angle of the major fault, which gradually change from an SSE-dipping in profile 01-04 to an NNWdipping in profile 17-18 (Figure 9c). This contrast in fault dip direction of the EPF is also reflected in the moment tensors of the 2023 M1 (subevent inversion by Jia et al., 2023) and the $2020\\mathrm{M_{w}}$ 6.8 & Mw 5.6 (Figure 9b). These structural variations appear to correlate with the coseismic behavior, with the unruptured segments (profile 08-14) show greater geometrical complexity, in contrast to the relatively simpler structures that were ruptured in 2023 (profile 01-07) and 2020 (profile 15-18).  _en_zh_google": "首先，我们利用2020- 2023年的所有地震性来对故障结构进行图像(图9)。地图视图(图9a-b)和横截面(图9C)揭示了故障结构的沿形变化：从配置文件01-04的单个主要故障到轮廓05-10中的主要隔板样式，然后从配置文件11-15到宽断层区域，再到档案中的主要模式，再到档案中的主要段落模式16-18。带有CC的Losar目录的缩放图(图10C)表明$\\sim 10.$- km宽断层区(配置文件11-15)由两个主要的次平行分支组成，以及几个介于两者之间的子公司共轭断层。有趣的是，该区域的表面断层迹线还表现出两个次平行的分支，其形状与深度下观察到的地震性相似，但宽度较窄(图10C)。这可能意味着断层区域扩大到更深的地壳，这种情况不常见(Scholz，1988; Ben-Zion and Sammis，2003; Scholz，2019)。除了上述结构变化外，主要断层的倾角倾角的变化是从轮廓01-04中的SSE倾斜变为轮廓17-18中的nnwdipping(图9C)。 EPF的断层倾斜方向的这种对比度也反映在2023 M1的矩张仪(Jia等人，2023年的亚事件反转)和_$2020\\mathrm{M_{w}}$ 6.8＆MW 5.6(图9B)。这些结构变化似乎与coseissic行为相关，与2023年破裂(配置文件01-07)和2020年(配置文件15-18)相比，相对较简单的结构相比，未破坏的段(轮廓08-14)显示出更大的几何复杂性。",
  "![](images/46b017e0ff9cff67c2e9ba105ea3392c966cf996cfeaa1b9ac2ac2355bf73bec.jpg)  \nFigure 9. Seismicity and fault geometry interpretation for the Erkenek-Pütürge fault segment (EPF) of EAFZ. (a-b) plot the map-view distribution of postseismic (2023/02-04) and preseismic period (2020- 2023/01) seismicity. The events in current panel / time period are color coded by the depth, and the seismicity in the other time period is plotted as white dots in the bottom. (c) plot the fault-normal crosssections. The 2023 aftershocks and preseismic events are denoted in blue and green, respectively. The interpreted fault dip is marked as black lines. (d) plot the along-strike cross-section. The coseismic slip of  _en_zh_google": "![](images/46b017e0ff9cff67c2e9ba105ea3392c966cf996cfeaa1b9ac2ac2355bf73bec.jpg)  \n图9。 (A-B)绘制地震后(2023/02-04)和preseismic时期(2020-2023/01)地震的地图图分布。当前面板 /时间周期中的事件是按深度编码的，而其他时间段的地震性则绘制为底部的白点。 (c)绘制断层正常横截面。 2023年的余震和狂热事件分别用蓝色和绿色表示。解释的故障倾角被标记为黑线。 (d)绘制沿形状的横截面。 coseis震",
  "786   \n787   \n788   \n789   \n790   \n791   \n792   \n793   \n794   \n795   \n796   \n797   \n798   \n799   \n800   \n801   \n802   \n803   \n804   \n805   \n806   \n807   \n808   \n809   \n810   \n811   \n812   \n813   \n814   \n815  _en_zh_google": "786   \n787   \n788   \n789   \n790   \n791   \n792   \n793   \n794   \n795   \n796   \n797   \n798   \n799   \n800   \n801   \n802   \n803   \n804   \n805   \n806   \n807   \n808   \n809   \n810   \n811   \n812   \n813   \n814   \n815",
  "the $2023\\:\\mathbf{M}_{\\mathrm{w}}\\:7.8$ obtained by Ren et al. (2024) is plotted in orange-red contours, the coseismic slip and afterslip slip of the $2020\\mathrm{M}_{\\mathrm{w}}6.8$ obtained by Cakir et al. (2023) are plotted as orange and black contours, respectively.  _en_zh_google": "Ren等人获得的$2023\\:\\mathbf{M}_{\\mathrm{w}}\\:7.8$。 (2024)用橙红色的轮廓绘制，Cakir等人获得的$2020\\mathrm{M}_{\\mathrm{w}}6.8$的coseis震滑和置后滑动。 (2023)分别绘制为橙色和黑色轮廓。",
  "We further examine the b-value distribution before the 2023 mainshocks (Figure 10a-b). Note that we exclude events occurring within 24-hr following the $2020\\:\\mathbf{M}_{\\mathrm{w}}\\:6.8$ , since it causes a transient incompleteness in the catalog that can bias the b-value estimation (Figure S27). However, we tested that using different time ranges do not alter the relative values in the distribution (Figure S30). The b-value distributions, derived from both the LoSAR catalog and that by Lomax (2023), reveal that the 2020-ruptured area is characterized by a relatively high b-value, which agree with the significant stress drop after the large earthquake. Notably, this segment also exhibits a gap of $\\mathbf{M}{>}4$ earthquakes in our study period (Figure 10d), further supporting a significantly reduced stress level. Another area of high b-value coincide with the area experiencing large afterslip following the 2020 mainshock (Cakir et al., 2023). In the map-view distribution (Figure 10a-b), the secondary faults show relatively higher b-value compared to those observed along the major fault, which suggest a contrast in the strength between major and secondary faults. The area near the NE end of the 2023 ruptures also appear to have a high b-value before the earthquake (Figure 10a). This area also displays highly variable focal mechanisms, indicating complex local structures. However, the reliability of this feature may be compromised due to the significantly fewer events that occurred before the 2023 mainshock. In addition to the high-b areas mentioned above, a markedly low-b area extends over $15~\\mathrm{km}$ length along strike, located southwest of the $2020\\mathrm{M_{w}}$ 5.6 aftershock (Figure 10a-b). This area probably represents an unruptured asperity that has not experienced any $\\mathbf{M}{>}5.5$ earthquakes so far. Observations of postseismic deformation following the 2023 sequence may help to rule out the alternative hypothesis that the stress in this segment has been relieved through aseismic slips.  _en_zh_google": "我们进一步检查了2023个主震之前的B值分布(图10A-B)。请注意，我们排除$2020\\:\\mathbf{M}_{\\mathrm{w}}\\:6.8$之后24小时内发生的事件，因为它会导致目录中的瞬态不完整，从而偏向B值估计(图S27)。但是，我们测试了使用不同的时间范围不会改变分布中的相对值(图S30)。 B值分布均来自Losar目录和Lomax(2023)，表明2020年破裂的区域的特征是相对较高的B值，这与大地震后的明显应力下降一致。值得注意的是，在我们的研究期间(图10D)，该部分还表现出_$\\mathbf{M}{>}4$地震的差距，进一步支持应力水平。高B值的另一个区域与2020年主震后经历大的后滑状区域一致(Cakir等，2023)。在地图视图分布(图10A-B)中，与沿主要断层观察到的那些相比，次要断层显示出相对较高的B值，这表明主要断层和次要断层之间的强度有对比。 2023年破裂的NE末端附近的区域在地震前似乎也具有高B值(图10A)。该区域还显示高度可变的焦点机制，表明局部结构复杂。但是，由于2023 Mainshock之前发生的事件明显较少，因此此功能的可靠性可能会受到损害。除了上述高B区域外，沿_____l_math_3__ 5.6余震的___ math_2__沿___ math_2__的长度明显延伸到$15~\\mathrm{km}$的长度(图10A-B)。到目前为止，该区域可能代表了一个未破坏的近端，尚未经历任何_____math_4__地震。在2023年序列之后的地震后变形的观察可能有助于排除替代假设，即该部分中的应力通过无性滑移缓解了。",
  "Back to the question posed in the beginning of this section, the high b-value observed in the northeastern part of the 2023 rupture could potentially decelerate the rupture process; whereas the presence of a significantly low-b area adjacent to it on the northeast starkly contrasts with the observation that the rupture terminated before reaching this region. Furthermore, given that fault stress is more variable than structural features over extended time scales, we posit that the geometrical complexity is the primary factor rendering the EPF a persistent rupture barrier.  _en_zh_google": "回到本节开头提出的问题，在2023年破裂的东北部观察到的高B值可能会减速破裂过程。而东北部在东北地区附近有明显的低B区域的存在与观察到到达该区域之前终止的观察到了鲜明的对比。此外，鉴于断层应力在延长的时间尺度上比结构特征更可变，因此我们认为几何复杂性是使EPF持续的破裂屏障的主要因素。",
  "![](images/dbba5f2afb8ced453a5e377f2226b77ba24ba258e436d7965e56a99e897bded3.jpg)  _en_zh_google": "![](images/dbba5f2afb8ced453a5e377f2226b77ba24ba258e436d7965e56a99e897bded3.jpg)",
  "Figure 10. B-value mapping and detailed fault structure interpretation of the EPF area. (a-b) Bvalue mapping results with the LoSAR catalog by this study and the relocated AFAD catalog by Lomax (2023) during the preseismic period. The active faults and 2023-ruptured faults are plotted by gray and orange-red lines, respectively. The $\\mathbf{M}{>}6$ earthquakes during 2020-2023 are marked by yellow stars. The contours share the same meaning with Figure 9d. The red box marks the spatial coverage of (c) & (d). (cd) provide a zoom-in plot for part of the EPF. (c) plot the distribution of CC-relocated LoSAR catalog. The 2023 aftershocks and preseismic events are denoted by blue and red dots, respectively. The white solid and dashed lines show interpreted faults with clear seismicity delineation (high confidential) and those with rather scattered seismicity (speculative), respectively. (d) plot the focal mechanism solutions of $\\mathbf{M}_{\\mathrm{w}}>4$ events during 2020-2023/04 from AFAD.  _en_zh_google": "图10。EPF区域的B值映射和详细的故障结构解释。 (A-B)这项研究的BVALUE映射导致Losar目录以及LOMAX(2023)在狂热时期搬迁的AFAD目录。主动断层和2023年破裂的断层分别由灰色和橙红线绘制。 2020-2023期间的$\\mathbf{M}{>}6$地震标记为黄星。轮廓与图9D共享相同的含义。红色框标记(c)和(d)的空间覆盖范围。 (CD)为EPF的一部分提供了缩放图。 (c)绘制CC链接的Losar目录的分布。 2023年的余震和抗震颤事件分别用蓝色和红点表示。白色的固体和虚线分别显示出明确的地震性描述(高度机密)和具有相当分散的地震性(投机性)的解释断层。 (d)在2020-2023/04中绘制_$\\mathbf{M}_{\\mathrm{w}}>4$的焦点机理解决方案。",
  "# 5. Conclusions  _en_zh_google": "# 5。结论",
  "In this study, we introduce LoSAR, an innovative deep learning-driven workflow for constructing long-term seismic catalogs. It is designed based on the idea of training a deep learning model with local data. By applying LoSAR to two distinct cases in the Ridgecrest-Coso and EAFZ region, we demonstrated that LoSAR realizes a detection ability comparable to MFT, while offering markedly improved temporal stability and computational efficiency. Through direct comparisons with other state-of-the-art phase picking and association algorithms, we conclude that LoSAR has superior scalability and generalizability. These advantages position LoSAR as an ideal tool for building catalogs of a large spatiotemporal scale.  _en_zh_google": "在这项研究中，我们介绍了Losar，这是一种创新的深度学习驱动的工作流程，用于构建长期地震目录。它的设计基于培训与本地数据的深度学习模型的想法。通过将Losar应用于Ridgecrest-Coso和EAFZ地区的两个不同的情况，我们证明了Losar实现了与MFT相当的检测能力，同时提供了显着提高的时间稳定性和计算效率。通过与其他最先进的相拾取和关联算法的直接比较，我们得出结论，Losar具有较高的可伸缩性和可推广性。这些优势将Losar定位为构建大型时空尺度目录的理想工具。",
  "Utilizing the high-resolution long-term catalogs built for the Ridgecrest-Coso and EAFZ region, we delve into their preseismic fault behaviors by jointly analyzing the seismicity distribution and the b-value mapping. We specifically investigate one smaller fault segment of the two regions, and reached the following conclusions:  _en_zh_google": "利用为Ridgecrest-Coso和EAFZ区域构建的高分辨率长期目录，我们通过共同分析地震性分布和B值映射来深入研究他们的抗震动断层行为。我们特别研究了两个区域的一个较小的断层段，并得出以下结论：",
  "(1) The Ridgecrest faults exhibited distributed and weak microseismicity prior to the earthquake, revealing multiple preexisting orthogonal faults. The seismicity depth contour mimics that of the aftershocks, and is associated with a low b-value prior to the earthquake. These observations constitute the Ridgecrest faults a persistent asperity of high stress level.  _en_zh_google": "(1)Ridgecrest断层在地震之前表现出分布和弱微作用性，揭示了多个已存在的正交断层。地震深度模拟余震的震动深度，并在地震之前与低B值相关。这些观察结果构成了Ridgecrest的断层，这是高应力水平的持续性纵横。",
  "(2) The EPF segment of EAFZ is characterized by complex fault structures, including multiple secondary fault of high b-value, and a conjugate fault system that makes a ${\\sim}10{\\mathrm{-km}}$ wide fault zone. Despite the overall high b-value, a $>15\\mathrm{-km}$ -long segment with a notably low b-value adjacent to the 2023 rupture points to geometrical complexity as the reason EPF acts as a persistent barrier for rupture propagations.  _en_zh_google": "(2)EAFZ的EPF段的特征是复杂的故障结构，包括高B值的多个次要故障，以及一个使$\\sim 10{\\mathrm{-km}}$宽断层区域的共轭故障系统。尽管总体较高的B值，但_$>15\\mathrm{-km}$-长段，较低的B值与2023年破裂相邻的b值表现为几何复杂性，因为EPF的原因是破裂繁殖的持续性障碍。",
  "# Acknowledgments  _en_zh_google": "# 致谢",
  "We thank Prof. Ziyadin Cakir for sharing the rupture model and afterslip model for the 2020 Elaziğ (Turkey) earthquake. This work is jointly supported by the National Key R&D Program (grant no. 2022YFF0800601) and the University of California, Riverside.  _en_zh_google": "我们感谢Ziyadin Cakir教授分享了2020Elaziğ(土耳其)地震的破裂模型和后滑状模型。这项工作得到了国家密钥研发计划(GrantNo。2022YFF0800601)和加利福尼亚大学河滨分校的共同支持。",
  "# Open Research  _en_zh_google": "# 开放研究",
  "Figures in this paper are plotted with GMT and Matplotlib. The continuous seismic data for Ridgecrest-Coso (2008-2019), the waveform-relocated SCSN catalog, the QTM catalog, and the refined focal mechanism solutions by Cheng et al. (2023) are downloaded from the Southern California Seismic Network (SCSN, https://dx.doi.org/10.7909/C3WD3xH1). The continuous data for the East Anatolian Fault Zone (EAFZ, 2020-2023/04) is collected through multiple sources: (1) TU network, from the Disaster and Emergency Management Presidency (AFAD, https://tdvms.afad.gov.tr/continuous_data), downloaded manually, (2) KO network and Kandilli Observatory And Earthquake Research Institute (KOERI), downloaded with Obspy, and (3) GE, CQ, and IM network, all available through Obspy. The relocated AFAD catalog by Lomax (2023) is available at https://doi.org/10.5281/zenodo.8089273. The focal mechanism solutions for $\\mathbf{M}_{\\mathrm{w}}>4$ events (2020-2023) are also available at AFAD. The active faults data of the Ridgecrest-Coso region is available at United States Geological Survey (USGS, https://www.usgs.gov/programs/earthquake-hazards/faults); that for East Anatolian Fault Zone comes from the GEM Global Active Faults Database (Styron and Pagani, 2020), and we adopt a more detailed fault data for the EPF area from the Active Faults of Eurasia Database (AFEAD, Zelenin et al., 2022). The surface rupture data of the 2019 Ridgecrest earthquake comes from Ponti et al. (2020); the fault traces of the 2023 Turkey sequence is available by USGS (https://doi.org/10.5066/P985I7U2, last accessed $16^{\\mathrm{th}}\\mathrm{Mar})$ . The coseismic slip model of the 2019 Ridgecrest earthquake comes from Yue et al. (2021); that for the 2023 Turkey earthquake comes from Ren et al. (2024); the rupture model and afterslip model for the 2020 Elaziğ (Turkey) earthquake comes from Cakir et al. (2023) through personal communication. The referred velocity models for the RC-Coso region include: CVM-S4 velocity model (available at manuscript submitted to Journal of Geophysical Research: Solid Earth  _en_zh_google": "本文中的数字用GMT和Matplotlib绘制。 Cheng等人的Ridgecrest-Coso(2008-2019)的连续地震数据，波形启示的SCSN目录，QTM目录和精制的焦点机理解决方案。 (2023)从南加州地震网络(SCSN，https://dx.doi.org/10.7909/c3wd3xh1)下载。东阿纳托利亚断层区(EAFZ，2020-2023/04)的连续数据是通过多个来源收集的：(1)TU网络，来自灾难和紧急管理总统(afad，https：//tdvms.afad.gov.gov.gov.gov.gov.tr/continuul_data)通过obspy和(3)GE，CQ和IM网络下载，所有这些都可以通过obspy获得。 Lomax(2023)搬迁的AFAD目录可在https://doi.org/10.5281/zenodo.8089273上获得。 AFAD还提供了$\\mathbf{M}_{\\mathrm{w}}>4$事件的焦点机制解决方案(2020-2023)。 Ridgecrest-Coso地区的主动故障数据可在美国地质调查局(USGS，https://www.usgs.gov/programs/earthquake-hazards/faults)上获得；对于东阿纳托利亚断层区而言，该区域来自GEM全球活动故障数据库(Styron和Pagani，2020年)，我们从Eurasia Database的活动故障(Afead，Zelenin等，2022年)为EPF区域采用了更详细的故障数据。 2019年Ridgecrest地震的表面破裂数据来自Ponti等。 (2020); USGS可获得2023年土耳其序列的断层痕迹(https://doi.org/10.5066/p985i7u2，上一次访问$16^{\\mathrm{th}}\\mathrm{Mar})$。2019年Ridgecrest Eartquake的Coseis震动模型来自Yue等人(20211)。 Cakir等人(2023年)通过个人通信的破裂模型(土耳其)地震。",
  "876 https://strike.scec.org/scecpedia/CVM-S4, last accessed 2024/03), Hutton et al. (2010) for the   \n877 whole Southern California, and Shelly (2020) for the Ridgecrest source region. The referred   \n878 velocity models for the EAFZ include that from Güvercin et al. (2022), Acarel et al. (2019), and   \n879 Ding et al. (2023). The LoSAR workflow is open sourced at Github:   \n880 https://github.com/YijianZhou/LoSAR/releases/tag/v4.3   \n881 (https://doi.org/10.5281/zenodo.10895585).  _en_zh_google": "876 https://strike.scec.org/scecpedia/cvm-s4，上次访问2024/03)，Hutton等。 (2010年)   \n877整个南加州和雪莉(2020年)，用于Ridgecrest源地区。引用   \n878 EAFZ的速度模型包括Güvercin等人的速度模型。 (2022)，Acarel等。 (2019年)和   \n879 Ding等。 (2023)。 Losar工作流程在GitHub开源：   \n880 https://github.com/yijianzhou/losar/releases/tag/v4.3   \n881(https://doi.org/10.5281/zenodo.10895585)。",
  "# 883 References  _en_zh_google": "# 883参考",
  "884 Acarel, D., M. D. Cambaz, F. Turhan, A. K. Mutlu, and R. Polat (2019). Seismotectonics of   \n885 Malatya Fault, Eastern Turkey, Open Geosciences, 11(1), 1098-1111,   \n886 doi:doi:10.1515/geo-2019-0085.   \n887 Aki, K. (1965). Maximum likelihood estimate of b in the formula log $\\Nu=$ a-bM and its confidence   \n888 limits, Bull. Earthq. Res. Inst., Tokyo Univ., 43, 237-239.   \n889 Aktug, B., H. Ozener, A. Dogru, A. Sabuncu, B. Turgut, K. Halicioglu, O. Yilmaz, and E. Havazli   \n890 (2016). Slip rates and seismic potential on the East Anatolian Fault System using an   \n891 improved GPS velocity field, Journal of Geodynamics, 94-95, 1-12,   \n892 doi:https://doi.org/10.1016/j.jog.2016.01.001.   \n893 Amorèse, D., J.-R. Grasso, and P. A. Rydelek (2010). On varying b-values with depth: results from   \n894 computer-intensive tests for Southern California, Geophysical Journal International,   \n895 180(1), 347-360, doi:10.1111/j.1365-246X.2009.04414.x.   \n896 Bahdanau, D., K. Cho, and Y. Bengio (2014). Neural machine translation by jointly learning to   \n897 align and translate, arXiv preprint arXiv:1409.0473.   \n898 Barbot, S., and J. R. Weiss (2021). Connecting subduction, extension and shear localization across   \n899 the Aegean Sea and Anatolia, Geophysical Journal International, 226(1), 422-445,   \n900 doi:10.1093/gji/ggab078.   \n901 Ben-Zion, Y., and C. G. Sammis (2003). Characterization of Fault Zones, pure and applied   \n902 geophysics, 160(3), 677-715, doi:10.1007/PL00012554.   \n903 Bletery, Q., O. Cavalié, J.-M. Nocquet, and T. Ragon (2020). Distribution of Interseismic Coupling   \n904 Along the North and East Anatolian Faults Inferred From InSAR and GPS Data,   \n905 Geophysical Research Letters, 47(16), e2020GL087775,   \n906 doi:https://doi.org/10.1029/2020GL087775.   \n907 Bornstein, T., D. Lange, J. Münchmeyer, J. Woollam, A. Rietbrock, G. Barcheck, I. Grevemeyer,   \n908 and F. Tilmann (2024). PickBlue: Seismic Phase Picking for Ocean Bottom Seismometers   \n909 With Deep Learning, Earth and Space Science, 11(1), e2023EA003332,   \n910 doi:https://doi.org/10.1029/2023EA003332.   \n911 Bulut, F., M. Bohnhoff, T. Eken, C. Janssen, T. Kılıç, and G. Dresen (2012). The East Anatolian   \n912 Fault Zone: Seismotectonic setting and spatiotemporal characteristics of seismicity based   \n913 on precise earthquake locations, Journal of Geophysical Research: Solid Earth, 117(B7),   \n914 doi:https://doi.org/10.1029/2011JB008966.   \n915 Bürgmann, R. (2018). The geophysics, geology and mechanics of slow fault slip, Earth and   \n916 Planetary Science Letters, 495, 112-134, doi:https://doi.org/10.1016/j.epsl.2018.04.062.   \n917 Cakir, Z., et al. (2023). Arrest of the Mw 6.8 January 24, 2020 Elaziğ (Turkey) earthquake by   \n918 shallow fault creep, Earth and Planetary Science Letters, 608, 118085,   \n919 doi:https://doi.org/10.1016/j.epsl.2023.118085.   \n920 Cao, A., and S. S. Gao (2002). Temporal variation of seismic b-values beneath northeastern Japan   \n921 island arc, Geophysical Research Letters, 29(9), 48-41-48-43, doi:10.1029/2001gl013775.   \n922   \n923 Cavalié, O., and S. Jónsson (2014). Block-like plate movements in eastern Anatolia observed by   \n924 InSAR, Geophysical Research Letters, 41(1), 26-31,   \n925 doi:https://doi.org/10.1002/2013GL058170.   \n926 Chai, C., M. Maceira, H. J. Santos-Villalobos, S. V. Venkatakrishnan, M. Schoenball, W. Zhu, G.   \n927 C. Beroza, C. Thurber, and E. C. Team (2020). Using a Deep Neural Network and Transfer   \n928 Learning to Bridge Scales for Seismic Phase Picking, Geophysical Research Letters,   \n929 47(16), e2020GL088651, doi:https://doi.org/10.1029/2020GL088651.   \n930 Chamberlain, C. J., W. B. Frank, F. Lanza, J. Townend, and E. Warren-Smith (2021). Illuminating   \n931 the Pre-, Co-, and Post-Seismic Phases of the 2016 M7.8 Kaikōura Earthquake With   \n932 10 Years of Seismicity, Journal of Geophysical Research: Solid Earth, 126(8),   \n933 e2021JB022304, doi:https://doi.org/10.1029/2021JB022304.   \n934 Chen, K., J.-P. Avouac, S. Aati, C. Milliner, F. Zheng, and C. Shi (2020). Cascading and pulse  \n935 like ruptures during the 2019 Ridgecrest earthquakes in the Eastern California Shear Zone,   \n936 Nature Communications, 11(1), 22, doi:10.1038/s41467-019-13750-w.   \n937 Cheng, Y., E. Hauksson, and Y. Ben-Zion (2023). Refined Earthquake Focal Mechanism Catalog   \n938 for Southern California Derived With Deep Learning Algorithms, Journal of Geophysical   \n939 Research: Solid Earth, 128(2), e2022JB025975,   \n940 doi:https://doi.org/10.1029/2022JB025975.   \n941 Cho, K., B. van Merrienboer, C. Gulcehre, D. Bahdanau, F. Bougares, H. Schwenk, and Y. Bengio   \n942 (2014). Learning Phrase Representations using RNN Encoder-Decoder for Statistical   \n943 Machine Translation, arXiv e-prints, arXiv:1406.1078.   \n944 Dal Zilio, L., and J.-P. Ampuero (2023). Earthquake doublet in Turkey and Syria, Communications   \n945 Earth & Environment, 4(1), 71, doi:10.1038/s43247-023-00747-z.   \n946 Ding, H., Y. Zhou, Z. Ge, T. Taymaz, A. Ghosh, H. Xu, T. S. Irmak, and X. Song (2023). High  \n947 resolution seismicity imaging and early aftershock migration of the 2023 Kahramanmaraş   \n948 (SE Türkiye) <i>M</i><sub>W</sub>7.9 &amp; 7.8 earthquake doublet, Earthquake   \n949 Science, 36, 1-16, doi:10.1016/j.eqs.2023.06.002.   \n950 Ezen-Can, A. (2020). A Comparison of LSTM and BERT for Small Corpus, arXiv preprint   \n951 arXiv:2009.05451.   \n952 Feng, T., S. Mohanna, and L. Meng (2022). EdgePhase: A Deep Learning Model for Multi-Station   \n953 Seismic Phase Picking, Geochemistry, Geophysics, Geosystems, 23(11), e2022GC010453,   \n954 doi:https://doi.org/10.1029/2022GC010453.   \n955 Gallovič, F., J. Zahradník, V. Plicka, E. Sokos, C. Evangelidis, I. Fountoulakis, and F. Turhan   \n956 (2020). Complex rupture dynamics on an immature fault during the 2020 Mw 6.8 Elazığ   \n957 earthquake, Turkey, Communications Earth & Environment, 1(1), 40, doi:10.1038/s43247-   \n958 020-00038-x.   \n959 Ganev, P. N., J. F. Dolan, S. F. McGill, and K. L. Frankel (2012). Constancy of geologic slip rate   \n960 along the central Garlock fault: implications for strain accumulation and release in southern   \n961 California, Geophysical Journal International, 190(2), 745-760, doi:10.1111/j.1365-   \n962 246X.2012.05494.x.   \n963 Goldberg, D. E., D. Melgar, V. J. Sahakian, A. M. Thomas, X. Xu, B. W. Crowell, and J. Geng   \n964 (2020). Complex Rupture of an Immature Fault Zone: A Simultaneous Kinematic Model   \n965 of the 2019 Ridgecrest, CA Earthquakes, Geophysical Research Letters, 47(3),   \n966 e2019GL086382, doi:https://doi.org/10.1029/2019GL086382.   \n967 Gong, J., and W. Fan (2022). Seismicity, Fault Architecture, and Slip Mode of the Westernmost   \n968 Gofar Transform Fault, Journal of Geophysical Research: Solid Earth, 127(11),   \n969 e2022JB024918, doi:https://doi.org/10.1029/2022JB024918.   \n970 Graves, A., and N. Jaitly (2014). Towards End-To-End Speech Recognition with Recurrent Neural   \n971 Networks, in Proceedings of the 31st International Conference on Machine Learning,   \n972 edited by P. X. Eric and J. Tony, pp. 1764--1772, PMLR, Proceedings of Machine Learning   \n973 Research.   \n974 Gutenberg, B., and C. F. Richter (1944). Frequency of earthquakes in California, Bulletin of the   \n975 Seismological Society of America, 34(4), 185-188.   \n976 Güvercin, S. E., H. Karabulut, A. Ö. Konca, U. Doğan, and S. Ergintav (2022). Active   \n977 seismotectonics of the East Anatolian Fault, Geophysical Journal International, 230(1),   \n978 50-69, doi:10.1093/gji/ggac045.   \n979 Güvercin, S. E. (2024). 2023 Earthquake Doublet in Türkiye Reveals the Complexities of the East   \n980 Anatolian Fault Zone: Insights from Aftershock Patterns and Moment Tensor Solutions,   \n981 Seismological Research Letters, doi:10.1785/0220230317.   \n982 Hannun, A., C. Case, J. Casper, B. Catanzaro, G. Diamos, E. Elsen, R. Prenger, S. Satheesh, S.   \n983 Sengupta, and A. Coates (2014). Deep speech: Scaling up end-to-end speech recognition,   \n984 arXiv preprint arXiv:1412.5567.   \n985 Hatem, A. E., and J. F. Dolan (2018). A Model for the Initiation, Evolution, and Controls on   \n986 Seismic Behavior of the Garlock Fault, California, Geochemistry, Geophysics,   \n987 Geosystems, 19(7), 2166-2178, doi:https://doi.org/10.1029/2017GC007349.   \n988 Hauksson, E., W. Yang, and P. M. Shearer (2012). Waveform Relocated Earthquake Catalog for   \n989 Southern California (1981 to June 2011), Bulletin of the Seismological Society of America,   \n990 102(5), 2239-2244, doi:10.1785/0120120010.   \n991 Hauksson, E., and L. M. Jones (2020). Seismicity, Stress State, and Style of Faulting of the   \n992 Ridgecrest‐Coso Region from the 1930s to 2019: Seismotectonics of an Evolving Plate   \n993 Boundary Segment, Bulletin of the Seismological Society of America, 110(4), 1457-1473,   \n994 doi:10.1785/0120200051.   \n995 Herrmann, M., and W. Marzocchi (2020). Inconsistencies and Lurking Pitfalls in the Magnitude–   \n996 Frequency Distribution of High ‐ Resolution Earthquake Catalogs, Seismological   \n997 Research Letters, 92(2A), 909-922, doi:10.1785/0220200337.   \n998 Hsu, Y.-F., I. Zaliapin, and Y. Ben-Zion (2024). Informative Modes of Seismicity in Nearest  \n999 Neighbor Earthquake Proximities, Journal of Geophysical Research: Solid Earth, 129(3),   \n1000 e2023JB027826, doi:https://doi.org/10.1029/2023JB027826.   \n1001 Hubert-Ferrari, A., L. Lamair, S. Hage, S. Schmidt, M. N. Çağatay, and U. Avşar (2020). A 3800   \n1002 yr paleoseismic record (Lake Hazar sediments, eastern Turkey): Implications for the East   \n1003 Anatolian Fault seismic cycle, Earth and Planetary Science Letters, 538, 116152,   \n1004 doi:https://doi.org/10.1016/j.epsl.2020.116152.   \n1005 Hussain, E., S. Kalaycıoğlu, C. W. D. Milliner, and Z. Çakir (2023). Preconditioning the 2023   \n1006 Kahramanmaraş (Türkiye) earthquake disaster, Nature Reviews Earth & Environment,   \n1007 doi:10.1038/s43017-023-00411-2.   \n1008 Hutton, K., J. Woessner, and E. Hauksson (2010). Earthquake Monitoring in Southern California   \n1009 for Seventy-Seven Years (1932–2008), Bulletin of the Seismological Society of America,   \n1010 100(2), 423-446, doi:10.1785/0120090130.   \n1011 Im, K., J.-P. Avouac, E. R. Heimisson, and D. Elsworth (2021). Ridgecrest aftershocks at Coso   \n1012 suppressed by thermal destressing, Nature, 595(7865), 70-74, doi:10.1038/s41586-021-   \n1013 03601-4.   \n1014 Jia, Z., et al. (2023). The complex dynamics of the 2023 Kahramanmara&#x15f;, Turkey,   \n1015 <i>M</i><sub>w</sub> 7.8-7.7 earthquake doublet, Science, 381(6661), 985-990,   \n1016 doi:doi:10.1126/science.adi0685.   \n1017 Jiang, C., L. Fang, L. Fan, and B. Li (2021). Comparison of the earthquake detection abilities of   \n1018 PhaseNet and EQTransformer with the Yangbi and Maduo earthquakes, Earthquake   \n1019 Science, 34(5), 425-435, doi:10.29382/eqs-2021-0038.   \n1020 Jiang, J., and N. Lapusta (2016). Deeper penetration of large earthquakes on seismically quiescent   \n1021 faults, Science, 352(6291), 1293-1297, doi:doi:10.1126/science.aaf1496.   \n1022 Karabacak, V., et al. (2023). The 2023 Pazarcık (Kahramanmaraş, Türkiye) earthquake (Mw 7.7):   \n1023 implications for surface rupture dynamics along the East Anatolian Fault Zone, Journal of   \n1024 the Geological Society, 180(3), doi:10.1144/jgs2023-020.   \n1025 Kingma, D. P., and J. Ba (2014). Adam: A Method for Stochastic Optimization, arXiv e-prints,   \n1026 arXiv:1412.6980.   \n1027 Klein, F. W. (2002). User's guide to HYPOINVERSE-2000, a Fortran program to solve for   \n1028 earthquake locations and magnitudesRep. 2331-1258, US Geological Survey.   \n1029 Lay, T., and S. P. Nishenko (2022). Updated concepts of seismic gaps and asperities to assess great   \n1030 earthquake hazard along South America, Proceedings of the National Academy of Sciences,   \n1031 119(51), e2216843119, doi:doi:10.1073/pnas.2216843119.   \n1032 Lin, X., J. Hao, D. Wang, R. Chu, X. Zeng, J. Xie, B. Zhang, and Q. Bai (2020). Coseismic Slip   \n1033 Distribution of the 24 January 2020 Mw 6.7 Doganyol Earthquake and in Relation to the   \n1034 Foreshock and Aftershock Activities, Seismological Research Letters, 92(1), 127-139,   \n1035 doi:10.1785/0220200152.   \n1036 Lomax, A., and A. Savvaidis (2022). High-Precision Earthquake Location Using Source-Specific   \n1037 Station Terms and Inter-Event Waveform Similarity, Journal of Geophysical Research:   \n1038 Solid Earth, 127(1), e2021JB023190, doi:https://doi.org/10.1029/2021JB023190.   \n1039 Lu, W., Y. Zhou, Z. Zhao, H. Yue, and S. Zhou (2021). Aftershock sequence of the 2017 Mw 6.5   \n1040 Jiuzhaigou, China earthquake monitored by an AsA network and its implication to fault   \n1041 structures and strength, Geophysical Journal International, 228(3), 1763-1779,   \n1042 doi:10.1093/gji/ggab443.   \n1043 Marzocchi, W., I. Spassiani, A. Stallone, and M. Taroni (2019). How to be fooled searching for   \n1044 significant variations of the b-value, Geophysical Journal International, 220(3), 1845-   \n1045 1856, doi:10.1093/gji/ggz541.   \n1046 McClusky, S., et al. (2000). Global Positioning System constraints on plate kinematics and   \n1047 dynamics in the eastern Mediterranean and Caucasus, Journal of Geophysical Research:   \n1048 Solid Earth, 105(B3), 5695-5719, doi:https://doi.org/10.1029/1999JB900351.   \n1049 McGill, S., and K. Sieh (1993). Holocene slip rate of the Central Garlock Fault in southeastern   \n1050 Searles Valley, California, Journal of Geophysical Research: Solid Earth, 98(B8), 14217-   \n1051 14231, doi:https://doi.org/10.1029/93JB00442.   \n1052 Melgar, D., A. Ganas, T. Taymaz, S. Valkaniotis, B. W. Crowell, V. Kapetanidis, V. Tsironi, S.   \n1053 Yolsal-Çevikbilen, and T. Öcalan (2020). Rupture kinematics of 2020 January 24 Mw 6.7   \n1054 Doğanyol-Sivrice, Turkey earthquake on the East Anatolian Fault Zone imaged by space   \n1055 geodesy, Geophysical Journal International, 223(2), 862-874, doi:10.1093/gji/ggaa345.   \n1056 Mousavi, S. M., W. Zhu, Y. Sheng, and G. C. Beroza (2019). CRED: A Deep Residual Network   \n1057 of Convolutional and Recurrent Units for Earthquake Signal Detection, Scientific Reports   \n1058 9(1), 10267, doi:10.1038/s41598-019-45748-1.   \n1059 Mousavi, S. M., W. L. Ellsworth, W. Zhu, L. Y. Chuang, and G. C. Beroza (2020). Earthquake   \n1060 transformer—an attentive deep-learning model for simultaneous earthquake detection and   \n1061 phase picking, Nature Communications, 11(1), 3952, doi:10.1038/s41467-020-17591-w.   \n1062 Münchmeyer, J., et al. (2022). Which Picker Fits My Data? A Quantitative Evaluation of Deep   \n1063 Learning Based Seismic Pickers, Journal of Geophysical Research: Solid Earth, 127(1),   \n1064 e2021JB023499, doi:https://doi.org/10.1029/2021JB023499.   \n1065 Nanjo, K. Z. (2020). Were changes in stress state responsible for the 2019 Ridgecrest, California,   \n1066 earthquakes?, Nature Communications, 11(1), 3082, doi:10.1038/s41467-020-16867-5.   \n1067 Neves, M., Z. Peng, and G. Lin (2022). A High‐Resolution Earthquake Catalog for the 2004 Mw   \n1068 6 Parkfield Earthquake Sequence Using a Matched Filter Technique, Seismological   \n1069 Research Letters, 94(1), 507-521, doi:10.1785/0220220206.   \n1070 Ogata, Y. (1988). Statistical Models for Earthquake Occurrences and Residual Analysis for Point   \n1071 Processes, Journal of the American Statistical Association, 83(401), 9-27,   \n1072 doi:10.1080/01621459.1988.10478560.   \n1073 Oskin, M., L. Perg, E. Shelef, M. Strane, E. Gurney, B. Singer, and X. Zhang (2008). Elevated   \n1074 shear zone loading rate during an earthquake cluster in eastern California, Geology, 36(6),   \n1075 507-510, doi:10.1130/g24814a.1.   \n1076 Park, Y., G. C. Beroza, and W. L. Ellsworth (2023). A Mitigation Strategy for the Prediction   \n1077 Inconsistency of Neural Phase Pickers, Seismological Research Letters,   \n1078 doi:10.1785/0220230003.   \n1079 Peng, B., E. Alcaide, Q. Anthony, A. Albalak, S. Arcadinho, H. Cao, X. Cheng, M. Chung, M.   \n1080 Grella, and K. K. GV (2023). Rwkv: Reinventing rnns for the transformer era, arXiv   \n1081 preprint arXiv:2305.13048.   \n1082 Ponti, D. J., et al. (2020). Documentation of Surface Fault Rupture and Ground‐Deformation   \n1083 Features Produced by the 4 and 5 July 2019 Mw 6.4 and Mw 7.1 Ridgecrest Earthquake   \n1084 Sequence, Seismological Research Letters, 91(5), 2942-2959, doi:10.1785/0220190322.   \n1085 Pousse-Beltran, L., E. Nissen, E. A. Bergman, M. D. Cambaz, É. Gaudreau, E. Karasözen, and F.   \n1086 Tan (2020). The 2020 Mw 6.8 Elazığ (Turkey) Earthquake Reveals Rupture Behavior of   \n1087 the East Anatolian Fault, Geophysical Research Letters, 47(13), e2020GL088136,   \n1088 doi:https://doi.org/10.1029/2020GL088136.   \n1089 Ren, C., et al. (2024). Supershear triggering and cascading fault ruptures of the 2023   \n1090 Kahramanmaraş, Türkiye, earthquake doublet, Science, 383(6680), 305-311,   \n1091 doi:doi:10.1126/science.adi1519.   \n1092 Ross, Z. E., et al. (2019a). Hierarchical interlocked orthogonal faulting in the 2019 Ridgecrest   \n1093 earthquake sequence, Science, 366(6463), 346-351, doi:10.1126/science.aaz0109.   \n1094 Ross, Z. E., D. T. Trugman, E. Hauksson, and P. M. Shearer (2019b). Searching for hidden   \n1095 earthquakes in Southern California, Science, 364(6442), 767-771,   \n1096 doi:10.1126/science.aaw6888.   \n1097 Ross, Z. E., E. S. Cochran, D. T. Trugman, and J. D. Smith (2020). 3D fault architecture controls   \n1098 the dynamism of earthquake swarms, Science, 368(6497), 1357-1361,   \n1099 doi:10.1126/science.abb0779.   \n1100 Schoenball, M., N. C. Davatzes, and J. M. G. Glen (2015). Differentiating induced and natural   \n1101 seismicity using space-time-magnitude statistics applied to the Coso Geothermal field,   \n1102 Geophysical Research Letters, 42(15), 6221-6228,   \n1103 doi:https://doi.org/10.1002/2015GL064772.   \n1104 Scholz, C. H. (1988). The brittle-plastic transition and the depth of seismic faulting, Geologische   \n1105 Rundschau, 77(1), 319-328, doi:10.1007/BF01848693.   \n1106 Scholz, C. H. (2015). On the stress dependence of the earthquake b value, Geophysical Research   \n1107 Letters, 42(5), 1399-1402, doi:10.1002/2014gl062863.   \n1108 Scholz, C. H. (2019). The mechanics of earthquakes and faulting, Cambridge university press,   \n1109 doi:https://doi.org/10.1017/9781316681473.   \n0 Schurr, B., M. Moreno, A. M. Tréhu, J. Bedford, J. Kummerow, S. Li, and O. Oncken (2020).   \n1 Forming a Mogi Doughnut in the Years Prior to and Immediately Before the 2014 M8.1   \n2 Iquique, Northern Chile, Earthquake, Geophysical Research Letters, 47(16),   \n3 e2020GL088351, doi:https://doi.org/10.1029/2020GL088351.   \n4 Shelly, D. R. (2020). A High ‐ Resolution Seismic Catalog for the Initial 2019 Ridgecrest   \n5 Earthquake Sequence: Foreshocks, Aftershocks, and Faulting Complexity, Seismological   \n6 Research Letters, 91(4), 1971-1978, doi:10.1785/0220190309.   \n7 Shelly, D. R., D. E. Goldberg, K. Z. Materna, R. J. Skoumal, J. L. Hardebeck, C. E. Yoon, W. L.   \n8 Yeck, and P. S. Earle (2024). Subduction intraslab-interface fault interactions in the 2022   \n9 <i>M</i><sub>w</sub> 6.4 Ferndale, California, earthquake sequence, Science   \n0 Advances, 10(10), eadl1226, doi:doi:10.1126/sciadv.adl1226.   \n1 Shi, Y., and B. A. Bolt (1982). The standard error of the magnitude-frequency b value, Bulletin of   \n22 the Seismological Society of America, 72(5), 1677-1687.   \n3 Spinler, J. C., R. A. Bennett, M. L. Anderson, S. F. McGill, S. Hreinsdóttir, and A. McCallister   \n24 (2010). Present-day strain accumulation and slip rates associated with southern San   \n5 Andreas and eastern California shear zone faults, Journal of Geophysical Research: Solid   \n6 Earth, 115(B11), doi:https://doi.org/10.1029/2010JB007424.   \n7 Styron, R., and M. Pagani (2020). The GEM Global Active Faults Database, Earthquake Spectra,   \n28 36(1_suppl), 160-180, doi:10.1177/8755293020944182.   \n9 Sugan, M., S. Campanella, L. Chiaraluce, M. Michele, and A. Vuan (2023). The unlocking process   \n0 leading to the 2016 Central Italy seismic sequence, Geophysical Research Letters, $n/a(\\mathbf{n}/\\mathbf{a})$ ,   \n31 e2022GL101838, doi:https://doi.org/10.1029/2022GL101838.   \n2 Sun, H., Z. E. Ross, W. Zhu, and K. Azizzadenesheli (2023). Phase Neural Operator for Multi  \n3 Station Picking of Seismic Arrivals, Geophysical Research Letters, 50(24),   \n4 e2023GL106434, doi:https://doi.org/10.1029/2023GL106434.   \n5 Sutskever, I., O. Vinyals, and Q. V. Le (2014). Sequence to sequence learning with neural   \n6 networks, Advances in neural information processing systems, 27.   \n7 Sykes, L. R. (2021). Decadal seismicity prior to great earthquakes at subduction zones: Roles of   \n8 major asperities and low-coupling zones, International Journal of Geosciences, 12(9), 845-   \n9 926, doi:https://doi.org/10.4236/ijg.2021.129046.   \n0 Tan, Y. J., F. Waldhauser, W. L. Ellsworth, M. Zhang, W. Zhu, M. Michele, L. Chiaraluce, G. C.   \n41 Beroza, and M. Segou (2021). Machine‐Learning‐Based High‐Resolution Earthquake   \n2 Catalog Reveals How Complex Fault Structures Were Activated during the 2016–2017   \n3 Central Italy Sequence, The Seismic Record, 1(1), 11-19, doi:10.1785/0320210001.   \n4 Thompson Jobe, J. A., et al. (2020). Evidence of Previous Faulting along the 2019 Ridgecrest,   \n45 California, Earthquake Ruptures, Bulletin of the Seismological Society of America, 110(4),   \n6 1427-1456, doi:10.1785/0120200041.   \n7 Toda, S., and R. S. Stein (2022). Central shutdown and surrounding activation of aftershocks from   \n48 megathrust earthquake stress transfer, Nature Geoscience, 15(6), 494-500,   \n9 doi:10.1038/s41561-022-00954-x.   \n0 Trugman, D. T., P. M. Shearer, A. A. Borsa, and Y. Fialko (2016). A comparison of long-term   \n51 changes in seismicity at The Geysers, Salton Sea, and Coso geothermal fields, Journal of   \n2 Geophysical Research: Solid Earth, 121(1), 225-247,   \n3 doi:https://doi.org/10.1002/2015JB012510.   \n4 Trugman, D. T., and P. M. Shearer (2017). GrowClust: A Hierarchical Clustering Algorithm for   \n55 Relative Earthquake Relocation, with Application to the Spanish Springs and Sheldon,   \n1156 Nevada, Earthquake Sequences, Seismological Research Letters, 88(2A), 379-391,   \n157 doi:10.1785/0220160188.   \n158 Tymofyeyeva, E., and Y. Fialko (2015). Mitigation of atmospheric phase delays in InSAR data,   \n159 with application to the eastern California shear zone, Journal of Geophysical Research:   \n1160 Solid Earth, 120(8), 5952-5963, doi:https://doi.org/10.1002/2015JB011886.   \n161 Uchida, N., and R. Bürgmann (2021). A Decade of Lessons Learned from the 2011 Tohoku-Oki   \n1162 Earthquake, Reviews of Geophysics, 59(2), e2020RG000713,   \n1163 doi:https://doi.org/10.1029/2020RG000713.   \n1164 Vaswani, A., N. Shazeer, N. Parmar, J. Uszkoreit, L. Jones, A. N. Gomez, Ł. Kaiser, and I.   \n1165 Polosukhin (2017). Attention is all you need, Advances in neural information processing   \n1166 systems, 30.   \n1167 Waldhauser, F., and W. L. Ellsworth (2000). A Double-Difference Earthquake Location   \n1168 Algorithm: Method and Application to the Northern Hayward Fault, California, Bulletin of   \n169 the Seismological Society of America, 90(6), 1353-1368, doi:10.1785/0120000006.   \n170 Waldhauser, F. (2001). hypoDD--A program to compute double-difference hypocenter locations,   \n171 U.S. Geological Survey Open-File Report 01-113, 25 pp.   \n1172 Waldhauser, F., and D. P. Schaff (2008). Large-scale relocation of two decades of Northern   \n1173 California seismicity using cross-correlation and double-difference methods, Journal of   \n1174 Geophysical Research: Solid Earth, 113(B8), doi:10.1029/2007jb005479.   \n1175 Walters, R. J., B. Parsons, and T. J. Wright (2014). Constraining crustal velocity fields with InSAR   \n1176 for Eastern Turkey: Limits to the block-like behavior of Eastern Anatolia, Journal of   \n1177 Geophysical Research: Solid Earth, 119(6), 5215-5234,   \n178 doi:https://doi.org/10.1002/2013JB010909.   \n1179 Weiss, J. R., et al. (2020). High-Resolution Surface Velocities and Strain for Anatolia From   \n180 Sentinel-1 InSAR and GNSS Data, Geophysical Research Letters, 47(17),   \n1181 e2020GL087376, doi:https://doi.org/10.1029/2020GL087376.   \n182 Wetzler, N., T. Lay, E. E. Brodsky, and H. Kanamori (2018). Systematic deficiency of aftershocks   \n1183 in areas of high coseismic slip for large subduction zone earthquakes, Science Advances,   \n184 4(2), eaao3225, doi:10.1126/sciadv.aao3225.   \n1185 Wiemer, S., and M. Wyss (2000). Minimum Magnitude of Completeness in Earthquake Catalogs:   \n1186 Examples from Alaska, the Western United States, and Japan, Bulletin of the Seismological   \n1187 Society of America, 90(4), 859-869, doi:10.1785/0119990114.   \n1188 Woessner, J., and S. Wiemer (2005). Assessing the Quality of Earthquake Catalogues: Estimating   \n1189 the Magnitude of Completeness and Its Uncertainty, Bulletin of the Seismological Society   \n1190 of America, 95(2), 684-698, doi:10.1785/0120040007.   \n191 Xu, L., S. Mohanna, L. Meng, C. Ji, J.-P. Ampuero, Z. Yunjun, M. Hasnain, R. Chu, and C. Liang   \n1192 (2023). The overall-subshear and multi-segment rupture of the 2023 Mw7.8   \n193 Kahramanmaraş, Turkey earthquake in millennia supercycle, Communications Earth &   \n1194 Environment, 4(1), 379, doi:10.1038/s43247-023-01030-x.   \n1195 Xu, X., D. T. Sandwell, L. A. Ward, C. W. D. Milliner, B. R. Smith-Konter, P. Fang, and Y. Bock   \n1196 (2020). Surface deformation associated with fractures near the 2019 Ridgecrest earthquake   \n1197 sequence, Science, 370(6516), 605-608, doi:10.1126/science.abd1690.   \n1198 Yoon, C. E., and D. R. Shelly (2024). Distinct Yet Adjacent Earthquake Sequences near the   \n1199 Mendocino Triple Junction: 20 December 2021 Mw 6.1 and 6.0 Petrolia, and 20 December   \n1200 2022 Mw 6.4 Ferndale, The Seismic Record, 4(1), 81-92, doi:10.1785/0320230053.   \n201 Yu, Z., and W. Wang (2022). LPPN: A Lightweight Network for Fast Phase Picking,   \n202 Seismological Research Letters, 93(5), 2834-2846, doi:10.1785/0220210309.   \n203 Yue, H., J. Sun, M. Wang, Z. Shen, M. Li, L. Xue, W. Lu, Y. Zhou, C. Ren, and T. Lay (2021).   \n204 The 2019 Ridgecrest, California earthquake sequence: Evolution of seismic and aseismic   \n205 slip on an orthogonal fault system, Earth and Planetary Science Letters, 570, 117066,   \n206 doi:https://doi.org/10.1016/j.epsl.2021.117066.   \n207 Zaliapin, I., and Y. Ben-Zion (2020). Earthquake Declustering Using the Nearest-Neighbor   \n208 Approach in Space-Time-Magnitude Domain, Journal of Geophysical Research: Solid   \n209 Earth, 125(4), e2018JB017120, doi:https://doi.org/10.1029/2018JB017120.   \n210 Zelenin, E., D. Bachmanov, S. Garipova, V. Trifonov, and A. Kozhurin (2022). The Active Faults   \n211 of Eurasia Database (AFEAD): the ontology and design behind the continental-scale   \n212 dataset, Earth Syst. Sci. Data, 14(10), 4489-4503, doi:10.5194/essd-14-4489-2022.   \n213 Zhang, J., Z. Li, and J. Zhang (2023a). Simultaneous Seismic Phase Picking and Polarity   \n214 Determination with an Attention ‐ Based Neural Network, Seismological Research   \n215 Letters, 94(2A), 813-828, doi:10.1785/0220220247.   \n216 Zhang, M., M. Liu, T. Feng, R. Wang, and W. Zhu (2022). LOC‐FLOW: An End‐to‐End   \n217 Machine Learning ‐ Based High ‐ Precision Earthquake Location Workflow,   \n218 Seismological Research Letters, 93(5), 2426-2438, doi:10.1785/0220220019.   \n219 Zhang, Y., X. Tang, D. Liu, T. Taymaz, T. Eken, R. Guo, Y. Zheng, J. Wang, and H. Sun (2023b).   \n220 Geometric controls on cascading rupture of the 2023 Kahramanmaraş earthquake doublet,   \n221 Nature Geoscience, 16(11), 1054-1060, doi:10.1038/s41561-023-01283-3.   \n222 Zhou, Y., S. Zhou, and J. Zhuang (2018). A test on methods for MC estimation based on   \n223 earthquake catalog, Earth and Planetary Physics, 2(2), 150-162,   \n224 doi:10.26464/epp2018015.   \n225 Zhou, Y., H. Yue, Q. Kong, and S. Zhou (2019). Hybrid Event Detection and Phase‐Picking   \n226 Algorithm Using Convolutional and Recurrent Neural Networks, Seismological Research   \n227 Letters, 90(3), 1079-1087, doi:10.1785/0220180319.   \n228 Zhou, Y., A. Ghosh, L. Fang, H. Yue, S. Zhou, and Y. Su (2021a). A high-resolution seismic   \n229 catalog for the 2021 MS6.4/MW6.1 Yangbi earthquake sequence, Yunnan, China:   \n230 Application of AI picker and matched filter, Earthquake Science, 34(5), 390-398,   \n231 doi:https://doi.org/10.29382/eqs-2021-0031.   \n232 Zhou, Y., H. Yue, L. Fang, S. Zhou, L. Zhao, and A. Ghosh (2021b). An Earthquake Detection   \n233 and Location Architecture for Continuous Seismograms: Phase Picking, Association,   \n234 Location, and Matched Filter (PALM), Seismological Research Letters, 93(1), 413-425,   \n235 doi:10.1785/0220210111.   \n236 Zhou, Y., C. Ren, A. Ghosh, H. Meng, L. Fang, H. Yue, S. Zhou, and Y. Su (2022a). Seismological   \n237 Characterization of the 2021 Yangbi Foreshock-Mainshock Sequence, Yunnan, China:   \n238 More than a Triggered Cascade, Journal of Geophysical Research: Solid Earth, 127(8),   \n239 e2022JB024534, doi:https://doi.org/10.1029/2022JB024534.   \n240 Zhou, Y., H. Yue, S. Zhou, L. Fang, Y. Zhou, L. Xu, Z. Liu, T. Wang, L. Zhao, and A. Ghosh   \n241 (2022b). Microseismicity along Xiaojiang Fault Zone (Southeastern Tibetan Plateau) and   \n242 the characterization of interseismic fault behavior, Tectonophysics, 833, 229364,   \n243 doi:https://doi.org/10.1016/j.tecto.2022.229364.   \n244 Zhu, J., Z. Li, and L. Fang (2022a). USTC-Pickers: a Unified Set of seismic phase pickers Transfer   \n245 learned for China, Earthquake Science, 36, 1-11.  _en_zh_google": "884 Acarel, D., M. D. Cambaz, F. Turhan, A. K. Mutlu, and R. Polat (2019). Seismotectonics of   \n885 Malatya Fault, Eastern Turkey, Open Geosciences, 11(1), 1098-1111,   \n886 doi:doi:10.1515/geo-2019-0085.   \n887 Aki, K. (1965). Maximum likelihood estimate of b in the formula log $\\Nu=$ a-bM and its confidence   \n888 limits, Bull. Earthq. Res. Inst., Tokyo Univ., 43, 237-239.   \n889 Aktug, B., H. Ozener, A. Dogru, A. Sabuncu, B. Turgut, K. Halicioglu, O. Yilmaz, and E. Havazli   \n890 (2016). Slip rates and seismic potential on the East Anatolian Fault System using an   \n891 improved GPS velocity field, Journal of Geodynamics, 94-95, 1-12,   \n892 doi:https://doi.org/10.1016/j.jog.2016.01.001.   \n893 Amorèse, D., J.-R. Grasso, and P. A. Rydelek (2010). On varying b-values with depth: results from   \n894 computer-intensive tests for Southern California, Geophysical Journal International,   \n895 180(1), 347-360, doi:10.1111/j.1365-246X.2009.04414.x.   \n896 Bahdanau, D., K. Cho, and Y. Bengio (2014). Neural machine translation by jointly learning to   \n897 align and translate, arXiv preprint arXiv:1409.0473.   \n898 Barbot, S., and J. R. Weiss (2021). Connecting subduction, extension and shear localization across   \n899 the Aegean Sea and Anatolia, Geophysical Journal International, 226(1), 422-445,   \n900 doi:10.1093/gji/ggab078.   \n901 Ben-Zion, Y., and C. G. Sammis (2003). Characterization of Fault Zones, pure and applied   \n902 geophysics, 160(3), 677-715, doi:10.1007/PL00012554.   \n903 Bletery, Q., O. Cavalié, J.-M. Nocquet, and T. Ragon (2020). Distribution of Interseismic Coupling   \n904 Along the North and East Anatolian Faults Inferred From InSAR and GPS Data,   \n905 Geophysical Research Letters, 47(16), e2020GL087775,   \n906 doi:https://doi.org/10.1029/2020GL087775.   \n907 Bornstein, T., D. Lange, J. Münchmeyer, J. Woollam, A. Rietbrock, G. Barcheck, I. Grevemeyer,   \n908 and F. Tilmann (2024). PickBlue: Seismic Phase Picking for Ocean Bottom Seismometers   \n909 With Deep Learning, Earth and Space Science, 11(1), e2023EA003332,   \n910 doi:https://doi.org/10.1029/2023EA003332.   \n911 Bulut, F., M. Bohnhoff, T. Eken, C. Janssen, T. Kılıç, and G. Dresen (2012). The East Anatolian   \n912 Fault Zone: Seismotectonic setting and spatiotemporal characteristics of seismicity based   \n913 on precise earthquake locations, Journal of Geophysical Research: Solid Earth, 117(B7),   \n914 doi:https://doi.org/10.1029/2011JB008966.   \n915 Bürgmann, R. (2018). The geophysics, geology and mechanics of slow fault slip, Earth and   \n916 Planetary Science Letters, 495, 112-134, doi:https://doi.org/10.1016/j.epsl.2018.04.062.   \n917 Cakir, Z., et al. (2023). Arrest of the Mw 6.8 January 24, 2020 Elaziğ (Turkey) earthquake by   \n918 shallow fault creep, Earth and Planetary Science Letters, 608, 118085,   \n919 doi:https://doi.org/10.1016/j.epsl.2023.118085.   \n920 Cao, A., and S. S. Gao (2002). Temporal variation of seismic b-values beneath northeastern Japan   \n921 island arc, Geophysical Research Letters, 29(9), 48-41-48-43, doi:10.1029/2001gl013775.   \n922   \n923 Cavalié, O., and S. Jónsson (2014). Block-like plate movements in eastern Anatolia observed by   \n924 InSAR, Geophysical Research Letters, 41(1), 26-31,   \n925 doi:https://doi.org/10.1002/2013GL058170.   \n926 Chai, C., M. Maceira, H. J. Santos-Villalobos, S. V. Venkatakrishnan, M. Schoenball, W. Zhu, G.   \n927 C. Beroza, C. Thurber, and E. C. Team (2020). Using a Deep Neural Network and Transfer   \n928 Learning to Bridge Scales for Seismic Phase Picking, Geophysical Research Letters,   \n929 47(16), e2020GL088651, doi:https://doi.org/10.1029/2020GL088651.   \n930 Chamberlain, C. J., W. B. Frank, F. Lanza, J. Townend, and E. Warren-Smith (2021). Illuminating   \n931 the Pre-, Co-, and Post-Seismic Phases of the 2016 M7.8 Kaikōura Earthquake With   \n932 10 Years of Seismicity, Journal of Geophysical Research: Solid Earth, 126(8),   \n933 e2021JB022304, doi:https://doi.org/10.1029/2021JB022304.   \n934 Chen, K., J.-P. Avouac, S. Aati, C. Milliner, F. Zheng, and C. Shi (2020). Cascading and pulse  \n935 like ruptures during the 2019 Ridgecrest earthquakes in the Eastern California Shear Zone,   \n936 Nature Communications, 11(1), 22, doi:10.1038/s41467-019-13750-w.   \n937 Cheng, Y., E. Hauksson, and Y. Ben-Zion (2023). Refined Earthquake Focal Mechanism Catalog   \n938 for Southern California Derived With Deep Learning Algorithms, Journal of Geophysical   \n939 Research: Solid Earth, 128(2), e2022JB025975,   \n940 doi:https://doi.org/10.1029/2022JB025975.   \n941 Cho, K., B. van Merrienboer, C. Gulcehre, D. Bahdanau, F. Bougares, H. Schwenk, and Y. Bengio   \n942 (2014). Learning Phrase Representations using RNN Encoder-Decoder for Statistical   \n943 Machine Translation, arXiv e-prints, arXiv:1406.1078.   \n944 Dal Zilio, L., and J.-P. Ampuero (2023). Earthquake doublet in Turkey and Syria, Communications   \n945 Earth & Environment, 4(1), 71, doi:10.1038/s43247-023-00747-z.   \n946 Ding, H., Y. Zhou, Z. Ge, T. Taymaz, A. Ghosh, H. Xu, T. S. Irmak, and X. Song (2023). High  \n947 resolution seismicity imaging and early aftershock migration of the 2023 Kahramanmaraş   \n948 (SE Türkiye) <i>M</i><sub>W</sub>7.9 &amp; 7.8 earthquake doublet, Earthquake   \n949 Science, 36, 1-16, doi:10.1016/j.eqs.2023.06.002.   \n950 Ezen-Can, A. (2020). A Comparison of LSTM and BERT for Small Corpus, arXiv preprint   \n951 arXiv:2009.05451.   \n952 Feng, T., S. Mohanna, and L. Meng (2022). EdgePhase: A Deep Learning Model for Multi-Station   \n953 Seismic Phase Picking, Geochemistry, Geophysics, Geosystems, 23(11), e2022GC010453,   \n954 doi:https://doi.org/10.1029/2022GC010453.   \n955 Gallovič, F., J. Zahradník, V. Plicka, E. Sokos, C. Evangelidis, I. Fountoulakis, and F. Turhan   \n956 (2020). Complex rupture dynamics on an immature fault during the 2020 Mw 6.8 Elazığ   \n957 earthquake, Turkey, Communications Earth & Environment, 1(1), 40, doi:10.1038/s43247-   \n958 020-00038-x.   \n959 Ganev, P. N., J. F. Dolan, S. F. McGill, and K. L. Frankel (2012). Constancy of geologic slip rate   \n960 along the central Garlock fault: implications for strain accumulation and release in southern   \n961 California, Geophysical Journal International, 190(2), 745-760, doi:10.1111/j.1365-   \n962 246X.2012.05494.x.   \n963 Goldberg, D. E., D. Melgar, V. J. Sahakian, A. M. Thomas, X. Xu, B. W. Crowell, and J. Geng   \n964 (2020). Complex Rupture of an Immature Fault Zone: A Simultaneous Kinematic Model   \n965 of the 2019 Ridgecrest, CA Earthquakes, Geophysical Research Letters, 47(3),   \n966 e2019GL086382, doi:https://doi.org/10.1029/2019GL086382.   \n967 Gong, J., and W. Fan (2022). Seismicity, Fault Architecture, and Slip Mode of the Westernmost   \n968 Gofar Transform Fault, Journal of Geophysical Research: Solid Earth, 127(11),   \n969 e2022JB024918, doi:https://doi.org/10.1029/2022JB024918.   \n970 Graves, A., and N. Jaitly (2014). Towards End-To-End Speech Recognition with Recurrent Neural   \n971 Networks, in Proceedings of the 31st International Conference on Machine Learning,   \n972 edited by P. X. Eric and J. Tony, pp. 1764--1772, PMLR, Proceedings of Machine Learning   \n973 Research.   \n974 Gutenberg, B., and C. F. Richter (1944). Frequency of earthquakes in California, Bulletin of the   \n975 Seismological Society of America, 34(4), 185-188.   \n976 Güvercin, S. E., H. Karabulut, A. Ö. Konca, U. Doğan, and S. Ergintav (2022). Active   \n977 seismotectonics of the East Anatolian Fault, Geophysical Journal International, 230(1),   \n978 50-69, doi:10.1093/gji/ggac045.   \n979 Güvercin, S. E. (2024). 2023 Earthquake Doublet in Türkiye Reveals the Complexities of the East   \n980 Anatolian Fault Zone: Insights from Aftershock Patterns and Moment Tensor Solutions,   \n981 Seismological Research Letters, doi:10.1785/0220230317.   \n982 Hannun, A., C. Case, J. Casper, B. Catanzaro, G. Diamos, E. Elsen, R. Prenger, S. Satheesh, S.   \n983 Sengupta, and A. Coates (2014). Deep speech: Scaling up end-to-end speech recognition,   \n984 arXiv preprint arXiv:1412.5567.   \n985 Hatem, A. E., and J. F. Dolan (2018). A Model for the Initiation, Evolution, and Controls on   \n986 Seismic Behavior of the Garlock Fault, California, Geochemistry, Geophysics,   \n987 Geosystems, 19(7), 2166-2178, doi:https://doi.org/10.1029/2017GC007349.   \n988 Hauksson, E., W. Yang, and P. M. Shearer (2012). Waveform Relocated Earthquake Catalog for   \n989 Southern California (1981 to June 2011), Bulletin of the Seismological Society of America,   \n990 102(5), 2239-2244, doi:10.1785/0120120010.   \n991 Hauksson, E., and L. M. Jones (2020). Seismicity, Stress State, and Style of Faulting of the   \n992 Ridgecrest‐Coso Region from the 1930s to 2019: Seismotectonics of an Evolving Plate   \n993 Boundary Segment, Bulletin of the Seismological Society of America, 110(4), 1457-1473,   \n994 doi:10.1785/0120200051.   \n995 Herrmann, M., and W. Marzocchi (2020). Inconsistencies and Lurking Pitfalls in the Magnitude–   \n996 Frequency Distribution of High ‐ Resolution Earthquake Catalogs, Seismological   \n997 Research Letters, 92(2A), 909-922, doi:10.1785/0220200337.   \n998 Hsu, Y.-F., I. Zaliapin, and Y. Ben-Zion (2024). Informative Modes of Seismicity in Nearest  \n999 Neighbor Earthquake Proximities, Journal of Geophysical Research: Solid Earth, 129(3),   \n1000 e2023JB027826, doi:https://doi.org/10.1029/2023JB027826.   \n1001 Hubert-Ferrari, A., L. Lamair, S. Hage, S. Schmidt, M. N. Çağatay, and U. Avşar (2020). A 3800   \n1002 yr paleoseismic record (Lake Hazar sediments, eastern Turkey): Implications for the East   \n1003 Anatolian Fault seismic cycle, Earth and Planetary Science Letters, 538, 116152,   \n1004 doi:https://doi.org/10.1016/j.epsl.2020.116152.   \n1005 Hussain, E., S. Kalaycıoğlu, C. W. D. Milliner, and Z. Çakir (2023). Preconditioning the 2023   \n1006 Kahramanmaraş (Türkiye) earthquake disaster, Nature Reviews Earth & Environment,   \n1007 doi:10.1038/s43017-023-00411-2.   \n1008 Hutton, K., J. Woessner, and E. Hauksson (2010). Earthquake Monitoring in Southern California   \n1009 for Seventy-Seven Years (1932–2008), Bulletin of the Seismological Society of America,   \n1010 100(2), 423-446, doi:10.1785/0120090130.   \n1011 Im, K., J.-P. Avouac, E. R. Heimisson, and D. Elsworth (2021). Ridgecrest aftershocks at Coso   \n1012 suppressed by thermal destressing, Nature, 595(7865), 70-74, doi:10.1038/s41586-021-   \n1013 03601-4.   \n1014 Jia, Z., et al. (2023). The complex dynamics of the 2023 Kahramanmara&#x15f;, Turkey,   \n1015 <i>M</i><sub>w</sub> 7.8-7.7 earthquake doublet, Science, 381(6661), 985-990,   \n1016 doi:doi:10.1126/science.adi0685.   \n1017 Jiang, C., L. Fang, L. Fan, and B. Li (2021). Comparison of the earthquake detection abilities of   \n1018 PhaseNet and EQTransformer with the Yangbi and Maduo earthquakes, Earthquake   \n1019 Science, 34(5), 425-435, doi:10.29382/eqs-2021-0038.   \n1020 Jiang, J., and N. Lapusta (2016). Deeper penetration of large earthquakes on seismically quiescent   \n1021 faults, Science, 352(6291), 1293-1297, doi:doi:10.1126/science.aaf1496.   \n1022 Karabacak, V., et al. (2023). The 2023 Pazarcık (Kahramanmaraş, Türkiye) earthquake (Mw 7.7):   \n1023 implications for surface rupture dynamics along the East Anatolian Fault Zone, Journal of   \n1024 the Geological Society, 180(3), doi:10.1144/jgs2023-020.   \n1025 Kingma, D. P., and J. Ba (2014). Adam: A Method for Stochastic Optimization, arXiv e-prints,   \n1026 arXiv:1412.6980.   \n1027 Klein, F. W. (2002). User's guide to HYPOINVERSE-2000, a Fortran program to solve for   \n1028 earthquake locations and magnitudesRep. 2331-1258, US Geological Survey.   \n1029 Lay, T., and S. P. Nishenko (2022). Updated concepts of seismic gaps and asperities to assess great   \n1030 earthquake hazard along South America, Proceedings of the National Academy of Sciences,   \n1031 119(51), e2216843119, doi:doi:10.1073/pnas.2216843119.   \n1032 Lin, X., J. Hao, D. Wang, R. Chu, X. Zeng, J. Xie, B. Zhang, and Q. Bai (2020). Coseismic Slip   \n1033 Distribution of the 24 January 2020 Mw 6.7 Doganyol Earthquake and in Relation to the   \n1034 Foreshock and Aftershock Activities, Seismological Research Letters, 92(1), 127-139,   \n1035 doi:10.1785/0220200152.   \n1036 Lomax, A., and A. Savvaidis (2022). High-Precision Earthquake Location Using Source-Specific   \n1037 Station Terms and Inter-Event Waveform Similarity, Journal of Geophysical Research:   \n1038 Solid Earth, 127(1), e2021JB023190, doi:https://doi.org/10.1029/2021JB023190.   \n1039 Lu, W., Y. Zhou, Z. Zhao, H. Yue, and S. Zhou (2021). Aftershock sequence of the 2017 Mw 6.5   \n1040 Jiuzhaigou, China earthquake monitored by an AsA network and its implication to fault   \n1041 structures and strength, Geophysical Journal International, 228(3), 1763-1779,   \n1042 doi:10.1093/gji/ggab443.   \n1043 Marzocchi, W., I. Spassiani, A. Stallone, and M. Taroni (2019). How to be fooled searching for   \n1044 significant variations of the b-value, Geophysical Journal International, 220(3), 1845-   \n1045 1856, doi:10.1093/gji/ggz541.   \n1046 McClusky, S., et al. (2000). Global Positioning System constraints on plate kinematics and   \n1047 dynamics in the eastern Mediterranean and Caucasus, Journal of Geophysical Research:   \n1048 Solid Earth, 105(B3), 5695-5719, doi:https://doi.org/10.1029/1999JB900351.   \n1049 McGill, S., and K. Sieh (1993). Holocene slip rate of the Central Garlock Fault in southeastern   \n1050 Searles Valley, California, Journal of Geophysical Research: Solid Earth, 98(B8), 14217-   \n1051 14231, doi:https://doi.org/10.1029/93JB00442.   \n1052 Melgar, D., A. Ganas, T. Taymaz, S. Valkaniotis, B. W. Crowell, V. Kapetanidis, V. Tsironi, S.   \n1053 Yolsal-Çevikbilen, and T. Öcalan (2020). Rupture kinematics of 2020 January 24 Mw 6.7   \n1054 Doğanyol-Sivrice, Turkey earthquake on the East Anatolian Fault Zone imaged by space   \n1055 geodesy, Geophysical Journal International, 223(2), 862-874, doi:10.1093/gji/ggaa345.   \n1056 Mousavi, S. M., W. Zhu, Y. Sheng, and G. C. Beroza (2019). CRED: A Deep Residual Network   \n1057 of Convolutional and Recurrent Units for Earthquake Signal Detection, Scientific Reports   \n1058 9(1), 10267, doi:10.1038/s41598-019-45748-1.   \n1059 Mousavi, S. M., W. L. Ellsworth, W. Zhu, L. Y. Chuang, and G. C. Beroza (2020). Earthquake   \n1060 transformer—an attentive deep-learning model for simultaneous earthquake detection and   \n1061 phase picking, Nature Communications, 11(1), 3952, doi:10.1038/s41467-020-17591-w.   \n1062 Münchmeyer, J., et al. (2022). Which Picker Fits My Data? A Quantitative Evaluation of Deep   \n1063 Learning Based Seismic Pickers, Journal of Geophysical Research: Solid Earth, 127(1),   \n1064 e2021JB023499, doi:https://doi.org/10.1029/2021JB023499.   \n1065 Nanjo, K. Z. (2020). Were changes in stress state responsible for the 2019 Ridgecrest, California,   \n1066 earthquakes?, Nature Communications, 11(1), 3082, doi:10.1038/s41467-020-16867-5.   \n1067 Neves, M., Z. Peng, and G. Lin (2022). A High‐Resolution Earthquake Catalog for the 2004 Mw   \n1068 6 Parkfield Earthquake Sequence Using a Matched Filter Technique, Seismological   \n1069 Research Letters, 94(1), 507-521, doi:10.1785/0220220206.   \n1070 Ogata, Y. (1988). Statistical Models for Earthquake Occurrences and Residual Analysis for Point   \n1071 Processes, Journal of the American Statistical Association, 83(401), 9-27,   \n1072 doi:10.1080/01621459.1988.10478560.   \n1073 Oskin, M., L. Perg, E. Shelef, M. Strane, E. Gurney, B. Singer, and X. Zhang (2008). Elevated   \n1074 shear zone loading rate during an earthquake cluster in eastern California, Geology, 36(6),   \n1075 507-510, doi:10.1130/g24814a.1.   \n1076 Park, Y., G. C. Beroza, and W. L. Ellsworth (2023). A Mitigation Strategy for the Prediction   \n1077 Inconsistency of Neural Phase Pickers, Seismological Research Letters,   \n1078 doi:10.1785/0220230003.   \n1079 Peng, B., E. Alcaide, Q. Anthony, A. Albalak, S. Arcadinho, H. Cao, X. Cheng, M. Chung, M.   \n1080 Grella, and K. K. GV (2023). Rwkv: Reinventing rnns for the transformer era, arXiv   \n1081 preprint arXiv:2305.13048.   \n1082 Ponti, D. J., et al. (2020). Documentation of Surface Fault Rupture and Ground‐Deformation   \n1083 Features Produced by the 4 and 5 July 2019 Mw 6.4 and Mw 7.1 Ridgecrest Earthquake   \n1084 Sequence, Seismological Research Letters, 91(5), 2942-2959, doi:10.1785/0220190322.   \n1085 Pousse-Beltran, L., E. Nissen, E. A. Bergman, M. D. Cambaz, É. Gaudreau, E. Karasözen, and F.   \n1086 Tan (2020). The 2020 Mw 6.8 Elazığ (Turkey) Earthquake Reveals Rupture Behavior of   \n1087 the East Anatolian Fault, Geophysical Research Letters, 47(13), e2020GL088136,   \n1088 doi:https://doi.org/10.1029/2020GL088136.   \n1089 Ren, C., et al. (2024). Supershear triggering and cascading fault ruptures of the 2023   \n1090 Kahramanmaraş, Türkiye, earthquake doublet, Science, 383(6680), 305-311,   \n1091 doi:doi:10.1126/science.adi1519.   \n1092 Ross, Z. E., et al. (2019a). Hierarchical interlocked orthogonal faulting in the 2019 Ridgecrest   \n1093 earthquake sequence, Science, 366(6463), 346-351, doi:10.1126/science.aaz0109.   \n1094 Ross, Z. E., D. T. Trugman, E. Hauksson, and P. M. Shearer (2019b). Searching for hidden   \n1095 earthquakes in Southern California, Science, 364(6442), 767-771,   \n1096 doi:10.1126/science.aaw6888.   \n1097 Ross, Z. E., E. S. Cochran, D. T. Trugman, and J. D. Smith (2020). 3D fault architecture controls   \n1098 the dynamism of earthquake swarms, Science, 368(6497), 1357-1361,   \n1099 doi:10.1126/science.abb0779.   \n1100 Schoenball, M., N. C. Davatzes, and J. M. G. Glen (2015). Differentiating induced and natural   \n1101 seismicity using space-time-magnitude statistics applied to the Coso Geothermal field,   \n1102 Geophysical Research Letters, 42(15), 6221-6228,   \n1103 doi:https://doi.org/10.1002/2015GL064772.   \n1104 Scholz, C. H. (1988). The brittle-plastic transition and the depth of seismic faulting, Geologische   \n1105 Rundschau, 77(1), 319-328, doi:10.1007/BF01848693.   \n1106 Scholz, C. H. (2015). On the stress dependence of the earthquake b value, Geophysical Research   \n1107 Letters, 42(5), 1399-1402, doi:10.1002/2014gl062863.   \n1108 Scholz, C. H. (2019). The mechanics of earthquakes and faulting, Cambridge university press,   \n1109 doi:https://doi.org/10.1017/9781316681473.   \n0 Schurr, B., M. Moreno, A. M. Tréhu, J. Bedford, J. Kummerow, S. Li, and O. Oncken (2020).   \n1 Forming a Mogi Doughnut in the Years Prior to and Immediately Before the 2014 M8.1   \n2 Iquique, Northern Chile, Earthquake, Geophysical Research Letters, 47(16),   \n3 e2020GL088351, doi:https://doi.org/10.1029/2020GL088351.   \n4 Shelly, D. R. (2020). A High ‐ Resolution Seismic Catalog for the Initial 2019 Ridgecrest   \n5 Earthquake Sequence: Foreshocks, Aftershocks, and Faulting Complexity, Seismological   \n6 Research Letters, 91(4), 1971-1978, doi:10.1785/0220190309.   \n7 Shelly, D. R., D. E. Goldberg, K. Z. Materna, R. J. Skoumal, J. L. Hardebeck, C. E. Yoon, W. L.   \n8 Yeck, and P. S. Earle (2024). Subduction intraslab-interface fault interactions in the 2022   \n9 <i>M</i><sub>w</sub> 6.4 Ferndale, California, earthquake sequence, Science   \n0 Advances, 10(10), eadl1226, doi:doi:10.1126/sciadv.adl1226.   \n1 Shi, Y., and B. A. Bolt (1982). The standard error of the magnitude-frequency b value, Bulletin of   \n22 the Seismological Society of America, 72(5), 1677-1687.   \n3 Spinler, J. C., R. A. Bennett, M. L. Anderson, S. F. McGill, S. Hreinsdóttir, and A. McCallister   \n24 (2010). Present-day strain accumulation and slip rates associated with southern San   \n5 Andreas and eastern California shear zone faults, Journal of Geophysical Research: Solid   \n6 Earth, 115(B11), doi:https://doi.org/10.1029/2010JB007424.   \n7 Styron, R., and M. Pagani (2020). The GEM Global Active Faults Database, Earthquake Spectra,   \n28 36(1_suppl), 160-180, doi:10.1177/8755293020944182.   \n9 Sugan, M., S. Campanella, L. Chiaraluce, M. Michele, and A. Vuan (2023). The unlocking process   \n0 leading to the 2016 Central Italy seismic sequence, Geophysical Research Letters, $n/a(\\mathbf{n}/\\mathbf{a})$ ,   \n31 e2022GL101838, doi:https://doi.org/10.1029/2022GL101838.   \n2 Sun, H., Z. E. Ross, W. Zhu, and K. Azizzadenesheli (2023). Phase Neural Operator for Multi  \n3 Station Picking of Seismic Arrivals, Geophysical Research Letters, 50(24),   \n4 e2023GL106434, doi:https://doi.org/10.1029/2023GL106434.   \n5 Sutskever, I., O. Vinyals, and Q. V. Le (2014). Sequence to sequence learning with neural   \n6 networks, Advances in neural information processing systems, 27.   \n7 Sykes, L. R. (2021). Decadal seismicity prior to great earthquakes at subduction zones: Roles of   \n8 major asperities and low-coupling zones, International Journal of Geosciences, 12(9), 845-   \n9 926, doi:https://doi.org/10.4236/ijg.2021.129046.   \n0 Tan, Y. J., F. Waldhauser, W. L. Ellsworth, M. Zhang, W. Zhu, M. Michele, L. Chiaraluce, G. C.   \n41 Beroza, and M. Segou (2021). Machine‐Learning‐Based High‐Resolution Earthquake   \n2 Catalog Reveals How Complex Fault Structures Were Activated during the 2016–2017   \n3 Central Italy Sequence, The Seismic Record, 1(1), 11-19, doi:10.1785/0320210001.   \n4 Thompson Jobe, J. A., et al. (2020). Evidence of Previous Faulting along the 2019 Ridgecrest,   \n45 California, Earthquake Ruptures, Bulletin of the Seismological Society of America, 110(4),   \n6 1427-1456, doi:10.1785/0120200041.   \n7 Toda, S., and R. S. Stein (2022). Central shutdown and surrounding activation of aftershocks from   \n48 megathrust earthquake stress transfer, Nature Geoscience, 15(6), 494-500,   \n9 doi:10.1038/s41561-022-00954-x.   \n0 Trugman, D. T., P. M. Shearer, A. A. Borsa, and Y. Fialko (2016). A comparison of long-term   \n51 changes in seismicity at The Geysers, Salton Sea, and Coso geothermal fields, Journal of   \n2 Geophysical Research: Solid Earth, 121(1), 225-247,   \n3 doi:https://doi.org/10.1002/2015JB012510.   \n4 Trugman, D. T., and P. M. Shearer (2017). GrowClust: A Hierarchical Clustering Algorithm for   \n55 Relative Earthquake Relocation, with Application to the Spanish Springs and Sheldon,   \n1156 Nevada, Earthquake Sequences, Seismological Research Letters, 88(2A), 379-391,   \n157 doi:10.1785/0220160188.   \n158 Tymofyeyeva, E., and Y. Fialko (2015). Mitigation of atmospheric phase delays in InSAR data,   \n159 with application to the eastern California shear zone, Journal of Geophysical Research:   \n1160 Solid Earth, 120(8), 5952-5963, doi:https://doi.org/10.1002/2015JB011886.   \n161 Uchida, N., and R. Bürgmann (2021). A Decade of Lessons Learned from the 2011 Tohoku-Oki   \n1162 Earthquake, Reviews of Geophysics, 59(2), e2020RG000713,   \n1163 doi:https://doi.org/10.1029/2020RG000713.   \n1164 Vaswani, A., N. Shazeer, N. Parmar, J. Uszkoreit, L. Jones, A. N. Gomez, Ł. Kaiser, and I.   \n1165 Polosukhin (2017). Attention is all you need, Advances in neural information processing   \n1166 systems, 30.   \n1167 Waldhauser, F., and W. L. Ellsworth (2000). A Double-Difference Earthquake Location   \n1168 Algorithm: Method and Application to the Northern Hayward Fault, California, Bulletin of   \n169 the Seismological Society of America, 90(6), 1353-1368, doi:10.1785/0120000006.   \n170 Waldhauser, F. (2001). hypoDD--A program to compute double-difference hypocenter locations,   \n171 U.S. Geological Survey Open-File Report 01-113, 25 pp.   \n1172 Waldhauser, F., and D. P. Schaff (2008). Large-scale relocation of two decades of Northern   \n1173 California seismicity using cross-correlation and double-difference methods, Journal of   \n1174 Geophysical Research: Solid Earth, 113(B8), doi:10.1029/2007jb005479.   \n1175 Walters, R. J., B. Parsons, and T. J. Wright (2014). Constraining crustal velocity fields with InSAR   \n1176 for Eastern Turkey: Limits to the block-like behavior of Eastern Anatolia, Journal of   \n1177 Geophysical Research: Solid Earth, 119(6), 5215-5234,   \n178 doi:https://doi.org/10.1002/2013JB010909.   \n1179 Weiss, J. R., et al. (2020). High-Resolution Surface Velocities and Strain for Anatolia From   \n180 Sentinel-1 InSAR and GNSS Data, Geophysical Research Letters, 47(17),   \n1181 e2020GL087376, doi:https://doi.org/10.1029/2020GL087376.   \n182 Wetzler, N., T. Lay, E. E. Brodsky, and H. Kanamori (2018). Systematic deficiency of aftershocks   \n1183 in areas of high coseismic slip for large subduction zone earthquakes, Science Advances,   \n184 4(2), eaao3225, doi:10.1126/sciadv.aao3225.   \n1185 Wiemer, S., and M. Wyss (2000). Minimum Magnitude of Completeness in Earthquake Catalogs:   \n1186 Examples from Alaska, the Western United States, and Japan, Bulletin of the Seismological   \n1187 Society of America, 90(4), 859-869, doi:10.1785/0119990114.   \n1188 Woessner, J., and S. Wiemer (2005). Assessing the Quality of Earthquake Catalogues: Estimating   \n1189 the Magnitude of Completeness and Its Uncertainty, Bulletin of the Seismological Society   \n1190 of America, 95(2), 684-698, doi:10.1785/0120040007.   \n191 Xu, L., S. Mohanna, L. Meng, C. Ji, J.-P. Ampuero, Z. Yunjun, M. Hasnain, R. Chu, and C. Liang   \n1192 (2023). The overall-subshear and multi-segment rupture of the 2023 Mw7.8   \n193 Kahramanmaraş, Turkey earthquake in millennia supercycle, Communications Earth &   \n1194 Environment, 4(1), 379, doi:10.1038/s43247-023-01030-x.   \n1195 Xu, X., D. T. Sandwell, L. A. Ward, C. W. D. Milliner, B. R. Smith-Konter, P. Fang, and Y. Bock   \n1196 (2020). Surface deformation associated with fractures near the 2019 Ridgecrest earthquake   \n1197 sequence, Science, 370(6516), 605-608, doi:10.1126/science.abd1690.   \n1198 Yoon, C. E., and D. R. Shelly (2024). Distinct Yet Adjacent Earthquake Sequences near the   \n1199 Mendocino Triple Junction: 20 December 2021 Mw 6.1 and 6.0 Petrolia, and 20 December   \n1200 2022 Mw 6.4 Ferndale, The Seismic Record, 4(1), 81-92, doi:10.1785/0320230053.   \n201 Yu, Z., and W. Wang (2022). LPPN: A Lightweight Network for Fast Phase Picking,   \n202 Seismological Research Letters, 93(5), 2834-2846, doi:10.1785/0220210309.   \n203 Yue, H., J. Sun, M. Wang, Z. Shen, M. Li, L. Xue, W. Lu, Y. Zhou, C. Ren, and T. Lay (2021).   \n204 The 2019 Ridgecrest, California earthquake sequence: Evolution of seismic and aseismic   \n205 slip on an orthogonal fault system, Earth and Planetary Science Letters, 570, 117066,   \n206 doi:https://doi.org/10.1016/j.epsl.2021.117066.   \n207 Zaliapin, I., and Y. Ben-Zion (2020). Earthquake Declustering Using the Nearest-Neighbor   \n208 Approach in Space-Time-Magnitude Domain, Journal of Geophysical Research: Solid   \n209 Earth, 125(4), e2018JB017120, doi:https://doi.org/10.1029/2018JB017120.   \n210 Zelenin, E., D. Bachmanov, S. Garipova, V. Trifonov, and A. Kozhurin (2022). The Active Faults   \n211 of Eurasia Database (AFEAD): the ontology and design behind the continental-scale   \n212 dataset, Earth Syst. Sci. Data, 14(10), 4489-4503, doi:10.5194/essd-14-4489-2022.   \n213 Zhang, J., Z. Li, and J. Zhang (2023a). Simultaneous Seismic Phase Picking and Polarity   \n214 Determination with an Attention ‐ Based Neural Network, Seismological Research   \n215 Letters, 94(2A), 813-828, doi:10.1785/0220220247.   \n216 Zhang, M., M. Liu, T. Feng, R. Wang, and W. Zhu (2022). LOC‐FLOW: An End‐to‐End   \n217 Machine Learning ‐ Based High ‐ Precision Earthquake Location Workflow,   \n218 Seismological Research Letters, 93(5), 2426-2438, doi:10.1785/0220220019.   \n219 Zhang, Y., X. Tang, D. Liu, T. Taymaz, T. Eken, R. Guo, Y. Zheng, J. Wang, and H. Sun (2023b).   \n220 Geometric controls on cascading rupture of the 2023 Kahramanmaraş earthquake doublet,   \n221 Nature Geoscience, 16(11), 1054-1060, doi:10.1038/s41561-023-01283-3.   \n222 Zhou, Y., S. Zhou, and J. Zhuang (2018). A test on methods for MC estimation based on   \n223 earthquake catalog, Earth and Planetary Physics, 2(2), 150-162,   \n224 doi:10.26464/epp2018015.   \n225 Zhou, Y., H. Yue, Q. Kong, and S. Zhou (2019). Hybrid Event Detection and Phase‐Picking   \n226 Algorithm Using Convolutional and Recurrent Neural Networks, Seismological Research   \n227 Letters, 90(3), 1079-1087, doi:10.1785/0220180319.   \n228 Zhou, Y., A. Ghosh, L. Fang, H. Yue, S. Zhou, and Y. Su (2021a). A high-resolution seismic   \n229 catalog for the 2021 MS6.4/MW6.1 Yangbi earthquake sequence, Yunnan, China:   \n230 Application of AI picker and matched filter, Earthquake Science, 34(5), 390-398,   \n231 doi:https://doi.org/10.29382/eqs-2021-0031.   \n232 Zhou, Y., H. Yue, L. Fang, S. Zhou, L. Zhao, and A. Ghosh (2021b). An Earthquake Detection   \n233 and Location Architecture for Continuous Seismograms: Phase Picking, Association,   \n234 Location, and Matched Filter (PALM), Seismological Research Letters, 93(1), 413-425,   \n235 doi:10.1785/0220210111.   \n236 Zhou, Y., C. Ren, A. Ghosh, H. Meng, L. Fang, H. Yue, S. Zhou, and Y. Su (2022a). Seismological   \n237 Characterization of the 2021 Yangbi Foreshock-Mainshock Sequence, Yunnan, China:   \n238 More than a Triggered Cascade, Journal of Geophysical Research: Solid Earth, 127(8),   \n239 e2022JB024534, doi:https://doi.org/10.1029/2022JB024534.   \n240 Zhou, Y., H. Yue, S. Zhou, L. Fang, Y. Zhou, L. Xu, Z. Liu, T. Wang, L. Zhao, and A. Ghosh   \n241 (2022b). Microseismicity along Xiaojiang Fault Zone (Southeastern Tibetan Plateau) and   \n242 the characterization of interseismic fault behavior, Tectonophysics, 833, 229364,   \n243 doi:https://doi.org/10.1016/j.tecto.2022.229364.   \n244 Zhu, J., Z. Li, and L. Fang (2022a). USTC-Pickers: a Unified Set of seismic phase pickers Transfer   \n245 learned for China, Earthquake Science, 36, 1-11.  ",
  "manuscript submitted to Journal of Geophysical Research: Solid Earth  _en_zh_google": "提交给地球物理研究杂志的手稿：固体地球",
  "1246 Zhu, W., and G. C. Beroza (2018). PhaseNet: a deep-neural-network-based seismic arrival-time   \n1247 picking method, Geophysical Journal International, 216(1), 261-273,   \n1248 doi:10.1093/gji/ggy423.   \n1249 Zhu, W., A. B. Hou, R. Yang, A. Datta, S. M. Mousavi, W. L. Ellsworth, and G. C. Beroza (2022b).   \n1250 QuakeFlow: a scalable machine-learning-based earthquake monitoring workflow with   \n1251 cloud computing, Geophysical Journal International, 232(1), 684-693,   \n1252 doi:10.1093/gji/ggac355.   \n1253 Zhu, W., I. W. McBrearty, S. M. Mousavi, W. L. Ellsworth, and G. C. Beroza (2022c). Earthquake   \n1254 Phase Association Using a Bayesian Gaussian Mixture Model, Journal of Geophysical   \n1255 Research: Solid Earth, 127(5), e2021JB023249,   \n1256 doi:https://doi.org/10.1029/2021JB023249.   \n1257 Zhuang, J., Y. Ogata, and D. Vere-Jones (2002). Stochastic Declustering of Space-Time   \n1258 Earthquake Occurrences, Journal of the American Statistical Association, 97(458), 369-   \n1259 380.  _en_zh_google": "1246 Zhu，W。和G. C. Beroza(2018)。 Phasenet：基于深神经网络的地震到达时间   \n1247选择方法，地球物理杂志国际，216(1)，261-273，   \n1248 doi：10.1093/gji/ggy423。   \n1249年，W.   \n1250地震：具有可扩展的基于机器学习的地震监测工作流程   \n1251 Cloud Computing，Geophysical Journal International，232(1)，684-693，   \n1252 doi：10.1093/gji/ggac355。   \n1253 Zhu，W.，I。W. McBrearty，S。M. Mousavi，W。L. Ellsworth和G. C. Beroza(2022c)。地震   \n1254年相结合，使用贝叶斯高斯混合模型，地球物理学杂志   \n1255研究：固体地球，127(5)，E2021JB023249，   \n1256 doi：https：//doi.org/10.1029/2021JB023249。   \n1257 Zhuang，J.，Y。Ogata和D. Vere-Jones(2002)。时空的随机解释   \n1258地震发生，美国统计协会杂志，97(458)，369-   \n1259 380。"
}